[
    {
        "id": "a61a936988cde4dbe71e6073a3687339",
        "title": "Corn Rallies Back on Monday",
        "doc_url": "https://www.barchart.com/story/news/36895019/corn-rallies-back-on-monday",
        "all_text": "Corn futures came out of the holiday slowed weeks with gains across the board. Front months were up 6 to 7 cents to lead the charge. The CmdtyView national average Cash Corn price was up 7 1/2 cents at $4.06 ¾.\nUSDA tallied corn export shipments at 1.207 MMT (47.5 mbu) during the week ending on January 1. That was 9.6% below the week prior and 37.58% above the same week in last year. Japan was the top destination of 294,366 MT, with 243,382 MT headed to Mexico and 90,557 MT to Guatemala. Marketing year exports for 2025/26 are 26.81 MMT (1.06 bbu) since September 1, which is now 64.83% larger vs. the same period last year. Another 119,195 MT of sorghum was headed to China.\nExport Sales data got caught up this morning, with a total of 756,419 MT of corn sold in the week of 12/25, on the lower end of the expected 0.7-1.5 MMT. That was a marketing year low, and just 2.6% below the same holiday week last year.\nCommitment of Traders data from this afternoon showed managed money flipping back to a net short position of 23,584 contracts in corn futures and options as of December 30. That was a move to the short side of 26,343 contracts\nMar 26 Corn closed at $4.44 1/2, up 7 cents,\nNearby Cash was $4.06 3/4, up 7 1/2 cents,\nMay 26 Corn closed at $4.52, up 6 1/2 cents,\nJul 26 Corn closed at $4.58 1/4, up 6 1/4 cents,",
        "authors": "None",
        "publish_date": "2026-01-05 23:12:44",
        "published_at_raw": "2026-01-05T23:12:44Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures came out of the holiday slowed weeks with gains across the board. Front months were up 6 to 7 cents to lead the charge. The CmdtyView national average Cash Corn price was up 7 1/2 cents at $4.06 ¾. USDA tallied corn export shipments at...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f635478155e4becdb7dd99a6bff6e83f",
        "title": "Corn Taking Back Thin Friday Losses to Start Monday Trade",
        "doc_url": "https://www.barchart.com/story/news/36884510/corn-taking-back-thin-friday-losses-to-start-monday-trade",
        "all_text": "Corn price action is showing 2 to 4 cent gains so far to kick off Monday morning trade. Futures closed out the first session of 2026 with losses of 2 to 3 cents. Preliminary open interest was up 19,969 contracts on Friday. March was back down 12 ½ cents on the holiday week. The CmdtyView national average Cash Corn price was up 2 ½ cents at $3.98 1/4.\nExport Sales data will be officially caught up shortly, with data from the week of 12/25 expected to show between 0.7-1.5 MMT in corn bookings during the week of 12/25.\nA monthly Grains Crushing report from USDA was released on Friday afternoon, showing a total of 471.87 mbu of corn used in ethanol during November. That was slightly above last year and 0.7% below last month. Corn grind in the first quarter was down just 0.2 mbu from 2024/25.\nMar 26 Corn closed at $4.37 1/2, down 2 3/4 cents, currently up 3 1/2 cents\nNearby Cash was $3.98 1/4, up 2 1/2 cents,\nMay 26 Corn closed at $4.45 1/2, down 2 3/4 cents, currently up 2 3/4 cents\nJul 26 Corn closed at $4.52, down 2 1/2 cents, currently up 2 1/2 cents",
        "authors": "None",
        "publish_date": "2026-01-05 13:26:43",
        "published_at_raw": "2026-01-05T13:26:43Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is showing 2 to 4 cent gains so far to kick off Monday morning trade. Futures closed out the first session of 2026 with losses of 2 to 3 cents. Preliminary open interest was up 19,969 contracts on Friday. March was back down 12 ½ ce...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b4306ceb30ca6dfe50783ceda015ff7a",
        "title": "Agriculture sector to stabilise but stay uneven in 2026; soybeans, corn face supply shifts: Report",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/agriculture-sector-to-stabilise-but-stay-uneven-in-2026-soybeans-corn-face-supply-shifts-report/article70473089.ece",
        "all_text": "The agriculture sector is likely to stabilise in 2026, although conditions will remain uneven. In the global soybean market, supply is expected to tighten in the 2025-26 season, with ending stocks forecast to edge lower year-on-year. Demand for soybeans is projected to reach record levels, even as global production declines compared with the previous year.\nThis is driven by record-high demand and a decline in global production, primarily due to a reduction in US soybean plantings amid escalating trade tensions between the US and China, noted ING's Commodities Outlook 2026. \"US soybean production is forecast to fall 2.8 per cent y-o-y to a little under 116m tonnes. This is despite the planted area estimated to have fallen 7.1 per cent y-o-y.\", the report said.\nBrazil is expected to see another record soybean harvest in the 2025-26 season, with production forecast to reach at least 175 million tonnes, up 2 per cent year-over-year. This will reinforce Brazil's dominant position as the key supplier in the global soybean market. On the other hand, corn prices have come under pressure this year due to record corn production.\nThe report expects the corn market to experience more meaningful tightening in the 2026-27 marketing year, with a global deficit of approximately 39m tonnes. \"A deal between the US and China should see US farmers increase soybean acreage at the expense of corn acreage. In addition, we are assuming that yields will fall from the record levels seen in 2025-26 and",
        "authors": "None",
        "publish_date": "2026-01-05 06:40:49",
        "published_at_raw": "2026-01-05T06:40:49Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "The agriculture sector will stabilize in 2026, with uneven conditions affecting soybean, corn, and sugar markets.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ef8d3e7f957b46af5a9549e67a4c993e",
        "title": "Agriculture sector to stabilise but stay uneven in 2026; soybeans, corn face supply shifts: Report",
        "doc_url": "https://www.tribuneindia.com/news/business/agriculture-sector-to-stabilise-but-stay-uneven-in-2026-soybeans-corn-face-supply-shifts-report/",
        "all_text": "New Delhi [India], January 5 (ANI): The agriculture sector is likely to stabilise in 2026, although conditions will remain uneven. In the global soybean market, supply is expected to tighten in the 2025-26 season, with ending stocks forecast to edge lower year-on-year. Demand for soybeans is projected to reach record levels, even as global production declines compared with the previous year.\nThis is driven by record-high demand and a decline in global production, primarily due to a reduction in US soybean plantings amid escalating trade tensions between the US and China, noted ING's Commodities Outlook 2026.\n\"US soybean production is forecast to fall 2.8% YoY to a little under 116m tonnes. This is despite the planted area estimated to have fallen 7.1% YoY.\", the report said.\nBrazil is expected to see another record soybean harvest in the 2025-26 season, with production forecast to reach at least 175 million tonnes, up 2% year-over-year. This will reinforce Brazil's dominant position as the key supplier in the global soybean market.\nOn the other hand, corn prices have come under pressure this year due to record corn production. The report expects the corn market to experience more meaningful tightening in the 2026-27 marketing year, with a global deficit of approximately 39m tonnes.\n\"A deal between the US and China should see US farmers increase soybean acreage at the expense of corn acreage. In addition, we are assuming that yields will fall from the record levels seen in 202",
        "authors": "None",
        "publish_date": "2026-01-05 05:25:25",
        "published_at_raw": "2026-01-05T05:25:25Z",
        "meta_site_name": "The Tribune",
        "description": "Brazil is expected to see another record soybean harvest in the 2025-26 season, with production forecast to reach at least 175 million tonnes, up 2% year-over-year. This will reinforce Brazil's dominant position as the key supplier in the global soybean market.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ef0611e09d90b69396d360e1ead6226f",
        "title": "Euronext wheat slips further while rapeseed rebounds",
        "doc_url": "https://www.marketscreener.com/news/euronext-wheat-slips-further-while-rapeseed-rebounds-ce7e59dedc81f02d",
        "all_text": "Trader\nThis super rating is the result of a weighted average of the rankings based on the following ratings: Global Valuation (Composite), EPS Revisions (4 months), and Visibility (Composite). We recommend that you carefully review the associated descriptions.\nInvestor\nThis super composite rating is the result of a weighted average of the rankings based on the following ratings: Fundamentals (Composite), Global Valuation (Composite), EPS Revisions (1 year), and Visibility (Composite). We recommend that you carefully review the associated descriptions.\nGlobal\nThis composite rating is the result of an average of the rankings based on the following ratings: Fundamentals (Composite), Valuation (Composite), Financial Estimates Revisions (Composite), Consensus (Composite), and Visibility (Composite). The company must be covered by at least 4 of these 5 ratings for the calculation to be performed. We recommend that you carefully review the associated descriptions.\nQuality\nThis composite rating is the result of an average of the rankings based on the following ratings: Capital Efficiency (Composite), Quality of Financial Reporting (Composite), and Financial Health (Composite). The company must be covered by at least 2 of these 3 ratings for the calculation to be performed. We recommend that you carefully review the associated descriptions.",
        "authors": "None",
        "publish_date": "2026-01-05 17:43:18",
        "published_at_raw": "2026-01-05T17:43:18Z",
        "meta_site_name": "MarketScreener",
        "description": "Wheat futures on Euronext edged\ndown for a second session on Monday, with hefty global supply\nweighing on the market, while rapeseed rose sharply in a\ntechnical rebound following a slide last month,...",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e6827f8e3976e8f5531a0c9b8b2b6539",
        "title": "Govt to resume e-auction of wheat",
        "doc_url": "https://www.financialexpress.com/india-news/govt-to-resume-e-auction-of-wheat/4098281/",
        "all_text": "With sluggish offtake due adequate private stock and prospects of a robust harvest, the Food Corporation of India (FCI) is likely to re-launch e-auction of open market sale of wheat after discontinuing the weekly sales since early December.\nSources told FE that only 0.53 million tonne (MT) of wheat was offloaded in the market from the FCI’s stocks sold during November and early December under the open market sale scheme (OMSS) against the target of 3 MT for FY26.\nDue to discouraging response from the flour millers, OMSS sales were discontinued. In FY25, the corporation had sold 3 MT of wheat in the markets from its surplus stock. Officials said that the corporation may sell over 2 MT of wheat in FY26.\nHowever, trade sources said that selling surplus wheat in the market by FCI would further depress prices, which may discourage private purchase of grain from the new marketing season (2026-27) starting from April 1.\nThe crop harvest prospects for 2025-26 looks promising with conducive weather conditon and robust sowing.\n“There is plenty of wheat stock with the private entities, the government selling below the market prices would further depress prices and hit stockists,” sources said.\nThe price of wheat under OMSS for the bulk buyers like millers, is fixed at Rs 2550/quintal for 2025-26, excluding freight. While prevailing marketing prices are in the range of Rs 2800/- Rs 2850/quintal.\nInflation\nInflation in wheat November, 2025 eased further to 0.33% against a price rise of 2.",
        "authors": "None",
        "publish_date": "2026-01-05 15:35:24",
        "published_at_raw": "2026-01-05T15:35:24Z",
        "meta_site_name": "The Financial Express",
        "description": "The price of wheat under OMSS for the bulk buyers like millers, is fixed at Rs 2550/quintal for 2025-26, excluding freight. While prevailing marketing prices are in the range of Rs 2800/- Rs 2850/quintal.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6f63c6e854ff084e6612f8bbc19b1663",
        "title": "Chicago wheat rises as traders weigh Black Sea tensions, supply outlook",
        "doc_url": "https://www.livemint.com/market/commodities/chicago-wheat-rises-as-traders-weigh-black-sea-tensions-supply-outlook-11767578387090.html",
        "all_text": "BEIJING, Jan 5 (Reuters) - Chicago wheat futures rose on Monday as traders assessed Ukraine peace talks and dry weather in the U.S. Plains, while ample global supplies capped gains.\nSoybeans and corn both edged higher after five straight sessions of falls, with corn supported by strong export demand.\nFUNDAMENTALS\n* The most-active wheat contract on the Chicago Board of Trade (CBOT) gained 0.2% to $5.07-1/2 a bushel by 0135 GMT. Corn rose 0.11% to $4.38 a bushel.\n* CBOT soybeans climbed 0.45% to $10.50-1/2 a bushel, though prices remained near levels that have almost wiped out gains made since the late-October trade truce between Beijing and Washington.\n* Chicago soybeans remain under pressure from competition with Brazil, the world's top exporter, as Brazilian supplies are currently priced more competitively than U.S. beans.\n* Favourable South American weather continues to bolster production prospects. Forecaster Vaisala said last week that recent rainfall had improved soil moisture in Brazil's growing areas, with additional rain expected in northern areas through early this week.\n* Last week, the U.S. Department of Agriculture released details about how much row crop farmers will receive next year from a $12 billion aid programme, but soybean growers say such payments fall short of helping those hurt by low crop prices and trade disputes.\n* Market players continued to monitor the progress in negotiations to end Russia's war in Ukraine. Russia launched an air attack on Kyiv, ",
        "authors": "None",
        "publish_date": "2026-01-05 01:59:46",
        "published_at_raw": "2026-01-05T01:59:46Z",
        "meta_site_name": "Livemint",
        "description": "GLOBAL-GRAINS/:GRAINS-Chicago wheat rises as traders weigh Black Sea tensions, supply outlook",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0e9e02e11e5b1ae8aa0464c56489f7ae",
        "title": "Hogs Starting Monday with Gains",
        "doc_url": "https://www.barchart.com/story/news/36890055/hogs-starting-monday-with-gains",
        "all_text": "Lean hog futures are showing $2.25 to $2.60 gains so far on Monday. USDA’s national base hog price was not reported on Monday morning due to thin volume. The CME Lean Hog Index was back down 41 cents on December 31 at $81.85.\nUSDA’s Export Sales report from this morning tallied net cancellations of 336 MT for 2025, with sales of 53,441 MT for 2026 in the week ending on 12/25. Shipments were pegged at 26,142 MT.\nUSDA’s pork carcass cutout value from the Monday AM report was $1.88 higher at $96.45 per cwt. The rib and ham primals were the only reported lower. USDA estimated federal inspected hog slaughter for last week at 2.228 million head. That is 250,000 head above a week ago, but down 41,794 head from the same week last year.\nFeb 26 Hogs are at $86.325, up $2.225,\nApr 26 Hogs are at $91.700, up $2.600\nMay 26 Hogs are at $95.650, up $2.275,",
        "authors": "None",
        "publish_date": "2026-01-05 18:18:44",
        "published_at_raw": "2026-01-05T18:18:44Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are showing $2.25 to $2.60 gains so far on Monday. USDA’s national base hog price was not reported on Monday morning due to thin volume. The CME Lean Hog Index was back down 41 cents on December 31 at $81.85. USDA’s Export Sales rep...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3815f50d6054b062f05d3eec6d8440e2",
        "title": "Town of Campbell receives $40M to install new water utility system",
        "doc_url": "https://www.weau.com/2026/01/05/town-campbell-receives-40m-install-new-water-utility-system/",
        "all_text": "STEVENS POINT, Wis. (WEAU) - U.S. Department of Agriculture Rural Development (RD) Wisconsin State Director Andrew C. Iverson is announcing USDA RD is investing nearly $40 million to help the Town of Campbell install a new water utility system.\nAccording to a press release from the USDA, the investment includes a $30,835,000 loan and a $8,540,000 grant through the USDA RD Water and Waste Disposal Loan and Grant Program.\n“Every Wisconsinite deserves safe, reliable drinking water,” Iverson said. “This investment towards a dependable water utility system in the Town of Campbell will improve the lives of families and businesses in their community. Under the leadership of President Donald J. Trump and Secretary Brooke Rollins, USDA Rural Development is committed to strengthening rural Wisconsin.”\nPer the press release, the new water utility system will consist of:\nTwo municipal water supply wells\nA well house/treatment facility\nA pump house\nAn elevated water storage tank\nApproximately 123,000 lineal feet of distribution system piping",
        "authors": "None",
        "publish_date": "2026-01-05 16:38:49",
        "published_at_raw": "2026-01-05T16:38:49Z",
        "meta_site_name": "WEAU",
        "description": "The funds come from the USDA RD Water and Waste Disposal Loan and Grant Program.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]