[
    {
        "id": "e8112d1f0b22fc1e979c5c06e6325913",
        "title": "Mohan Yadav Ensures Prosperity with Bhavantar Scheme Boost",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3743624-mohan-yadav-ensures-prosperity-with-bhavantar-scheme-boost",
        "all_text": "Chief Minister Mohan Yadav announced a significant financial initiative by transferring Rs 810 crore to the bank accounts of 3.77 lakh soybean farmers through the Bhavantar scheme. This move underscores the government's dedication to ensuring farmers' prosperity and reflects its commitment to the agricultural sector.\nThe Bhavantar scheme offers compensation to farmers if traders buy soybean below the Centre's declared Minimum Support Price (MSP). In a bid to further spur development, Yadav also unveiled and laid foundation stones for 33 projects worth Rs 145 crore in Jaora.\nHighlighting future plans, Yadav declared that the government would focus intensely on farmers' welfare through modern farming methods and innovative technologies by 2026. The government also plans to raise monthly benefits for Ladli Behna beneficiaries and provide solar pumps to more farmers at significant subsidies.\n(With inputs from agencies.)",
        "authors": "None",
        "publish_date": "2025-12-28 14:29:02",
        "published_at_raw": "2025-12-28T14:29:02Z",
        "meta_site_name": "Devdiscourse",
        "description": "Chief Minister Mohan Yadav transferred Rs 810 crore to 3.77 lakh soybean farmers under the Bhavantar scheme. This initiative reflects the government's commitment to farmers' prosperity. The scheme compensates the difference if traders purchase soybean below the Minimum Support Price. Yadav also announced future benefits for farmers.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0666bf1e149429c7c20bfe679dfaf31d",
        "title": "Flour Crisis Deepens In Pakistan As Corruption Chokes Wheat Supply, Prices Soar, Kitchens Run Dry Nationwide Amid Chaos",
        "doc_url": "https://www.newsx.com/world/flour-crisis-deepens-in-pakistan-as-corruption-chokes-wheat-supply-prices-soar-kitchens-run-dry-nationwide-amid-chaos-136155/",
        "all_text": "4\nPakistan is once again grappling with a sharp rise in flour prices as the Sindh government’s latest effort to stabilise the market through subsidised wheat distribution has failed to bring relief.\nThe situation has intensified after flour mill owners refused to lift wheat stocks from government warehouses, alleging corruption within the Food Department, according to The Express Tribune.\nSubsidy Plan Stalls Amid Corruption Allegations\nReports suggest that flour millers have declined to procure government wheat after officials allegedly demanded illegal payments to release stocks.\nAs per mill owners, Food Department officials sought bribes ranging between Pakistani Rs 1,000 and Rs 1,200 per bag. In response, millers have turned to the open market to purchase wheat at significantly higher prices, a move that has directly impacted consumers.\nRetail markets are now selling five-kilogramme flour bags for up to Pakistani Rs 630, while some mills are reportedly charging as much as Pakistani Rs 650. The refusal to lift subsidised wheat has further disrupted supply chains, worsening the flour crisis across Sindh.\nTraders, Quotas and Quality Concerns Deepen Crisis\nThe situation has deteriorated further amid accusations that certain traders newly included in the subsidised wheat scheme are exploiting the policy. These traders are allegedly buying wheat at subsidised rates and reselling it in the open market at inflated prices, reportedly with the tacit support of Food Department offici",
        "authors": "None",
        "publish_date": "2025-12-28 10:29:00",
        "published_at_raw": "2025-12-28T10:29:00Z",
        "meta_site_name": "NewsX",
        "description": "Flour prices are rising again in Pakistan after the Sindh government’s subsidised wheat scheme failed. Alleged bribery by Food Department officials led mill owners to boycott government stocks, forcing costly open-market purchases and pushing flour prices higher for consumers.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e604c47b8c12ab034b050fb5f0121095",
        "title": "Flour crisis deepens in Pakistan as corruption stalls wheat supply",
        "doc_url": "https://www.news18.com/agency-feeds/flour-crisis-deepens-in-pakistan-as-corruption-stalls-wheat-supply-9796702.html",
        "all_text": "Sindh [Pakistan] December 28 (ANI): Pakistan is witnessing a renewed surge in flour prices as the Sindh government’s latest attempt to stabilise the market through subsidised wheat distribution has failed to yield results. According to reports, flour mill owners have refused to lift government wheat stocks, citing alleged demands for illegal payments by officials of the Food Department, which has further aggravated the crisis, The Express Tribune reported.According to The Express Tribune, millers claim officials demanded bribes ranging from Pakistani Rs 1,000 to Rs 1,200 per bag to release wheat from government warehouses. In protest, mill owners have chosen to source wheat from the open market at higher rates, a move that has directly burdened consumers. As a result, five-kilogramme flour bags are being sold for up to Pakistani Rs 630 in retail markets, while some mills are reportedly charging up to Pakistani Rs 650. The situation has worsened amid allegations that specific traders newly included in the subsidised wheat scheme are misusing the policy.These traders are accused of purchasing wheat at subsidised rates and reselling it in the open market at inflated prices, allegedly with the tacit support of officials within the Food Department. This move has angered flour mill owners, who see it as a distortion of the supply system.In response, the Flour Mill Owners Social Welfare Association convened an emergency meeting at the Hyderabad Press Club, chaired by its president H",
        "authors": "None",
        "publish_date": "2025-12-28 10:00:05",
        "published_at_raw": "2025-12-28T10:00:05Z",
        "meta_site_name": "News18",
        "description": "Flour crisis deepens in Pakistan as corruption stalls wheat supply",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f58726ac12f3ae66f4f37d5346075eae",
        "title": "Flour crisis deepens in Pakistan as corruption stalls wheat supply",
        "doc_url": "https://www.tribuneindia.com/news/world/flour-crisis-deepens-in-pakistan-as-corruption-stalls-wheat-supply/",
        "all_text": "Sindh [Pakistan] December 28 (ANI): Pakistan is witnessing a renewed surge in flour prices as the Sindh government's latest attempt to stabilise the market through subsidised wheat distribution has failed to yield results.\nAccording to reports, flour mill owners have refused to lift government wheat stocks, citing alleged demands for illegal payments by officials of the Food Department, which has further aggravated the crisis, The Express Tribune reported.\nAccording to The Express Tribune, millers claim officials demanded bribes ranging from Pakistani Rs 1,000 to Rs 1,200 per bag to release wheat from government warehouses. In protest, mill owners have chosen to source wheat from the open market at higher rates, a move that has directly burdened consumers.\nAs a result, five-kilogramme flour bags are being sold for up to Pakistani Rs 630 in retail markets, while some mills are reportedly charging up to Pakistani Rs 650.\nThe situation has worsened amid allegations that specific traders newly included in the subsidised wheat scheme are misusing the policy.\nThese traders are accused of purchasing wheat at subsidised rates and reselling it in the open market at inflated prices, allegedly with the tacit support of officials within the Food Department. This move has angered flour mill owners, who see it as a distortion of the supply system.\nIn response, the Flour Mill Owners Social Welfare Association convened an emergency meeting at the Hyderabad Press Club, chaired by its presiden",
        "authors": "None",
        "publish_date": "2025-12-28 09:45:19",
        "published_at_raw": "2025-12-28T09:45:19Z",
        "meta_site_name": "The Tribune",
        "description": "According to reports, flour mill owners have refused to lift government wheat stocks, citing alleged demands for illegal payments by officials of the Food Department, which has further aggravated the crisis, The Express Tribune reported.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bf9e967a516482e37059149e2f124aec",
        "title": "Flour crisis deepens in Pakistan as corruption stalls wheat supply",
        "doc_url": "https://www.lokmattimes.com/international/flour-crisis-deepens-in-pakistan-as-corruption-stalls-wheat-supply/",
        "all_text": "Sindh [Pakistan] December 28 : Pakistan is witnessing a renewed surge in flour prices as the Sindh government's latest attempt to stabilise the market through subsidised wheat distribution has failed to yield results.\nAccording to reports, flour mill owners have refused to lift government wheat stocks, citing alleged demands for illegal payments by officials of the Food Department, which has further aggravated the crisis, The Express Tribune reported.\nAccording to The Express Tribune, millers claim officials demanded bribes ranging from Pakistani Rs 1,000 to Rs 1,200 per bag to release wheat from government warehouses. In protest, mill owners have chosen to source wheat from the open market at higher rates, a move that has directly burdened consumers.\nAs a result, five-kilogramme flour bags are being sold for up to Pakistani Rs 630 in retail markets, while some mills are reportedly charging up to Pakistani Rs 650.\nThe situation has worsened amid allegations that specific traders newly included in the subsidised wheat scheme are misusing the policy.\nThese traders are accused of purchasing wheat at subsidised rates and reselling it in the open market at inflated prices, allegedly with the tacit support of officials within the Food Department. This move has angered flour mill owners, who see it as a distortion of the supply system.\nIn response, the Flour Mill Owners Social Welfare Association convened an emergency meeting at the Hyderabad Press Club, chaired by its president Haj",
        "authors": "None",
        "publish_date": "2025-12-28 09:40:08",
        "published_at_raw": "2025-12-28T09:40:08Z",
        "meta_site_name": "Lokmat Times",
        "description": "Flour crisis deepens in Pakistan as corruption stalls wheat supply - Sindh [Pakistan] December 28 : Pakistan is witnessing a renewed surge in flour prices as the Sindh government's latest ... Get Latest News on International only on lokmattimes.com",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]