[
    {
        "id": "de52dd6d3aeb8aa58ab10e2dd6b24055",
        "title": "Corn Collapses on Monday as USDA Hikes Production",
        "doc_url": "https://www.barchart.com/story/news/37008022/corn-collapses-on-monday-as-usda-hikes-production",
        "all_text": "Corn futures extended the losses following the USDA data release on Monday, as futures closed with 22 to 24 ¼ cents in the front months. Deferred contracts were down 5 to 14 ½ cents. The CmdtyView national average Cash Corn price was down 24 cents at $3.83 1/4.\nA private export sale announcement of 204,000 MT of corn was announced to South Korea this morning by USDA, with another 310,000 MT of corn sold to unknown destinations. That news was buried by other not so friendly USDA reports.\nUSDA’s Crop Production report from this morning showed US corn yield at 186.5 bpa, which was a 0.5 bpa increase from the November report. Acres were up 1.3 million on the harvested side to 91.3 million acres. That took the production number to 17.021 bbu, up 269 mbu from November.\nThe quarterly Grain Stocks report tallied December 1 corn stocks at 13.282 bbu. That was well above the average of analysts surveyed at 12.962 bbu, and 1.207 bbu above a year ago.\nWASDE data showed US ending stocks raised by 198 mbu, taking the projection to 2.227 bbu. That came via the production adjustment as carryover from 2024/25 was up 19 mbu, and feed raised by 100 mbu. World ending stocks were raised by 11.76 MMT to 290.91 MMT, with the US increase and a 6.24 MMT increase to Chinese production.\nMonday morning’s Export Inspections report showed 1.49 MMT (58.66 mbu) of corn shipped in the week of 1/8. That was 12.75% above the week prior and 3.4% larger than the same week last year. Mexico was as the largest des",
        "authors": "None",
        "publish_date": "2026-01-12 23:11:48",
        "published_at_raw": "2026-01-12T23:11:48Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures extended the losses following the USDA data release on Monday, as futures closed with 22 to 24 ¼ cents in the front months. Deferred contracts were down 5 to 14 ½ cents. The CmdtyView national average Cash Corn price was down 24 cents at...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "36dbcca8cdd3861c3d3ec8e1aa70ce64",
        "title": "Corn Futures Plunge Most Since 2023 as USDA Surprises with Record Yield Forecast",
        "doc_url": "https://scanx.trade/stock-market-news/commodities/corn-futures-plunge-most-since-2023-as-usda-surprises-with-record-yield-forecast/29797583",
        "all_text": "Corn futures experienced their most significant decline since June 2023, plummeting as much as 5.8% in Chicago following an unexpected supply outlook revision from the US Department of Agriculture. The dramatic reversal caught markets off guard as traders had initially seen gains before the USDA's monthly supply and demand report revealed larger-than-anticipated American corn supplies.\nUSDA Surprises with Record Yield Projections\nThe agriculture department defied widespread analyst expectations by raising the average corn yield to a record 186.5 bushels per acre, up from the previous estimate of 186.0. This increase came as a complete surprise to market participants, with none of the more than 20 analysts surveyed by Bloomberg anticipating a yield hike.\nUSDA Corn Metrics: Current Forecast Previous Estimate Average Yield: 186.5 bushels/acre 186.0 bushels/acre Production: Record high Increased Quarterly Stocks: Above expectations - End-of-season Stocks: Above expectations -\nMany analysts had expected the USDA to reduce the US corn yield estimate following dry weather conditions that emerged toward the end of the growing season. Instead, the agency's upward revision sent shockwaves through commodity markets.\nMarket Impact and Analyst Reactions\n\"The risk for the market was that no one was looking for larger yield in the corn, and that's what we got,\" said Charlie Sernatinger, head of grain futures at Marex. He characterized the report as \"bearish on all fronts,\" highlighting the ",
        "authors": "None",
        "publish_date": "2026-01-12 21:06:23",
        "published_at_raw": "2026-01-12T21:06:23Z",
        "meta_site_name": "scanx.trade",
        "description": "Corn futures dropped 5.8% in their steepest decline since June 2023 after the USDA unexpectedly raised US corn yield forecasts to a record 186.5 bushels per acre. The surprise increase caught all surveyed analysts off guard, who had expected yield cuts due to dry weather conditions. The additional supply adds pressure to grain markets already facing geopolitical demand disruptions and large global harvests.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d2701f4ec849925463c54ee76556d7da",
        "title": "Corn Futures Plummet on Higher-Than-Expected Supply Figures -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/corn-futures-plummet-on-higher-than-expected-supply-figures-daily-grain-highlights-ce7e58dad08ff726",
        "all_text": "By Kirk Maltais\n--Corn for March delivery fell 5.4% to $4.21 3/4 a bushel on the Chicago Board of Trade Monday, in reaction to today's WASDE report from the USDA showing higher ending stocks, production, and yields.\n--Soybeans for March delivery fell 1.1% to $10.50 1/2 a bushel.\n--Wheat for March delivery fell 1% to $5.12 1/4 a bushel.\nHIGHLIGHTS\nOut of Left Field: CBOT grain futures went into a tailspin after unexpected gains to ending stocks and yields reported by the USDA in its WASDE report, reversing the gains seen pre-report. \"Not a single friendly number out there,\" said Charlie Sernatinger of Marex in a note after the WASDE's release. \"We have been talking about how the risk for the market was that no one was looking for larger yield in the corn, and that's what we got.\" For corn, the USDA raised its outlook for crop yields to 186.5 bushels an acre, and increased its forecast for ending stocks by 200 million bushels to 2.23 billion bushels.\nShelter from the Storm: Precious metals got the biggest boost from heightened geopolitical tensions, but other commodities got some support as well, and are increasingly seen as safe places to park money, said Karl Setzer of Consus Ag Consulting. \"Anything that can be turned into a physical asset,\" is getting investor attention, Setzer said. But support seen in precious metal did extend to grains, at least during morning trade.\nINSIGHT\nGrowing Importance: The USDA is forecasting larger U.S. crops than expected by analysts in Januar",
        "authors": "None",
        "publish_date": "2026-01-12 20:29:17",
        "published_at_raw": "2026-01-12T20:29:17Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\n--Corn for March delivery fell 5.4% to $4.21 3/4 a bushel on the Chicago Board of Trade Monday, in reaction to today's WASDE report from the USDA showing higher ending stocks,...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f96c53abfe8f7517fa135e59bf1ca82b",
        "title": "Corn Falling as USDA Raises Corn Production",
        "doc_url": "https://www.barchart.com/story/news/37002942/corn-falling-as-usda-raises-corn-production",
        "all_text": "Corn futures are now liking the taste from USDA’s set of reports as they chew through Monday’s midday. Contracts are down 16 to 17 cents so far. The CmdtyView national average Cash Corn price is down 16 3/4 cents at $3.91 1/2.\nA private export sale announcement of 204,000 MT of corn was announced to South Korea this morning, with another 310,000 MT of corn sold to unknown destinations. That is widely being ignored at midday\nUSDA’s Crop Production report from this morning showed US corn yield at 186.5 bpa, which was a 0.5 bpa increase from the November report. Acres were up 1.3 million on the harvested side to 91.3 million acres. That took the production number to 17.021 bbu, up 269 mbu from November.\nWASDE data showed US ending stocks raised by 198 mbu, taking the projection to 2.227 bbu, vs. a 1.985 bbu expectation via a Bloomberg survey of analysts. That came via the production adjustment as carryover from 2024/25 was up 19 mbu, and feed raised by 100 mbu.\nThe quarterly Grain Stocks report tallied December 1 corn stocks at 13.282 bbu. That was well above the average of analysts surveyed at 12.962 bbu, and 1.207 bbu above a year ago.\nMonday morning’s Export Inspections report showed 1.49 MMT (58.66 mbu) of corn shipped in the week of 1/8. That was 12.75% above the week prior and 3.4% larger than the same week last year. Mexico was as the largest destination of 702,811 MT, with 258,110 MT shipped to Japan and 161,058 MT to Taiwan. The marketing year total is now 28.43 MMT (1.",
        "authors": "None",
        "publish_date": "2026-01-12 17:56:08",
        "published_at_raw": "2026-01-12T17:56:08Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are now liking the taste from USDA’s set of reports as they chew through Monday’s midday. Contracts are down 16 to 17 cents so far. The CmdtyView national average Cash Corn price is down 16 3/4 cents at $3.91 1/2. A private export sale...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c0003a1a0c1da94ddadff29bcd2e3f69",
        "title": "Tourists go nuts for Turkey’s dashing ‘man of the year’",
        "doc_url": "https://www.thetimes.com/world/middle-east/article/turkey-man-of-year-tiktok-whsd68k2m",
        "all_text": "“He has something unique,” the woman says. “He needs to come to Dubai.”\nTemel returns from running errands and immediately gets to work. “What is your name? … Nice to meet you.” He smiles for a group photo with the woman and her friends as others wait, giggling, nearby. “Dobre vecher,” he says. “Buongiorno.” “Salaam.”\n“I came all the way from America!” one woman gushes. “Can I take a picture? I know you will be really famous soon,” another says. A man asks: “Can you record a video and say, ‘Hi Melek?’ Melek loves you so much.”\nTemel has sold chestnuts and corn on this family’s stall, alongside his two brothers, for seven years. It is only for the past two that he has attracted a stream of fans, after videos of him went viral in Indonesia, then Saudi Arabia and Latin America.\nHe launched a social media account a few months ago to counter impersonators who had been using his name to scam people, and things have spiralled since. His videos, which usually show him at work, with chiselled features and strong brow, can attract tens of millions of views on Instagram, where he has about 340,000 followers, and TikTok, on which he has accumulated 5.7 million likes.\nHe racks up tens of thousands of likes from visiting influencers, too. “I visited Istanbul for the culture,” videos say — and the culture turns out to be Temel.\nDespite his success, he is polite and humble. He goes to the gym four times a week but rates his looks as six out of ten and is so dedicated to his work that he has ",
        "authors": "None",
        "publish_date": "2026-01-12 08:15:00",
        "published_at_raw": "2026-01-12T08:15:00Z",
        "meta_site_name": "The Sunday Times",
        "description": "The chestnut and corn seller Alper Temel has smouldered his way to TikTok virality and booming demand — but at the cost of having time for a girlfriend, he says",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "be323819eef4a127525a080bc8df7f4b",
        "title": "Soybean Meal Has Momentum. How Much Higher Can Prices Go?",
        "doc_url": "https://www.barchart.com/story/news/37000664/soybean-meal-has-momentum-how-much-higher-can-prices-go",
        "all_text": "March soybean meal (ZMH26) futures present a buying opportunity on more price strength.\nSee on the daily bar chart for March soybean meal futures that prices have rebounded from the early January low and the bulls have gained some momentum. See, too, at the bottom of the chart that the moving average convergence divergence (MACD) indicator is in a bullish posture as the blue MACD line is above the red trigger line and both lines are trending up. Seasonality studies also favor the soybean complex futures leaning bullish the next month or so.\nFundamentally, China has continued to purchase U.S. soybeans and appears to be living up to its pledge to purchase even more U.S. beans in the coming months.\nA move in March soybean meal futures above chart resistance at $305.00 would give the bulls more power and it would also become a buying opportunity. The upside price objective would be $326.00, or above. Technical support, for which to place a protective sell stop just below, is seen at the January low of $295.20.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in nature.\nHere is what the Commodity Futures Trading Commission (CFTC) has said about futures trading (and I agr",
        "authors": "None",
        "publish_date": "2026-01-12 15:54:09",
        "published_at_raw": "2026-01-12T15:54:09Z",
        "meta_site_name": "Barchart",
        "description": "March soybean meal futures present a buying opportunity on more price strength.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "763510a519fa1e398830c62f6a84a7be",
        "title": "Rabi Season Boost: Wheat Sowing Surges by 2%",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3766746-rabi-season-boost-wheat-sowing-surges-by-2",
        "all_text": "As of January 9, the area under wheat cultivation has seen a 2% increase to 334.17 lakh hectares, marking a positive start to the current rabi season, according to government data.\nThis surge, compared to 328.04 lakh hectares during the same period last year, is largely attributed to favorable monsoon rains and an increase in the minimum support price set by the government, encouraging farmers to expand their sowing areas.\nThe Union agriculture ministry reported progress in rabi crop acreage with significant growth in various sectors, including paddy, pulses, and oilseeds, contributing to an overall rabi crop coverage of 644.29 lakh hectares this season.",
        "authors": "None",
        "publish_date": "2026-01-12 12:27:17",
        "published_at_raw": "2026-01-12T12:27:17Z",
        "meta_site_name": "Devdiscourse",
        "description": "Wheat area increased by 2% to 334.17 lakh hectares by January 9 in the current rabi season, as per government data. This growth is attributed to better monsoon rains and an increased minimum support price. The total rabi crop coverage has reached 644.29 lakh hectares this season.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "40a9c6225433148837986814caf05231",
        "title": "USDA pushes whole dairy with Trump milk mustache. Is it healthier?",
        "doc_url": "https://www.usatoday.com/story/news/health/2026/01/12/trump-milk-mustache-usda/88145160007/",
        "all_text": "Got (whole) milk? The U.S. Department of Agriculture (USDA) says it's time to \"drink up.\"\nThe agency shared an image of President Donald Trump sporting a milk mustache makeover on social media on Jan. 11, quickly amassing millions of views and thousands of comments. The post, accompanied by the hashtag \"#DrinkWholeMilk,\" features an image of Trump looking into the camera while leaning against his Oval Office desk with a glass of milk.\nReminiscent of the \"Got Milk?\" ads of the 90s and 2000s, Trump can be seen in the apparently edited image with a line of milk on his upper lip beneath the title, \"The Milk Mustache Is Back. Drink Whole Milk.\"\nThe push towards whole dairy is part of a new set of guidelines released by the USDA under Health Secretary Robert F. Kennedy Jr. on Jan. 7, which emphasized full-fat dairy, protein and \"healthy fats.\"\nThe social media post itself drew attention from netizens, prompting a mixed set of responses on X, formerly Twitter. Some celebrated the move while others mocked the image, joking that milk sales must be down or accusing the agency of being influenced by the dairy industry.\nRFK's new food pyramid and whole dairy\nThe Department of Agriculture released a new set of dietary guidelines on Jan. 7, essentially flipping the food pyramid as many knew it on its head.\nGrains, which were once the foundation of the suggested diet when the first pyramid was adopted in the 1990s, are now the smallest group and relegated to the bottom. Protein, dairy, fats",
        "authors": "None",
        "publish_date": "2026-01-12 23:12:58",
        "published_at_raw": "2026-01-12T23:12:58Z",
        "meta_site_name": "USA TODAY",
        "description": "Reminiscent of the 'Got Milk?' adverts of the past, Trump's milk mustache promotes the USDA's newly released nutrition guidelines.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "320bd1b29d5bd42d1d7073ff10fd2d35",
        "title": "Wheat Slips Lower on Monday",
        "doc_url": "https://www.barchart.com/story/news/37008042/wheat-slips-lower-on-monday",
        "all_text": "The wheat complex posted losses across all three exchanges on Monday, as USDA data had a bearish spin. Chicago SRW futures were down 6 cents on the session. KC HRW futures posted losses of 3 to 5 cents into the Monday close. MPLS spring wheat was down 1 to 2 cents across the front months.\nExport Inspections data showed wheat shipments at 317,465 MT (11.66 mbu) shipped in the week that ended on January 8. That was an increase of 73.03% from the week prior, and up 2.19% from same week last year. The Philippines was the top destination of 100,459 MT, with 60,419 MT to Mexico and 39,899 MT to Taiwan. Marketing year shipments have totaled 15.581 MMT (572.52 mbu), which is up 19.23% yr/yr.\nUSDA showed no changes the 2025/26 US wheat output, as feed and residual was trimmed by 20 mbu on the balance sheet to 100 and carryover from 2024/25 was up 4 mbu. That took US wheat ending stocks up 25 mbu to 926 mbu per the WASDE report. World wheat stocks were raised by another 3.38 MMT to 278.25 MMT.\nThe quarterly Grain Stocks report showed December 1 wheat stocks at 1.675 bbu, above the average guess of 1.636 bbu. That was also 107 mbu above the same period last year.\nUSDA released their Winter wheat Seedings report this morning, showed all winter wheat acres at 32.99 million acres. That was down 163,000 acres vs. last year. HRW was seen at 23.5 million acres, with 6.14 million for SRW and 3.36 million acres for white wheat.\nMar 26 CBOT Wheat closed at $5.11 1/4, down 6 cents,\nMay 26 CBOT Wh",
        "authors": "None",
        "publish_date": "2026-01-12 23:11:48",
        "published_at_raw": "2026-01-12T23:11:48Z",
        "meta_site_name": "Barchart",
        "description": "The wheat complex posted losses across all three exchanges on Monday, as USDA data had a bearish spin. Chicago SRW futures were down 6 cents on the session. KC HRW futures posted losses of 3 to 5 cents into the Monday close. MPLS spring wheat was dow...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4592862ab060303ae23e8020208ae65b",
        "title": "Soybeans Fall on Monday as USDA Raises Carryout",
        "doc_url": "https://www.barchart.com/story/news/37008032/soybeans-fall-on-monday-as-usda-raises-carryout",
        "all_text": "Soybeans posted Monday losses of 7 to 15 ½ cents across most contracts, as some back months were slightly higher. The cmdtyView national average Cash Bean price was 13 1/4 cents lower at $9.76 1/2. Soymeal futures were a pressure factor, down $3.10-5.40, as Soy Oil futures were up 32 to 58 points. There were 33 deliveries issued against soybeans on Friday night, with 2 for January bean meal.\nCrop Production from this morning showed the NASS soybean yield at 53 bpa, which was unchanged from the November report. Acreage was slightly higher on the harvested side to 80.4 million acres. Production was just 9 mbu higher to 4.262 bbu.\nQuarterly Grain Stocks data showed December 1 soybean stocks at 3.29 bbu. That was 190 mbu larger vs. last year and 40 mbu above analysts estimate of 3.25 bbu.\nWASDE data took the production adjustment into account, as USDA also adjusted exports down 60 mbu to 1.575 bbu and crush up 15 mbu to 2.57 bbu. That took the US ending stock number 60 mbu higher to 350 mbu.\nUSDA’s FGIS tallied soybean export shipments at 1.529 MMT (56.21 mbu) during the week ending on January 8. That was the second largest total this MY, 55.4% larger than the week prior and 12.7% above the same week in last year. China was the top destination of 901,118 MT, with 126,235 MT headed to Mexico. Marketing year exports for 2025/26 are 17.934 MMT (659 mbu) since September 1, which is now 42.7% lower than the same period last year.\nAgRural estimates the Brazilian soybean crop at 0.6% ha",
        "authors": "None",
        "publish_date": "2026-01-12 23:11:48",
        "published_at_raw": "2026-01-12T23:11:48Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans posted Monday losses of 7 to 15 ½ cents across most contracts, as some back months were slightly higher. The cmdtyView national average Cash Bean price was 13 1/4 cents lower at $9.76 1/2. Soymeal futures were a pressure factor, down $3.10-5...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c40c64fd96925bc69d0f06776049a3b7",
        "title": "Hogs Hold Losses into Monday’s Close",
        "doc_url": "https://www.barchart.com/story/news/37008062/hogs-hold-losses-into-mondays-close",
        "all_text": "Lean hog futures posted losses of 80 cents to $1.025 in the front months on Monday. USDA’s national base hog price was not reported on Monday afternoon due to light volume. The CME Lean Hog Index was down 13 cents on Jan 8 at $80.85.\nUSDA’s pork carcass cutout value from the Monday PM report was 78 cents higher at $93.10 per cwt. The butt primal was the only reported lower. USDA estimated federally inspected hog slaughter for Monday at 497,000 head. That is 1,000 head shy of last Monday but 13,474 head above the same week last year.\nFeb 26 Hogs closed at $84.425, down $0.875,\nApr 26 Hogs closed at $90.750, down $1.025\nMay 26 Hogs closed at $95.025, down $0.825,",
        "authors": "None",
        "publish_date": "2026-01-12 23:11:48",
        "published_at_raw": "2026-01-12T23:11:48Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted losses of 80 cents to $1.025 in the front months on Monday. USDA’s national base hog price was not reported on Monday afternoon due to light volume. The CME Lean Hog Index was down 13 cents on Jan 8 at $80.85. USDA’s pork car...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "775541487f69e058c9b78109c793c26b",
        "title": "Cotton Holds Gains on Monday",
        "doc_url": "https://www.barchart.com/story/news/37008072/cotton-holds-gains-on-monday",
        "all_text": "Cotton futures close with gains of 50 to 55 points across the front months on Monday, as USDA data was friendlier to the market. Crude oil futures were back up 72 cents per barrel at $59.84. The US dollar index was down $0.215 at $98.675.\nNASS Cotton Ginnings data showed 11.962 million RB of cotton ginned as of January 1, which was down from a year ago by 1.023 million RB.\nUSDA showed cotton harvested acres up 430,000 acres, with yield down 73 lbs/acre, at 856 lbs. That took production down 0.35 million bales to 13.92 million. Ending stocks were 300,000 bales lower to 4.2 million.\nThe Friday online auction from The Seam showed sales of 56.57 cents/lb on 4,773 bales. The Cotlook A Index was down 35 points on January 9 at 74.45 cents. ICE certified cotton stocks were steady on 1/9 with the certified stocks level at 11,510 bales. The Adjusted World Price was updated to 50.97 cents/lb on Thursday afternoon, up 21 points from the week prior.\nMar 26 Cotton closed at 64.91, up 50 points,\nMay 26 Cotton closed at 66.44, up 53 points,\nJul 26 Cotton closed at 67.86, up 55 points",
        "authors": "None",
        "publish_date": "2026-01-12 23:11:48",
        "published_at_raw": "2026-01-12T23:11:48Z",
        "meta_site_name": "Barchart",
        "description": "Cotton futures close with gains of 50 to 55 points across the front months on Monday, as USDA data was friendlier to the market. Crude oil futures were back up 72 cents per barrel at $59.84. The US dollar index was down $0.215 at $98.675. NASS Cotton...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "050663577793d9d84994a4dde2b3afc0",
        "title": "Corn Drops Most Since 2023 as USDA Unexpectedly Raises US Yield",
        "doc_url": "https://www.livemint.com/market/corn-drops-most-since-2023-as-usda-unexpectedly-raises-us-yield-11768251643295.html",
        "all_text": "Corn futures fell by the most since June 2023 after the US Department of Agriculture raised its outlook for American supplies when analysts were expecting a cut.\nThe agency in its monthly supply and demand report boosted the average corn yield and production to fresh records while quarterly and end-of-season stocks also came in bigger than anticipated.\nCorn futures reversed earlier gains to drop as much as 5.8% in Chicago.\nThe added supply comes as markets were already struggling against big global grain and oilseed harvests, and demand that’s been interrupted by geopolitics from US President Donald Trump’s dispute with China to fresh attacks in Russia’s war with Ukraine.\nMany analysts had expected the USDA to cut the US corn yield for months after weather turned dry at the end of the growing season. The agency instead raised the yield to 186.5 bushels per acre, from 186.0 previously. None of the more than 20 analysts surveyed by Bloomberg expected a hike.\n“The risk for the market was that no one was looking for larger yield in the corn, and that’s what we got,” said Charlie Sernatinger, head of grain futures at Marex. The report was “bearish on all fronts.”\nStrong corn demand has been a relative bright spot for US farmers for more than a year, enticing them last spring to boost plantings at the expense of crops like soy. Overall favorable weather had yields up across the majority of the Corn Belt, with record highs in states including Indiana, Nebraska, Minnesota and the Dak",
        "authors": "None",
        "publish_date": "2026-01-12 21:00:42",
        "published_at_raw": "2026-01-12T21:00:42Z",
        "meta_site_name": "Livemint",
        "description": "Corn futures fell by the most since June 2023 after the US Department of Agriculture raised its outlook for American supplies when analysts were expecting a cut.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9049ca812b0b8bf16b5b1aa6869e9aef",
        "title": "Check your fridge, freezer - Multiple Class I recalls issued; 82K pounds of meat impacted",
        "doc_url": "https://www.masslive.com/news/2026/01/check-your-fridge-freezer-multiple-class-i-recalls-issued-82k-pounds-of-meat-impacted.html",
        "all_text": "The U.S. Department of Agriculture has issued a surge of Class I food recalls over the past month, impacting consumers across the country.\nIn December alone, the USDA’s Food Safety and Inspection Service (FSIS) announced six Class I recalls, covering more than 81,000 pounds of meat and poultry products.\nA Class I recall is the most serious level, meaning there is a “reasonable probability” that consuming the product could cause serious health consequences or death, according to FSIS.\nAll six December recalls are ongoing.\nHere’s what consumers should know about each case.\nNationwide\nOlympia Provisions kielbasa\nNearly 2,000 pounds of ready-to-eat holiday kielbasa are being recalled after a consumer reported finding metal in the product.\nThe affected 16-ounce vacuum-sealed packages have “BEST IF USED BY Feb. 19, 2026” dates.\nProducts were shipped to retailers in California, Oregon and Washington, and sold nationwide online.\nNo injuries have been reported as of Jan. 12.\nSuzanna’s Kitchen breaded chicken\nMore than 62,500 pounds of fully cooked, bone-in breaded chicken are being recalled nationwide due to misbranding and an undeclared soy allergen.\nThe products were distributed in 18-pound cases that contained four units of “Fully Cooked Breaded Chicken Portions” with the case code “P-1380 126237 B30851 23:11 K04” printed on the side of the packaging.\nState specific\nMountain West Food Group ground beef\nAbout 2,855 pounds of raw ground beef sold in six states are being recalled due ",
        "authors": "None",
        "publish_date": "2026-01-12 19:00:00",
        "published_at_raw": "2026-01-12T19:00:00Z",
        "meta_site_name": "MassLive",
        "description": "The USDA has issued multiple Class I food recalls — the most serious level — impacting 81,000+ pounds of meat and poultry sold nationwide.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "017575c80aca68ffc4c11f99fea37eeb",
        "title": "Wheat Falling Post-USDA Data Release",
        "doc_url": "https://www.barchart.com/story/news/37002963/wheat-falling-post-usda-data-release",
        "all_text": "The wheat complex is trading with losses across all three markets, giving back early session gains. Chicago SRW futures are down 5 to 6 cents at midday. KC HRW futures are posting 3 to 6 cent losses. MPLS spring wheat is fractionally lower at midday,\nExport Inspections data showed wheat shipments at 317,465 MT (11.66 mbu) shipped in the week that ended on January 8. That was an increase of 73.03% from the week prior, and up 2.19% from same week last year. The Philippines was the top destination of 100,459 MT, with 60,419 MT to Mexico and 39,899 MT to Taiwan. Marketing year shipments have totaled 15.581 MMT (572.52 mbu), which is up 19.23% yr/yr.\nUSDA showed no changes the 2025/26 US wheat output, as feed and residual was trimmed by 20 mbu on the balance sheet to 100 and carryover from 2024/25 was up 4 mbu. That took US wheat ending stocks up 25 mbu to 926 mbu per the WASDE report. World wheat stocks were raised by another 3.38 MMT to 278.25 MMT.\nThe quarterly Grain Stocks report showed December 1 wheat stocks at 1.675 bbu, above the average guess of 1.636 bbu. That was also 107 mbu above the same period last year.\nUSDA released their Winter wheat Seedings report this morning, showed all winter wheat acres at 32.99 million acres. That was above trade ideas of 32.4 million acres and down 163,000 acres vs. last year. HRW was seen at 23.5 million acres, with 6.14 million estimated for SRW and 3.36 million acres for white wheat.\nMar 26 CBOT Wheat is at $5.11, down 6 1/4 cents,\nMay",
        "authors": "None",
        "publish_date": "2026-01-12 17:56:08",
        "published_at_raw": "2026-01-12T17:56:08Z",
        "meta_site_name": "Barchart",
        "description": "The wheat complex is trading with losses across all three markets, giving back early session gains. Chicago SRW futures are down 5 to 6 cents at midday. KC HRW futures are posting 3 to 6 cent losses. MPLS spring wheat is fractionally lower at midday,...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "dfa87802eb982961b3f31e7a48fc4cdd",
        "title": "Soybeans Posting Monday Weakness as USDA Raises Carryout",
        "doc_url": "https://www.barchart.com/story/news/37002952/soybeans-posting-monday-weakness-as-usda-raises-carryout",
        "all_text": "Soybeans are down 9 to 13 cents so far as trader sift through the USDA report at midday. The cmdtyView national average Cash Bean price is 9 1/4 cents lower at $9.80 1/4. Soymeal futures are down $4.20-4.60, as Soy Oil futures are up 80 to 85 points. There were 33 deliveries issued against soybeans on Friday night, with 2 for January bean meal.\nUSDA’s FGIS tallied soybean export shipments at 1.529 MMT (56.21 mbu) during the week ending on January 8. That was the second largest total this MY, 55.4% larger than the week prior and 12.7% above the same week in last year. China was the top destination of 901,118 MT, with 126,235 MT headed to Mexico. Marketing year exports for 2025/26 are 17.934 MMT (659 mbu) since September 1, which is now 42.7% lower than the same period last year.\nCrop Production from this morning showed the NASS soybean yield at 53 bpa, which was unchanged from the November report. Acreage was slightly higher on the harvested side to 80.4 million acres. Production was just 9 mbu higher to 4.262 bbu.\nWASDE data took that production adjustment into account, as USDA also adjusted exports down 60 mbu to 1.575 bbu and crush up 15 mbu to 2.57 bbu. That took the US ending stock number 60 mbu higher to 350 mbu, vs. estimates of 295 mbu.\nQuarterly Grain Stocks data showed December 1 soybean stocks at 3.29 bbu. That was 190 mbu larger vs. last year and 40 mbu above analysts estimate of 3.25 bbu.\nAgRural estimates the Brazilian soybean crop at 0.6% harvested by last Thurs",
        "authors": "None",
        "publish_date": "2026-01-12 17:56:08",
        "published_at_raw": "2026-01-12T17:56:08Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are down 9 to 13 cents so far as trader sift through the USDA report at midday. The cmdtyView national average Cash Bean price is 9 1/4 cents lower at $9.80 1/4. Soymeal futures are down $4.20-4.60, as Soy Oil futures are up 80 to 85 points....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "db787a4359c97fdbc6d493625a6a4f33",
        "title": "Hogs Falling at Monday’s Midday",
        "doc_url": "https://www.barchart.com/story/news/37002986/hogs-falling-at-mondays-midday",
        "all_text": "Lean hog futures are showing $1.125 to $1.47 gains at midday. USDA’s national base hog price was not reported on Monday morning due to light volume. The CME Lean Hog Index was down 13 cents on Jan 8 at $80.85.\nUSDA’s pork carcass cutout value from the Monday AM report was $1.91 higher at $94.23 per cwt. The butt and ham primals were reported lower. USDA estimated federally inspected hog slaughter for last week at 2.683 million head. That is 149,191 head above the same week last year.\nFeb 26 Hogs are at $84.175, down $1.125,\nApr 26 Hogs are at $90.300, down $1.475\nMay 26 Hogs are at $94.500, down $1.350,",
        "authors": "None",
        "publish_date": "2026-01-12 17:56:08",
        "published_at_raw": "2026-01-12T17:56:08Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are showing $1.125 to $1.47 gains at midday. USDA’s national base hog price was not reported on Monday morning due to light volume. The CME Lean Hog Index was down 13 cents on Jan 8 at $80.85. USDA’s pork carcass cutout value from t...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8f386e93442d962f93f8c0d3af33977a",
        "title": "USDA Raises Production and Stocks Above Trade Expectations",
        "doc_url": "https://www.agriculture.com/january-usda-wasde-report-11880000",
        "all_text": "Today, USDA released four major reports: the January World Agricultural Supply and Demand Estimates (WASDE), Crop Production 2025 Summary, quarterly Grain Stocks, and Winter Wheat and Canola Seedings reports.\nCrop Production 2025 Summary\nIn the Crop Production 2025 Summary, USDA increased corn yield and production higher than trade expectations. Soybean yield and production were mostly unchanged, both slightly higher than trade expectations.\nWASDE\n2025/2026 U.S. Ending Stocks\nUSDA estimated 2025/2026 U.S. corn, soybean, and wheat ending stocks higher month-over-month and well above trade expectations.\n2025/2026 Global Ending Stocks\nUSDA pegged 2025/2026 global ending stocks higher month-over-month in corn, soybeans, and wheat.\n2025/2026 Brazil and Argentina Crop Production\nUSDA placed corn and soybean production estimates for Argentina and Brazil below trade expectations. Corn and soybeans in Brazil and Argentina were unchanged.\nGrain Stocks\nIn the quarterly Grain Stocks report, USDA pegged corn, soybean, and wheat grains stocks totals in all positions higher year-over-year. The expectation was also more than the trade expected.\nWinter Wheat Seedings\nIn the Winter Wheat and Canola Seedings report, USDA estimated 2026 winter wheat planted acres were slightly lower year-over-year but above trade expectations.\nTrade Reaction\nNick Tsiolis, founder & CEO, Farmer's Keeper: \"What a shocker. USDA is clearly not on the same page as the farmer or the analyst, for that matter. This ceme",
        "authors": "None",
        "publish_date": "2026-01-12 17:33:50",
        "published_at_raw": "2026-01-12T17:33:50Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA Raises Production and Stocks Above Trade Expectations",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b535a892bca86715c6b2f30401a3590b",
        "title": "Markets Await New News from the USDA",
        "doc_url": "https://www.barchart.com/story/news/37001409/markets-await-new-news-from-the-usda",
        "all_text": "Enjoy the benefits of Blue Line Futures\nOpen an account with Blue Line Futures and you will gain access to our daily commodity commentary, free desktop/mobile trading platforms, 24-hour trade desk, and more!\nOPEN AN ACCOUNT\nFutures trading involves a substantial risk of loss and may not be suitable for all investors. Therefore, carefully consider whether such trading is suitable for you in light of your financial condition. Trading advice is based on information taken from trade and statistical services and other sources Blue Line Futures, LLC believes are reliable. We do not guarantee that such information is accurate or complete and it should not be relied upon as such. Trading advice reflects our good faith judgment at a specific time and is subject to change without notice. There is no guarantee that the advice we give will result in profitable trades. All trading decisions will be made by the account holder. Past performance is not necessarily indicative of future results.\nBlue Line Futures is a member of NFA and is subject to NFA’s regulatory oversight and examinations. However, you should be aware that the NFA does not have regulatory oversight authority over underlying or spot virtual currency products or transactions or virtual currency exchanges, custodians, or markets. Therefore, carefully consider whether such trading is suitable for you considering your financial condition.\nWith Cyber-attacks on the rise, attacking firms in the healthcare, financial, energy, and ",
        "authors": "None",
        "publish_date": "2026-01-12 16:42:07",
        "published_at_raw": "2026-01-12T16:42:07Z",
        "meta_site_name": "Barchart",
        "description": "Grain markets, traders, hedgers, and others are anxiously awaiting new news from the USDA. Will the data help spur a rally, or trigger a selloff? Oliver Sloup joins RFD-TV to break it down, tune in to learn more!",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "56c7a40ee30988187380478e9cc880e4",
        "title": "Markets Await New News from the USDA",
        "doc_url": "https://www.barchart.com/story/news/37001408/markets-await-new-news-from-the-usda",
        "all_text": "Enjoy the benefits of Blue Line Futures\nOpen an account with Blue Line Futures and you will gain access to our daily commodity commentary, free desktop/mobile trading platforms, 24-hour trade desk, and more!\nOPEN AN ACCOUNT\nFutures trading involves a substantial risk of loss and may not be suitable for all investors. Therefore, carefully consider whether such trading is suitable for you in light of your financial condition. Trading advice is based on information taken from trade and statistical services and other sources Blue Line Futures, LLC believes are reliable. We do not guarantee that such information is accurate or complete and it should not be relied upon as such. Trading advice reflects our good faith judgment at a specific time and is subject to change without notice. There is no guarantee that the advice we give will result in profitable trades. All trading decisions will be made by the account holder. Past performance is not necessarily indicative of future results.\nBlue Line Futures is a member of NFA and is subject to NFA’s regulatory oversight and examinations. However, you should be aware that the NFA does not have regulatory oversight authority over underlying or spot virtual currency products or transactions or virtual currency exchanges, custodians, or markets. Therefore, carefully consider whether such trading is suitable for you considering your financial condition.\nWith Cyber-attacks on the rise, attacking firms in the healthcare, financial, energy, and ",
        "authors": "None",
        "publish_date": "2026-01-12 16:42:07",
        "published_at_raw": "2026-01-12T16:42:07Z",
        "meta_site_name": "Barchart",
        "description": "Grain markets, traders, hedgers, and others are anxiously awaiting new news from the USDA. Will the data help spur a rally, or trigger a selloff? Oliver Sloup joins RFD-TV to break it down, tune in to learn more!",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a2e68ec90c05ed6cddd515ae61e20fc2",
        "title": "Today’s Midday USDA Data Dump Is the Key Catalyst to Watch in Grain Markets",
        "doc_url": "https://www.barchart.com/story/news/37001369/todays-midday-usda-data-dump-is-the-key-catalyst-to-watch-in-grain-markets",
        "all_text": "Last week was not bad for corn (ZCH26) and soybean (ZSH26) futures bulls, as prices consolidated most of the week after last Monday’s good gains. Corn futures remain in the middle of a choppy and sideways trading range, but that could change starting today. Soybeans have made a solid rebound from the early January low, with winter wheat futures (ZWH26) (KEH26) markets bulls also showing some strength last week.\nToday’s midday USDA supply and demand report will kick things into gear this week for grain markets traders. A Reuters poll showed analysts expect, on average, 2025 U.S. corn production at 16.552 billion bu. (16.752 billion in the November report) and an average yield of 184.00 bu. an acre (186.0 in the November report). U.S. quarterly corn stocks as of Dec. 1 are estimated at 12.962 billion bu. (12.075 billion bu. on Dec. 1, 2024). The 2025-26 marketing year ending stocks for U.S. corn are seen at 1.972 billion bu. (2.029 billion bu. in the December report). The 2025-26 Argentine corn crop is seen at 53.63 million MT (53.0 million MT in the December report). The 2025-26 Brazilian corn crop is seen at 132.46 million MT (131.00 million MT in the December report). The 2025-26 global ending stocks for corn are seen at 279.62 million MT (279.15 million MT in the December report).\nThe Reuters poll showed analysts on average expect 2025 U.S. soybean production at 4.229 billion bu. (4.253 billion in the November report) and an average yield of 52.7 bu. an acre (53.0 in the No",
        "authors": "None",
        "publish_date": "2026-01-12 16:39:48",
        "published_at_raw": "2026-01-12T16:39:48Z",
        "meta_site_name": "Barchart",
        "description": "There could be at least one surprise in the big USDA report, so stay tuned.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "04eb983e3e3259b931fe278eb1b6cc4a",
        "title": "Pre-Report Markets Higher | Monday, Jan. 12, 2026",
        "doc_url": "https://www.agriculture.com/pre-report-markets-higher-or-monday-jan-12-2026-11883462",
        "all_text": "Just before 9:30 a.m. CT, March corn was up ½¢ at $4.46¼ per bushel.\nMarch soybeans were up 4¼¢ at $10.66¾ per bushel.\n\"Futures are solidly higher in overnight trade as managed money is flowing back into safe haven holdings, and this includes commodities,\" said Karl Setzer, partner with Consus Ag Consulting. \"We are also seeing short covering in the market ahead of the USDA data release [Monday]. WASDE numbers, quarterly stocks, and U.S. winter seeding data will all be released. For the most part, trade is expecting larger quarterly stocks but relatively steady ending stocks. There will be something for everyone in today’s reports. Soybeans are taking additional support from reports China booked 10 U.S. vessels last Friday.\"\nMarch CBOT wheat was up 6¢ at $5.23¼ per bushel. March Kansas City wheat increased 9¼¢ at $5.39½ per bushel. March Minneapolis wheat jumped 5¢ at $5.65 per bushel.\nFebruary live cattle were up $1.65 at $235.37 per hundredweight (cwt). March feeder cattle were 5¢ higher at $354.75 per cwt. February lean hogs were down $1.20 at $84.10 per cwt.\nAt 9:33 a.m. CT, February crude oil was up 29¢ at $58.83 per barrel.\nThe S&P 500 Index was down 9.46 points, and the Dow Jones Industrial Average decreased 263.46 points.\nThe March U.S. Dollar Index was down 330 points.\nPublished: 9:37 a.m. CT",
        "authors": "None",
        "publish_date": "2026-01-12 15:37:23",
        "published_at_raw": "2026-01-12T15:37:23Z",
        "meta_site_name": "Successful Farming",
        "description": "Short covering ahead of a USDA report and managed money movement is affecting commodities according to Karl Setzer, partner with Consus Ag Consulting.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a36122a8315fa2677b91c1930ab981fb",
        "title": "Grains Gain Ground Ahead of WASDE",
        "doc_url": "https://www.barchart.com/story/news/37000377/grains-gain-ground-ahead-of-wasde",
        "all_text": "USDA Report, out at 11am CT.\nCorn\nTechnicals (March)\nMarch corn futures are starting the week on firm footing with prices levitating to the upper end of last week’s trade. Whether or not the market can hold the strength through the session is the big question, considering we have a meaningful USDA report out at 11am CT. The big resistance band we are keeping an eye on is still above the market, 451-453. A conviction close above that and we could see the upward momentum build. The 14-day average true range is near the lowest levels of the last year. Coincidently, this report last year is what changed the course for the market. Can it do it again?\nTechnical Levels of Importance\nResistance: 451-453****, 456-457**\nPivot: 443 3/4-445 3/4\nSupport: 434 1/2-436***, 425-427****\nSoybeans\nTechnicals (March)\nSoybeans have nestled into our pivot pocket over the last several trading days as market participants await new news from the USDA. 1066 1/2-1070 1/2 remains intact and a pocket on the chart that we view as a near term inflection point. A conviction close above or below could set the tone for a more intermediate term trend. The next upside resistance comes in from 1082-1085, above that and momentum could start to feed on itself. On the flipside, that pocket is 1057 1/4-1059.\nReady to dig in?\nSubscribe to our daily Grain Express for fresh insights into Soybeans, Wheat, and Corn. Get our expert technical analysis, proprietary trading levels, and actionable market bias delivered right t",
        "authors": "None",
        "publish_date": "2026-01-12 15:36:16",
        "published_at_raw": "2026-01-12T15:36:16Z",
        "meta_site_name": "Barchart",
        "description": "Grain markets firm ahead of today’s highly anticipated USDA report. Can the market see a repeat of last year, which was the start of a bigger rally?",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "594cf45437e780ac0a9b6cf69c9b201d",
        "title": "Grains Gain Ground Ahead of WASDE",
        "doc_url": "https://www.barchart.com/story/news/37000376/grains-gain-ground-ahead-of-wasde",
        "all_text": "USDA Report, out at 11am CT.\nCorn\nTechnicals (March)\nMarch corn futures are starting the week on firm footing with prices levitating to the upper end of last week’s trade. Whether or not the market can hold the strength through the session is the big question, considering we have a meaningful USDA report out at 11am CT. The big resistance band we are keeping an eye on is still above the market, 451-453. A conviction close above that and we could see the upward momentum build. The 14-day average true range is near the lowest levels of the last year. Coincidently, this report last year is what changed the course for the market. Can it do it again?\nTechnical Levels of Importance\nResistance: 451-453****, 456-457**\nPivot: 443 3/4-445 3/4\nSupport: 434 1/2-436***, 425-427****\nSoybeans\nTechnicals (March)\nSoybeans have nestled into our pivot pocket over the last several trading days as market participants await new news from the USDA. 1066 1/2-1070 1/2 remains intact and a pocket on the chart that we view as a near term inflection point. A conviction close above or below could set the tone for a more intermediate term trend. The next upside resistance comes in from 1082-1085, above that and momentum could start to feed on itself. On the flipside, that pocket is 1057 1/4-1059.\nReady to dig in?\nSubscribe to our daily Grain Express for fresh insights into Soybeans, Wheat, and Corn. Get our expert technical analysis, proprietary trading levels, and actionable market bias delivered right t",
        "authors": "None",
        "publish_date": "2026-01-12 15:36:16",
        "published_at_raw": "2026-01-12T15:36:16Z",
        "meta_site_name": "Barchart",
        "description": "Grain markets firm ahead of today’s highly anticipated USDA report. Can the market see a repeat of last year, which was the start of a bigger rally?",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9fffa7bffe0f4cf24f07cb2cd6e245cf",
        "title": "6,000 lbs of meat recalled for bypassing inspection: Return ASAP",
        "doc_url": "https://www.masslive.com/news/2026/01/6000-lbs-of-meat-recalled-for-bypassing-inspection-return-asap.html",
        "all_text": "More than 5,900 pounds of meat sold in seven states is being recalled for bypassing federal inspection before distribution.\nAccording to the U.S. Department of Agriculture, nearly 6,000 pounds of fresh salted lamb products sold by Ghanaianway Restaurant and Grocery between March 11, and Dec. 3, 2025, were not inspected.\nAffected products were shipped to restaurant and retail locations in Connecticut, Maryland, Massachusetts, Minnesota, New Jersey, New York and Pennsylvania.\nRead more: National bakery chain abruptly closes all locations after 20 years\nProducts included in the recall have a 1-year shelf life, though it is not indicated on the packaging.\n“The products subject to recall do not bear a USDA mark of inspection nor do they declare a best by or production date,” the recall states.\n“Some packages do not bear a label at all.”\nThe USDA is “concerned” affected products may still be in freezers or refrigerators and warns the public not to eat or serve affected products.\nInstead, consumers are advised to throw these products away or return them to where the products were purchased.\nAs of Jan. 12, 2026, no illnesses have been reported relating to the recall.",
        "authors": "None",
        "publish_date": "2026-01-12 15:22:20",
        "published_at_raw": "2026-01-12T15:22:20Z",
        "meta_site_name": "MassLive",
        "description": "Check your freezer: The USDA is recalling thousands of pounds of lamb for skipping federal inspection. Affected products were sold in seven states, including Mass.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b09a1c59562354846cbd8aeac304a7fa",
        "title": "Soybeans Posting Pre-USDA Gains on Monday Morning",
        "doc_url": "https://www.barchart.com/story/news/36997095/soybeans-posting-pre-usda-gains-on-monday-morning",
        "all_text": "Soybeans are starting of the USDA report day with 5 to 6 cent gains. Futures slipped off the midday highs on Friday with contracts up 1 to 1 ½ ents in the front months at the close. March was up 16 3/4 cents on the week. Open interest was up 10,054 contracts, mostly in March and July. The cmdtyView national average Cash Bean price was 1 1/2 cents higher at $9.90 3/4. Soymeal futures closed Friday with January down 40 cents and other contracts up a dime to $1.80, as March was up $7.70 last week. Soy Oil futures were 15 to 23 points higher on the day, as March was 39 points higher on the week. There were 33 deliveries issued against soybeans on Friday night, with 2 for January bean meal.\nA private export sale of 198,000 MT of soybeans were sold to unknown destinations on Friday according to the USDA. Wire sources indicated that China bought another 10 cargoes of US beans for April – May shipment on Friday.\nCrop Production data will be released later this morning, with the annual report expected to show the final 2025 soybean yield estimate at 52.7 bpa. Production is pegged at 4.23 bbu according to a Bloomberg survey of analysts. WASDE data will is expected to tally the 2025/26 soybean ending stocks number at 295 mbu, a 5 mbu increase mo/mo.\nQuarterly Grain Stocks data is estimated to tally 3.25 bbu of soybean stocks on December 1 expected according to a Reuters survey of analysts. The range of estimates is 2.95 to 3.445 bbu.\nCommitment of Traders data indicated spec traders cut",
        "authors": "None",
        "publish_date": "2026-01-12 13:29:15",
        "published_at_raw": "2026-01-12T13:29:15Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are starting of the USDA report day with 5 to 6 cent gains. Futures slipped off the midday highs on Friday with contracts up 1 to 1 ½ ents in the front months at the close. March was up 16 3/4 cents on the week. Open interest was up...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f405c71893aa692218ea7f8fb14a0e63",
        "title": "Corn Starting Monday with Slight Gains",
        "doc_url": "https://www.barchart.com/story/news/36997083/corn-starting-monday-with-slight-gains",
        "all_text": "Corn is showing Monday AM gains of 1 to 2 cents. Futures spent the Friday session squaring up ahead of Monday’s USDA report, with contracts fractionally lower. March managed to close the week with an 8 ¼ cent gain. Open interest was down 2,028 contracts. The CmdtyView national average Cash Corn price was down ¼ cent at $4.07 1/4.\nUSDA will release a slew of data later this morning. The annual Crop Production report expected to show US corn production at 16.553 bbu, as yield is estimated at 184 bpa according to a Bloomberg survey of analysts. US corn ending stocks are estimated at 1.985 bbu, a 44 mbu reduction if realized.\nUSDA will also release their quarterly Grain Stocks report on Monday, with a Reuters survey of analysts looking for December 1 corn stocks at 12.962 bbu, with a range of estimates from 12.05 to 13.31 bbu.\nCFTC data from Friday afternoon showed managed money trimming 7,158 contracts from their net short in corn futures and options as of January 6, taking it to 16,426 contracts.\nA couple South Korean importers purchased a total of 134,000 MT of corn in separate tenders on Friday.\nBrazil’s first corn crop is estimated at 0.5% harvested as of Thursday according to AgRural, with the larger second crop tallied at 0.2% planted.\nMar 26 Corn closed at $4.45 3/4, down 1/4 cent, currently up 1 3/4 cents\nNearby Cash was $4.07 1/4, down 1/4 cent,\nMay 26 Corn closed at $4.53 3/4, down 1/4 cent, currently up 1 3/4 cents\nJul 26 Corn closed at $4.60 1/4, down 1/4 cent, curre",
        "authors": "None",
        "publish_date": "2026-01-12 13:29:15",
        "published_at_raw": "2026-01-12T13:29:15Z",
        "meta_site_name": "Barchart",
        "description": "Corn is showing Monday AM gains of 1 to 2 cents. Futures spent the Friday session squaring up ahead of Monday’s USDA report, with contracts fractionally lower. March managed to close the week with an 8 ¼ cent gain. Open interest was down 2,028 contra...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "87d3a99a0e2703acb8df7b3d9aa4fe6f",
        "title": "Wheat Rallying Ahead of USDA Report",
        "doc_url": "https://www.barchart.com/story/news/36997105/wheat-rallying-ahead-of-usda-report",
        "all_text": "Wheat is trading with 4 to 9 cent gains so far on Monday morning. The wheat complex spent the Friday session squaring up ahead of the Monday USDA reports. Chicago SRW futures were fractionally lower, with March up 10 ¾ cents last week. Open interest was up 3,792 contracts on Friday. KC HRW futures closed with steady action, as March was 15 ¼ cents higher on the week. OI was down 463 contracts. MPLS spring wheat was down 3 to 4 cents on the day, as that pushed the March contracts down 3 ¼ cents lower on the week.\nUSDA will release their Winter wheat Seedings report today, with analysts surveyed by Bloomberg looking for all winter wheat acreage at 32.4 million acres. HRW is seen at 23 million acres, with 5.9 million estimated for SRW and 3.5 million acres for white wheat. US wheat ending stocks are seen down 5 mbu to 896 mbu per the WASDE report.\nThe quarterly Grain Stocks report is expected to show an average guess of 1.636 bbu of wheat on hand as of December 1. The range of estimates is 1.59 to 1.696 bbu.\nNow up to date Commitment of Traders data showed managed money increasing their net short in CBT wheat futures and options as of January 6, taking the total to 107,165 contracts. In KC wheat, spec traders were heading the opposite direction, cutting 2,664 contracts from their net short to 15,655 contracts, the smallest since November 2024.\nMar 26 CBOT Wheat closed at $5.17 1/4, down 3/4 cent, currently up 7 3/4 cents\nMay 26 CBOT Wheat closed at $5.28 3/4, down 1/4 cent, curr",
        "authors": "None",
        "publish_date": "2026-01-12 13:29:15",
        "published_at_raw": "2026-01-12T13:29:15Z",
        "meta_site_name": "Barchart",
        "description": "Wheat is trading with 4 to 9 cent gains so far on Monday morning. The wheat complex spent the Friday session squaring up ahead of the Monday USDA reports. Chicago SRW futures were fractionally lower, with March up 10 ¾ cents last week. Open interest...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1da5651848dfe78e451a849fc0f3bb9f",
        "title": "ARC, PLC Signup to be Significantly Delayed",
        "doc_url": "https://www.agriculture.com/partners-arc-plc-signup-to-be-significantly-delayed-11883344",
        "all_text": "By Ryan Hanrahan\nAgri-Pulse’s Philip Brasher reported that “the Agriculture Department has finalized some revisions to two major farm commodity programs, including rules for adding new base acres, but signup for the programs won’t be scheduled until after planting season at the earliest, according to a top USDA official.”\n“The changes, which take effect for 2026, include increases in reference prices for the Price Loss Coverage program and raising the Agriculture Risk Coverage program guarantee to 90% of the benchmark revenue,” Brasher reported. “A 61-page final rule to be published in the Federal Register on Monday makes those and other revisions to ARC, PLC, and the Dairy Margin Coverage program that were required by the One Big Beautiful Bill Act, passed by Congress in July.”\n“Richard Fordyce, USDA’s undersecretary for farm production and conservation, said in an interview with Agri-Pulse that annual signup for DMC will start on Monday, but he had no timetable for enrollment in ARC and PLC for the 2026 crop year,” Brasher reported. “‘We are going to have a signup period that is going to be certainly fair to producers (and) that will reflect the work … we’ve got to get done on the front end to get to the place where we can do that signup,’ Fordyce said. ‘By no means will the signup time frame put any producer in peril.'”\n“Fordyce indicated that one issue delaying ARC and PLC enrollment is the workload in Farm Service Agency offices,” Brasher reported. “The rule being publis",
        "authors": "None",
        "publish_date": "2026-01-12 12:38:06",
        "published_at_raw": "2026-01-12T12:38:06Z",
        "meta_site_name": "Successful Farming",
        "description": "Enrollment for Agriculture Risk Coverage and Price Loss Coverage farm safety-net programs will be significantly delayed past planting season as USDA finalizes rule changes under the One Big Beautiful Bill Act, while Dairy Margin Coverage opens Monday.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ee9f9d2d1db00e0d1d8bb6a17374734a",
        "title": "USDA finds Iowa hunger rates below national average but rising",
        "doc_url": "https://www.desmoinesregister.com/story/news/2026/01/12/iowa-hunger-rates-usda/87996248007/",
        "all_text": "Federal data says Iowa's food insecurity rates are below the national average despite the state seeing an uptick in the number of people facing hunger in recent years.\nIn the 2024 Household Food Security Report, Iowa was listed among 28 states that saw \"statistically significant increases\" in the prevalence of food insecurity in households. Nearly 11% of Iowa households were food insecure from 2022 to 2024 — a 57% increase from the 7% reported over the 2019-2021 period, the report said.\nThe national food insecurity rate was 13.7%, according to the report.\nThe prevalence of \"very low food security\" in households across those 28 states — including Iowa — also rose over the same period. That meant households struggled at points to buy food, according to the U.S. Department of Agriculture, which released the report. Some family members may regularly skip meals or eat less.\nFrom 2022-2024, about 4% of Iowa households fell in that category — double the percentage points reported in the 2019-2021 period.\nFood banks and pantries nationwide and in Iowa have faced record demand as pandemic relief programs helping families stay afloat ended. The federal government shutdown last year along with lapses in SNAP benefits further strained Iowa's food banks, pantries and communities.\nAbout 48 million people in the U.S. struggled to get enough food in 2024 — a slight increase from the roughly 47 million in 2023, the USDA found.\nOf the 48 million, 33 million were adults and 14 million were chil",
        "authors": "None",
        "publish_date": "2026-01-12 12:02:25",
        "published_at_raw": "2026-01-12T12:02:25Z",
        "meta_site_name": "Des Moines Register",
        "description": "A USDA report finds Iowa was among 28 states that saw \"statistically significant increases\" in the prevalence of food insecurity in households.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4ef244b7d1d67a5c7e20e0361a67bd05",
        "title": "USDA finds Iowa hunger rates below national average but rising",
        "doc_url": "https://www.amestrib.com/story/news/2026/01/12/iowa-hunger-rates-usda/87996248007/",
        "all_text": "Federal data says Iowa's food insecurity rates are below the national average despite the state seeing an uptick in the number of people facing hunger in recent years.\nIn the 2024 Household Food Security Report, Iowa was listed among 28 states that saw \"statistically significant increases\" in the prevalence of food insecurity in households. Nearly 11% of Iowa households were food insecure from 2022 to 2024 — a 57% increase from the 7% reported over the 2019-2021 period, the report said.\nThe national food insecurity rate was 13.7%, according to the report.\nThe prevalence of \"very low food security\" in households across those 28 states — including Iowa — also rose over the same period. That meant households struggled at points to buy food, according to the U.S. Department of Agriculture, which released the report. Some family members may regularly skip meals or eat less.\nFrom 2022-2024, about 4% of Iowa households fell in that category — double the percentage points reported in the 2019-2021 period.\nFood banks and pantries nationwide and in Iowa have faced record demand as pandemic relief programs helping families stay afloat ended. The federal government shutdown last year along with lapses in SNAP benefits further strained Iowa's food banks, pantries and communities.\nAbout 48 million people in the U.S. struggled to get enough food in 2024 — a slight increase from the roughly 47 million in 2023, the USDA found.\nOf the 48 million, 33 million were adults and 14 million were chil",
        "authors": "None",
        "publish_date": "2026-01-12 12:02:25",
        "published_at_raw": "2026-01-12T12:02:25Z",
        "meta_site_name": "Ames Tribune",
        "description": "A USDA report finds Iowa was among 28 states that saw \"statistically significant increases\" in the prevalence of food insecurity in households.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]