[
    {
        "id": "47f6dac7745093f02ed381bcfccb9db9",
        "title": "Corn Fades Lower on Monday",
        "doc_url": "https://www.barchart.com/story/news/36516865/corn-fades-lower-on-monday",
        "all_text": "Corn futures found weaker trade on Monday as traders were squaring up ahead of a Tuesday USDA report. Contracts were down fractionally to 2 cents. The CmdtyView national average Cash Corn price was down 1 1/4 cents at $3.98 1/4.\nExport Inspections data showed corn at 1.453 MT (57.2 mbu) shipped in the week that ended on December 4. That was a drop of 10.89% from the week prior but up 36% from same week last year. Mexico was the top destination of 520,691 MT, with 310,828 MT to Japan and 81,209 MT to Taiwan. Marketing year shipments have totaled 20.63 MMT (812.2 mbu), a 69.36% increase yr/yr.\nUSDA’s catchup report for Export Sales data this morning showed just 979,525 MT of corn sold in the week ending on November 6. That fell shy of traders looking for 1-2 MMT of corn bookings and was a marketing year low.\nThe monthly WASDE report will be out on Tuesday, with analysts surveyed by Bloomberg looking for 2.145 bbu of US corn ending stocks, a 9 mbu drop from the November report if realized.\nBrazil’s AgRural estimates the Brazilian corn crop at 135.3 MMT for 2025/26, a 5.8 MMT drop from the year prior. USDA’s estimate, which is subject for review in Tuesday’s WASDE is 131 MMT.\nDec 25 Corn closed at $4.36 1/4, down 1/2 cent,\nNearby Cash was $3.98 1/4, down 1 1/4 cents,\nMar 26 Corn closed at $4.43 3/4, down 1 cent,\nMay 26 Corn closed at $4.51 1/4, down 1 cent,",
        "authors": "None",
        "publish_date": "2025-12-08 23:01:02",
        "published_at_raw": "2025-12-08T23:01:02Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures found weaker trade on Monday as traders were squaring up ahead of a Tuesday USDA report. Contracts were down fractionally to 2 cents. The CmdtyView national average Cash Corn price was down 1 1/4 cents at $3.98 1/4. Export Inspections d...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1a1d38390e6506e450e81ddad3d19b5e",
        "title": "Corn Slipping Lower on Monday",
        "doc_url": "https://www.barchart.com/story/news/36512266/corn-slipping-lower-on-monday",
        "all_text": "Corn futures are showing 1 to 2 cent losses across the front months on Monday, with December down 3 cents. The CmdtyView national average Cash Corn price is down 1 3/4 cents at $3.98 1/2.\nExport Inspections data showed corn at 1.453 MT (57.2 mbu) shipped in the week that ended on December 4. That was a drop of 10.89% from the week prior but up 36% from same week last year. Mexico was the top destination of 520,691 MT, with 310,828 MT to Japan and 81,209 MT to Taiwan. Marketing year shipments have totaled 20.63 MMT (812.2 mbu), a 69.36% increase yr/yr.\nUSDA’s catchup report for Export Sales data this morning showed just 979,525 MT of corn sold in the week ending on November 6. That fell shy of traders looking for 1-2 MMT of corn bookings and was a marketing year low.\nCommitment of Traders data from Friday afternoon showed managed money slashing 71,479 contracts from their net short position as of October 28. That took the position to 89,506 contracts. Commercials were trimming longs and adding shorts, increasing their net short by 77,722 contracts to 128,585 contracts\nThe monthly WASDE report will be out on Tuesday, with analysts surveyed by Bloomberg looking for 2.145 bbu of US corn ending stocks, a 9 mbu drop from the November report if realized.\nBrazil’s AgRural estimates the Brazilian corn crop at 135.3 MMT for 2025/26, a 5.8 MMT drop from the year prior.\nDec 25 Corn is at $4.33 3/4, down 3 cents,\nNearby Cash is at $3.98 1/2, down 1 3/4 cents,\nMar 26 Corn is at $4.43 1/2, ",
        "authors": "None",
        "publish_date": "2025-12-08 18:15:03",
        "published_at_raw": "2025-12-08T18:15:03Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are showing 1 to 2 cent losses across the front months on Monday, with December down 3 cents. The CmdtyView national average Cash Corn price is down 1 3/4 cents at $3.98 1/2. Export Inspections data showed corn at 1.453 MT (57.2 mbu) sh...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2e7a9f0f813d02e8b25f775311cf77f0",
        "title": "Corn Starting Monday with Slight Gains",
        "doc_url": "https://www.barchart.com/story/news/36506697/corn-starting-monday-with-slight-gains",
        "all_text": "Corn price action is fractionally to 2 cents higher so far on Monday morning. Futures posted losses of a penny to 2 ½ cents on Friday, with March closing the week with a 3 cent loss. Friday’s open interest was up 8,511 contracts. The CmdtyView national average Cash Corn price was down 2 ¼ cents on the day at $3.99 1/4.\nCommitment of Traders data from Friday afternoon showed managed money slashing 71,479 contracts from their net short position as of October 28. That took the position to 89,506 contracts. Commercials were trimming longs and adding shorts, increasing their net short by 77,722 contracts to 128,585 contracts\nUSDA will release another catchup report for Export Sales data this morning, with traders looking for 1-2 MMT of corn bookings in the week ending on November 6.\nThe monthly WASDE report will be out on Tuesday, with analysts surveyed by Bloomberg looking for 2.145 bbu of US corn ending stocks, a 9 mbu drop from the November report if realized.\nThe Buenos Aires Grains Exchange estimates the Argentina corn crop at 44% planted, lagging the 46% pace from last year. Brazil’ AgRural estimates the Brazilian corn crop at 135.3 MMT for 2025/26, a 5.8 MMT drop from the year prior.\nDec 25 Corn closed at $4.36 3/4, down 1 cent, currently up ¼ cent\nNearby Cash was $3.99 1/4, down 2 1/4 cents,\nMar 26 Corn closed at $4.44 3/4, down 2 1/2 cents, currently up 2 cents\nMay 26 Corn closed at $4.52 1/4, down 2 1/4 cents, currently up 1 ¾ cents",
        "authors": "None",
        "publish_date": "2025-12-08 13:33:02",
        "published_at_raw": "2025-12-08T13:33:02Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is fractionally to 2 cents higher so far on Monday morning. Futures posted losses of a penny to 2 ½ cents on Friday, with March closing the week with a 3 cent loss. Friday’s open interest was up 8,511 contracts. The CmdtyView nation...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e1588909f30828a229f27deca199641b",
        "title": "Hogs Push Higher into the Close on Monday",
        "doc_url": "https://www.barchart.com/story/news/36516913/hogs-push-higher-into-the-close-on-monday",
        "all_text": "Lean hog futures were 12 to 65 cents higher across most nearby contracts on Monday. USDA’s national base hog price was reported at $70.04 on Monday afternoon, down $1.49 from the day prior. The CME Lean Hog Index was down 2 cents on December 4 at $81.81.\nExport Sales data showed 30,745 MT of pork sold in the week ending on 11/6. Export Shipments were 31,750 MT, the largest since June.\nUSDA’s pork carcass cutout value from the Monday PM report was down 88 cents to $95.51 per cwt. The rib and loin primals were the only reported higher. USDA estimated federally inspected hog slaughter for Monday at 494,000 head. That was 12,000 head above last week and 8,352 head above the same week last year.\nDec 25 Hogs closed at $82.300, up $0.650,\nFeb 26 Hogs closed at $82.400, up $0.125\nApr 26 Hogs closed at $86.975, up $0.200,",
        "authors": "None",
        "publish_date": "2025-12-08 23:01:03",
        "published_at_raw": "2025-12-08T23:01:03Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were 12 to 65 cents higher across most nearby contracts on Monday. USDA’s national base hog price was reported at $70.04 on Monday afternoon, down $1.49 from the day prior. The CME Lean Hog Index was down 2 cents on December 4 at $81...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "191e3366e694382b1ddf4792e8c12694",
        "title": "Soybeans Face Weakness, as USDA Confirms First Shipments to China",
        "doc_url": "https://www.barchart.com/story/news/36516876/soybeans-face-weakness-as-usda-confirms-first-shipments-to-china",
        "all_text": "Soybeans posted losses of 8 to 11 ½ cents across most contracts on Monday. The cmdtyView national average Cash Bean price was 11 1/2 cents lower at $10.23. Soymeal futures were 20 cents to $1.30 in the red. Soy Oil futures saw 34 to 51 point losses.\nUSDA reported a private export sale of 132,000 MT of soybeans to China this morning.\nThis morning’s Export Inspections report showed a total of 1.018 MMT (37.41 mbu) of soybeans shipped in the week of 12/4. That was 41.4% below the same week last year and 10.6% above last week’s total. Mexico was the largest buyer of 132,050 MT, with 119,895 MT shipped to China and 91,171 MT to Indonesia. The marketing year total is now 12.9 MMT (473.98 mbu) of soybeans shipped, which is now 45.2% below the same period last year.\nThe backlog of USDA Export Sales reports showed data for the week ending on 11/6 this morning, with soybean bookings on the low side of estimates of 0.45-1.6 MMT at 510,554 MT. That was a marketing year low, as most buyers were absent on the price rally, with a total of 232,000 MT sold to China in that week. Soybean meal sales were just 93,483 MT, on the low side of 50,000 to 400,000 MT estimates. Bean oil sales were 12,549 MT, in the middle of 5,000 to 25,000 MT expectations.\nWASDE data will be updated on Tuesday, as traders are looking for 306 mbu in US soybean ending stocks, up 16 mbu from the previous month if realized.\nChina imported a total of 8.11 MMT of soybean in November, a 14.5% drop from October. AgRural estim",
        "authors": "None",
        "publish_date": "2025-12-08 23:01:02",
        "published_at_raw": "2025-12-08T23:01:02Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans posted losses of 8 to 11 ½ cents across most contracts on Monday. The cmdtyView national average Cash Bean price was 11 1/2 cents lower at $10.23. Soymeal futures were 20 cents to $1.30 in the red. Soy Oil futures saw 34 to 51 point losses....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "90a683c2e0733ac38178cc5b70d4da88",
        "title": "Row Crop Farmers Set for $11 Billion in Aid by February, USDA Says",
        "doc_url": "https://www.agriculture.com/row-crop-farmers-set-for-usd11-billion-in-aid-by-february-usda-says-11864559",
        "all_text": "President Donald Trump today announced $12 billion in farmer aid, including $11 billion for row crop farmers, to be released by the end of February 2026.\nThe long-awaited announcement happened at a White House roundtable that included Agriculture Secretary Brooke Rollins and Treasury Secretary Scott Bessent, among other politicians and farmers.\nRollins called the one-time bridge payments “the bridge that is needed to get from the last administration, and what happened under the last president and the last U.S. Department of Agriculture, to this new Golden Age of farmers.”\n“This country and our farm economy is facing a crisis that we inherited that most of these farmers have not seen in their lifetime,” Rollins said. “Profitability is down. It's just one crisis after another.” She said Trump came into office facing a lack of trade deals and rising input costs, among other challenges.\n“It was an absolute war on agriculture and on our rural communities,” Rollins said, noting that changed on Jan. 20.\nThe $11 billion will be released by Feb. 28, 2026, according to Rollins, but eligible farmers will know how much they will receive by the end of this month, she said.\n“So, as you are going to your lender, as you are working to [understand] what you can plant for next year, you will have that number in hand,” Rollins said. “We will continue to talk to our farmers, continue to understand exactly what this looks like and what is necessary.”\nBessent praised the reopening of U.S. trade wi",
        "authors": "None",
        "publish_date": "2025-12-08 21:21:25",
        "published_at_raw": "2025-12-08T21:21:25Z",
        "meta_site_name": "Successful Farming",
        "description": "The Trump administration announced $12 billion in farmer aid, with USDA saying the program will provide “the bridge that is needed” as row crop producers will learn their payment amounts by month’s end.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d5b3f22a222781f5289def503a27a08f",
        "title": "Get Ready for a Big USDA Data Week in the Wobbly Grain Markets",
        "doc_url": "https://www.barchart.com/story/news/36513854/get-ready-for-a-big-usda-data-week-in-the-wobbly-grain-markets",
        "all_text": "With soybean (ZSF26) and wheat (ZWH26) (KEH26) markets presently on a slippery slope and corn (ZCH26) grinding sideways, grain traders will get to feast on a fresh batch of economic data from the United States Department of Agriculture early this week.\nOn Tuesday, the USDA will release its December World Agricultural Supply and Demand Estimates (WASDE). Analysts surveyed by Bloomberg, on average, look for the agency to lower its estimate of U.S. corn ending stocks by 8.2 million bushels from its November figure to 2.146 billion bushels. The analysts look for USDA to peg U.S. soybean ending stocks up 16 million bushels, to 306.1 million bushels. And analysts, on average, look for USDA to peg U.S. wheat stocks down 7.2 million bushels at 893.8 million bushels.\nCorn Trapped in a Sideways Grind\nMarch corn futures last week lost 3 cents from the week prior. Corn is trading right in the middle of a choppy range, suggesting more of the same price action in the near term.\nGrowing weather in South American corn regions will move to center stage of the market in the coming weeks. Weather forecasters say frequent rain and improving conditions for crops will continue through the next two weeks in most growing regions of Brazil. In Argentina, timely rains are expected through the next two weeks.\nSoybean Bears Gain Momentum\nJanuary soybeans Friday hit a four-week low and for the week were down 32 1/2 cents. January soybean meal (ZMF26) Friday hit a four-week low and on the week was down $1",
        "authors": "None",
        "publish_date": "2025-12-08 20:00:02",
        "published_at_raw": "2025-12-08T20:00:02Z",
        "meta_site_name": "Barchart",
        "description": "Wheat and soybeans are on a slippery slope while corn is stuck grinding sideways.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3b379d9bec5a2b0c70beebc4fe00ca1b",
        "title": "Hogs Showing Mixed Monday Trade",
        "doc_url": "https://www.barchart.com/story/news/36512309/hogs-showing-mixed-monday-trade",
        "all_text": "Lean hog futures are trading with 35 cent gains in the December contract with other contracts slightly lower. USDA’s national base hog price was not reported on Monday morning due to light volume. The CME Lean Hog Index was down 2 cents on December 4 at $81.81.\nCommitment of Traders data from Friday afternoon showed managed money slashing 22,070 contracts from their net long in lean hog futures and options as of October 28. That took the net long to 95,161 contracts.\nExport Sales data showed 30,745 MT of pork sold in the week ending on 11/6. Export Shipments were 31,750 MT, the largest since June.\nUSDA’s pork carcass cutout value from the Monday AM report was down 25 cents to $96.14 per cwt. The rib, ham, and belly primals were the only reported higher. USDA estimated federally inspected hog slaughter for last week at 2.702 million head. That was 98,210 head above the week last year.\nDec 25 Hogs are at $82.000, up $0.350,\nFeb 26 Hogs are at $82.250, down $0.025\nApr 26 Hogs is at $86.725, down $0.050,",
        "authors": "None",
        "publish_date": "2025-12-08 18:15:03",
        "published_at_raw": "2025-12-08T18:15:03Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are trading with 35 cent gains in the December contract with other contracts slightly lower. USDA’s national base hog price was not reported on Monday morning due to light volume. The CME Lean Hog Index was down 2 cents on December 4...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d54c298f75f4f712f3bc1e3bd3aeca1d",
        "title": "Grains Mixed This Morning | Monday, Dec. 8, 2025",
        "doc_url": "https://www.agriculture.com/market-update-or-monday-dec-8-2025-11863999",
        "all_text": "A little after 9 a.m. CT, March corn was up a penny at $4.45¾ per bushel.\nJanuary soybeans were down 9¢ at $10.96¼ per bushel.\nMarch CBOT wheat was up 2¢ at $5.37¾ per bushel. March KC wheat was down 2¼¢ at $5.29 per bushel. March Minneapolis wheat was up 3¼¢ at $5.76¼.\nThis morning, USDA announced China is buying 132,000 metric tons of soybeans for the 2025/2026 marketing year.\nTomorrow USDA is expected to release the December World Agricultural Supply and Demand Estimates (WASDE) and Crop Production reports. The Federal Reserve's Federal Open Market Committee (FOMC) is meeting Tuesday and Wednesday this week. Al Kluis, managing director of Kluis Commodity Advisors, said: \"This week is likely to be volatile. Not only are we watching the weather forecasts in South America, but we are watching what the USDA reports show Tuesday, and what the [FOMC] announces on Wednesday.” He added that the FOMC is expected to cut interest rates by 0.25%.\n“The key market factor remains the weather in Brazil,” Kluis said. “With dry conditions continuing in southern Brazil, the trade will likely lower corn and soybean crop projections for Brazil again later this week. Our main South American crop consultant Dr. Michael Cordonner thinks we have seen the largest corn and soybean crop projections.”\nShortly past 9 a.m. CT, January feeder cattle were up $1.78 at $337.28 per hundredweight (cwt). February live cattle were up 25¢ at $227.40 per cwt. February lean hogs were up 5¢ at $82.33 per cwt.\nJanua",
        "authors": "None",
        "publish_date": "2025-12-08 15:36:14",
        "published_at_raw": "2025-12-08T15:36:14Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA announced new export sales to China this morning.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "fb576523b20f679d66e444fdc783c081",
        "title": "Hogs Look to New Week of Trade",
        "doc_url": "https://www.barchart.com/story/news/36506744/hogs-look-to-new-week-of-trade",
        "all_text": "Lean hog futures posted nearby gains of 40 cents to $1 on Friday, as December was up $1.05 last week. USDA’s national base hog price was reported at $71.53 on Friday afternoon, down $1.12 from the day prior. The CME Lean Hog Index was up 16 cents on December 3 at $81.83.\nCommitment of Traders data from Friday afternoon showed managed money slashing 22,070 contracts from their net long in lean hog futures and options as of October 28. That took the net long to 95,161 contracts.\nUSDA’s pork carcass cutout value from the Friday PM report was up $3.06 to $96.39 per cwt. All primals were reported higher. USDA estimated federally inspected hog slaughter for last week at 2.702 million head. That was 98,210 head above the week last year.\nDec 25 Hogs closed at $81.650, up $0.525,\nFeb 26 Hogs closed at $82.275, up $0.425\nApr 26 Hogs closed at $86.775, up $1.000,",
        "authors": "None",
        "publish_date": "2025-12-08 13:33:03",
        "published_at_raw": "2025-12-08T13:33:03Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted nearby gains of 40 cents to $1 on Friday, as December was up $1.05 last week. USDA’s national base hog price was reported at $71.53 on Friday afternoon, down $1.12 from the day prior. The CME Lean Hog Index was up 16 cents on...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]