[
    {
        "id": "371fe40eab382aa55953935578913a12",
        "title": "Corn Rallies Ahead of Turkey Day",
        "doc_url": "https://www.barchart.com/story/news/36334829/corn-rallies-ahead-of-turkey-day",
        "all_text": "Corn bulls were in rally mode on Wednesday, with contracts 7 to 8 cents higher ahead of the Thanksgiving break. Friday is first notice day for December futures. The CmdtyView national average Cash Corn price closed the day at $4.04. The market will be closed on Thursday for Thanksgiving, with a hard open at 8:30 CST on Friday and an early close.\nUSDA’s catchup continues on Friday, with the Export Sales report for the week ending on October 16 released that morning. Analysts are looking for corn bookings to have totaled 1.4-2.5 MMT for the current marketing year and 0.5 to 1 MMT for the next marketing year. USDA’s backlog of daily announcements pegged 1.59 MMT for 2025/26 and 548,640 MT for 2026/27 in that week.\nWeekly EIA data from this morning showed a total of 1.113 million barrels per day of ethanol production in the week ending on 11/21. That was a 22,000 bpd increase on the week and a near record total. Stocks of ethanol dropped 339,000 barrels to 21.968 million barrels. Ethanol exports were down 23,000 barrels per day to 122,000 bpd, with refiner inputs of ethanol down 3,000 bpd to 885,000 bpd.\nDec 25 Corn closed at $4.31 3/4, up 8 1/4 cents,\nNearby Cash was $4.04, up 17 cents,\nMar 26 Corn closed at $4.45 1/4, up 7 cents,\nMay 26 Corn closed at $4.53, up 6 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-11-26 22:39:20",
        "published_at_raw": "2025-11-26T22:39:20Z",
        "meta_site_name": "Barchart",
        "description": "Corn bulls were in rally mode on Wednesday, with contracts 7 to 8 cents higher ahead of the Thanksgiving break. Friday is first notice day for December futures. The CmdtyView national average Cash Corn price closed the day at $4.04. The market will b...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "13e187e5b979f41fd78efb6c7736e3fc",
        "title": "Corn Bulls Rallying Ahead of Turkey Day",
        "doc_url": "https://www.barchart.com/story/news/36331436/corn-bulls-rallying-ahead-of-turkey-day",
        "all_text": "Corn bulls are in rally mode on Wednesday, with contracts 7 to 8 points higher ahead of the Thanksgiving break. Friday is first notice day for December futures. The CmdtyView national average Cash Corn price was up 1/4 cent at $3.88. The market will be closed on Thursday for Thanksgiving, with a hard open at 8:30 CST on Friday and an early close.\nWeekly EIA data from this morning showed a total of 1.113 million barrels per day of ethanol production in the week ending on 11/21. That was a 22,000 bpd increase on the week and a near record total. Stocks of ethanol dropped 339,000 barrels to 21.968 million barrels. Ethanol exports were down 23,000 barrels per day to 122,000 bpd, with refiner inputs of ethanol down 3,000 bpd to 885,000 bpd.\nDelayed CFTC data from the week of October 14 showed managed money with a net short position of 191,055 contracts in corn futures and options. That was an addition of 49,089 contracts as of that week. Commercial slashed 37,930 contracts from their net short to just 13,776 contracts, as longs were increasing.\nDec 25 Corn is at $4.30 3/4, up 7 1/4 cents,\nNearby Cash is at $3.95 1/2, up 7 1/2 cents,\nMar 26 Corn is at $4.45 3/4, up 7 1/2 cents,\nMay 26 Corn is at $4.53 3/4, up 7 cents,",
        "authors": "None",
        "publish_date": "2025-11-26 18:23:32",
        "published_at_raw": "2025-11-26T18:23:32Z",
        "meta_site_name": "Barchart",
        "description": "Corn bulls are in rally mode on Wednesday, with contracts 7 to 8 points higher ahead of the Thanksgiving break. Friday is first notice day for December futures. The CmdtyView national average Cash Corn price was up 1/4 cent at $3.88. The market will...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f6e4c3e4c925cafe3e0c2a6a0b4aae19",
        "title": "First notice day and increasing demand for U.S. corn could present buying opportunities",
        "doc_url": "https://www.barchart.com/story/news/36317427/first-notice-day-and-increasing-demand-for-u-s-corn-could-present-buying-opportunities",
        "all_text": "I am Stephen Davis, senior market strategist at Walsh Trading, Inc., in Chicago, Illinois. You can reach me at 312- 878-2391 and sdavis@walshtrading.com.\nA promising beginning to the corn market this morning could be dampened by tomorrow's first notice day. If you hold a long position in December corn, you must close your position by the end of the trading day tomorrow, November 26, to avoid delivery obligations.\nIn my opinion, first notice day is an opportunity to buy corn at lower prices. Additionally, end-of-month positioning will be a significant factor throughout the remainder of this week.\nAccording to shipping schedules seen by global news agency Reuters, three cargo vessels are enroute to U.S. terminals to load grains bound for China. Two will carry the first U.S. soybean shipments to China since May. A third vessel headed to a Texas Gulf Coast grain terminal is to be loaded with China-bound U.S. sorghum (milo) in what will be the first American shipment of the feed grain to China since mid-March.\nIn essence, China is resuming the importation of grains from the United States. Meanwhile, corn prices on China's Dalian Commodity Exchange (DCE) have rallied to their highest since September, fueling speculation that heavy rains have damaged crops in China's growing region.\nTop destinations for U.S. corn shipments last week were Mexico, Japan and South Korea. South Korea has made additional purchases this week of 264,000 tons. Corn demand remains robust, and, in my opinion,",
        "authors": "None",
        "publish_date": "2025-11-26 01:29:56",
        "published_at_raw": "2025-11-26T01:29:56Z",
        "meta_site_name": "Barchart",
        "description": "I am Stephen Davis, senior market strategist at Walsh Trading, Inc., in Chicago, Illinois. You can reach me at 312- 878-2391 and sdavis@walshtrading.com. A promising beginning to the corn market this morning could be dampened by tomorrow's first noti...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "83a47bf20ccc1d86431dc915899bd345",
        "title": "First notice day and increasing demand for U.S. corn could present buying opportunities",
        "doc_url": "https://www.barchart.com/story/news/36317428/first-notice-day-and-increasing-demand-for-u-s-corn-could-present-buying-opportunities",
        "all_text": "I am Stephen Davis, senior market strategist at Walsh Trading, Inc., in Chicago, Illinois. You can reach me at 312- 878-2391 and sdavis@walshtrading.com.\nA promising beginning to the corn market this morning could be dampened by tomorrow's first notice day. If you hold a long position in December corn, you must close your position by the end of the trading day tomorrow, November 26, to avoid delivery obligations.\nIn my opinion, first notice day is an opportunity to buy corn at lower prices. Additionally, end-of-month positioning will be a significant factor throughout the remainder of this week.\nAccording to shipping schedules seen by global news agency Reuters, three cargo vessels are enroute to U.S. terminals to load grains bound for China. Two will carry the first U.S. soybean shipments to China since May. A third vessel headed to a Texas Gulf Coast grain terminal is to be loaded with China-bound U.S. sorghum (milo) in what will be the first American shipment of the feed grain to China since mid-March.\nIn essence, China is resuming the importation of grains from the United States. Meanwhile, corn prices on China's Dalian Commodity Exchange (DCE) have rallied to their highest since September, fueling speculation that heavy rains have damaged crops in China's growing region.\nTop destinations for U.S. corn shipments last week were Mexico, Japan and South Korea. South Korea has made additional purchases this week of 264,000 tons. Corn demand remains robust, and, in my opinion,",
        "authors": "None",
        "publish_date": "2025-11-26 01:29:56",
        "published_at_raw": "2025-11-26T01:29:56Z",
        "meta_site_name": "Barchart",
        "description": "I am Stephen Davis, senior market strategist at Walsh Trading, Inc., in Chicago, Illinois. You can reach me at 312- 878-2391 and sdavis@walshtrading.com. A promising beginning to the corn market this morning could be dampened by tomorrow's first noti...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "35e1aded171707e6a791b2a0b1c9ac4f",
        "title": "Attorney General Keith Ellison joins others in SNAP eligibility lawsuit",
        "doc_url": "https://www.twincities.com/2025/11/26/attorney-general-keith-ellison-joins-others-in-snap-eligibility-lawsuit/",
        "all_text": "To place an obituary, please include the information from the obituary checklist below in an email to obits@pioneerpress.com. There is no option to place them through our website at this time. Feel free to contact our obituary desk at 651-228-5263 with any questions.\nGeneral Information:\nYour full name,\nAddress (City, State, Zip Code),\nPhone number,\nAnd an alternate phone number (if any)\nObituary Specification:\nName of Deceased,\nObituary Text,\nA photo in a JPEG or PDF file is preferable, TIF and other files are accepted, we will contact you if there are any issues with the photo.\nAd Run dates\nThere is a discount for running more than one day, but this must be scheduled on the first run date to apply.\nIf a photo is used, it must be used for both days for the discount to apply, contact us for more information.\nPolicies:\nVerification of Death:\nIn order to publish obituaries a name and phone number of funeral home/cremation society is required. We must contact the funeral home/cremation society handling the arrangements during their business hours to verify the death. If the body of the deceased has been donated to the University of Minnesota Anatomy Bequest Program, or a similar program, their phone number is required for verification.\nPlease allow enough time to contact them especially during their limited weekend hours.\nA death certificate is also acceptable for this purpose but only one of these two options are necessary.\nGuestbook and Outside Websites:\nWe are not allowed to ",
        "authors": "None",
        "publish_date": "2025-11-26 22:38:33",
        "published_at_raw": "2025-11-26T22:38:33Z",
        "meta_site_name": "St. Paul Pioneer Press",
        "description": "In their lawsuit, the group maintains that the USDA guidelines contradict federal law and will \"impose massive financial penalties on states.\"",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "67fe701d04f18a2917419dfbca29fc3c",
        "title": "one states, DC sue USDA over new SNAP guidance",
        "doc_url": "https://www.washingtonexaminer.com/news/3900565/democrats-21-states-dc-sue-trump-administration-snap-cuts-big-beautiful-bill/",
        "all_text": "The One Big Beautiful Bill Act, signed into law by President Donald Trump in July, enacted large-scale changes to SNAP benefits. These include the implementation of work requirements for recipients of the benefits, restrictive eligibility for noncitizens, and penalties for states that refuse to comply.\nThe provisions in the budget reconciliation package stated that “individuals who once held the status of refugees, individuals granted asylum, or parolees from gaining eligibility for SNAP” who become lawful permanent residents were not barred from obtaining the benefits.\nThe USDA implemented the new guidance on Oct. 31, the date the agency considered to be the end of the 120-day exclusionary period for states to adhere to the changes since the bill’s passage. However, the lawsuit argued that the 120-day period should have started on Oct. 31 instead of ending on that date.\nThe changes to SNAP eligibility and the rollout of guidance “have caused significant confusion” for the states behind the lawsuit, which argued that they “have been asked to implement new substantive, erroneous limitations on SNAP eligibility, many of which could not have been anticipated as they diverge from the text of the OBBB, in 24 hours.”\nAs a result, lawful permanent residents residing in the U.S. islands of Micronesia, the Marshall Islands, and Palau, as well as Cuban and Haitian legal immigrants, are no longer eligible to receive the SNAP benefits. Additionally, lawful permanent residents who are eli",
        "authors": "None",
        "publish_date": "2025-11-26 22:14:07",
        "published_at_raw": "2025-11-26T22:14:07Z",
        "meta_site_name": "Washington Examiner",
        "description": "The lawsuit from the 22 Democratic attorneys general seeks to reverse the SNAP guidance passed under the One Big Beautiful Bill Act.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d97b087c41d4985cd62540dc2a3ef1d6",
        "title": "Oregon sues USDA over guidance on SNAP changes for non-citizens",
        "doc_url": "https://www.registerguard.com/story/news/politics/2025/11/26/oregon-sues-usda-over-guidance-on-snap-changes-for-non-citizens/87483547007/",
        "all_text": "Oregon has sued the Trump administration again, this time over guidance from the U.S. Department of Agriculture directing changes to the Supplemental Nutrition Assistance Program that states say are unlawful.\nThe federal budget reconciliation bill H.R. 1, or the \"Big, Beautiful Bill,\" modified SNAP eligibility requirements for some non-citizens and changed the penalties for states' percentages of over- or underpayments.\nThe lawsuit, filed Nov. 26 in the U.S. District Court for Oregon, alleges Oct. 31 guidance from the USDA gives instructions to make changes not included in H.R. 1, is unlawful and asks for it and the requirement to not go into effect.\n\"It's wild and absolutely stupid that we have to be here today,\" Oregon Attorney General Dan Rayfield told reporters Nov. 26.\n\"When this memo came out, we thought it must be a mistake,\" Rayfield said in a statement. \"The law is clear, and this is not how you treat people.”\nThe Oct. 31 guidelines from USDA caused \"significant confusion,\" and contradict some of what was in H.R. 1, meaning states will have to go back and change programs they had already modified, the states claim.\n\"At best, the guidance was sloppy and uninformed,\" California Attorney General Rob Banta said in a press conference.\nOregon and New York are co-leading the suit, and California, Colorado, Connecticut, Delaware, Washington, D.C., Hawaii, Illinois, Maine, Maryland, Massachusetts, Michigan, Minnesota, Nevada, New Jersey, New Mexico, North Carolina, Rhode Isla",
        "authors": "None",
        "publish_date": "2025-11-26 21:00:56",
        "published_at_raw": "2025-11-26T21:00:56Z",
        "meta_site_name": "Eugene Register-Guard",
        "description": "Oregon and other states sued the Trump administration Nov. 26 for alleged inaccurate guidance on changes to food stamp benefits for non-citizens.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "db55aae6306b5aca3cda2999baa1535b",
        "title": "USDA calls SNAP benefits program 'out of control,' plans major overhaul",
        "doc_url": "https://www.foxbusiness.com/media/usda-calls-snap-benefits-program-out-control-plans-major-overhaul",
        "all_text": "The U.S. Department of Agriculture says it’s working to reform what it calls the \"out of control\" SNAP benefits program.\nThe agency plans to redirect more of its nutrition budget toward healthier, American-grown food options, including specialty crops, fruits and proteins. Agriculture Secretary Brooke Rollins said the effort is part of the \"Make America Healthy Again\" movement championed by Health and Human Services Secretary Robert F. Kennedy Jr.\n\"More coming on that early next year as we begin to shift how we’re buying food, and really supporting the American farmers,\" Rollins said Wednesday on \"Mornings with Maria.\"\nTRUMP ORDERS DOJ TO INVESTIGATE MEATPACKING COMPANIES FOR 'ILLICIT COLLUSION' AMID RISING BEEF PRICES\nRollins noted that part of the shift will include using the USDA’s food purchasing power to get more American-grown fruits and specialty crops into school lunches and food banks.\nShe explained that the USDA spends roughly \"$400 million a day across 16 nutrition programs.\" The agency is looking to improve how that money is spent to help reduce chronic disease.\nTYSON FOODS TO CLOSE MAJOR BEEF PLANT, SCALE BACK OPERATIONS AS CATTLE SUPPLIES DECLINE\nThe SNAP benefits program recently came under scrutiny during the latest government shutdown, when funding for the food assistance program came close to running out. The USDA has since pledged to root out fraud within the program and is requiring participants to reapply for benefits.\nRollins also confirmed the agency is",
        "authors": "None",
        "publish_date": "2025-11-26 20:36:02",
        "published_at_raw": "2025-11-26T20:36:02Z",
        "meta_site_name": "Fox Business",
        "description": "Agriculture Secretary Brooke Rollins announces USDA plans to reform SNAP benefits program, redirecting nutrition budget toward healthier American-grown foods.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "99da6aaa1640dacc8a5bfa6d06f8ace6",
        "title": "Don't Rinse Your Turkey",
        "doc_url": "https://www.newsmax.com/health/health-news/turkey-washing-rinsing/2025/11/26/id/1236170/",
        "all_text": "As you prepare your Thanksgiving turkey, food safety experts urge you to skip one common step: rinsing the bird. A study from the U.S. Department of Agriculture (USDA) found that washing or rinsing raw poultry can actually increase the risk of foodborne illness.\nThe observational study showed how easily bacteria spread when surfaces aren’t properly cleaned and sanitized.\nAmong participants who washed their raw poultry, 60% ended up with bacteria in their sink afterward. Even after attempting to clean the sink, 14% still had lingering contamination.\nThe study also found that 26% of those who rinsed their bird transferred bacteria from the raw poultry to their salad lettuce.\nExperts told ABC News that rinsing is unnecessary because thorough cooking destroys harmful bacteria.\nThe USDA recommends following these safety steps when preparing raw poultry or meat:\n• Prepare foods that won’t be cooked — such as vegetables and salads — before handling raw poultry. Use a separate cutting board for poultry to avoid cross-contamination.\n• Clean and sanitize any surface that comes into contact with raw poultry or its juices. Wash with hot, soapy water, then apply a sanitizer.\n• Wash hands immediately after touching the bird. Wet hands, lather with soap, and scrub for at least 20 seconds.\n• Cook the turkey to a safe internal temperature of 165°F. Use a food thermometer and check three areas: the thickest part of the breast, and the innermost parts of the thigh and wing. Make sure the probe ",
        "authors": "None",
        "publish_date": "2025-11-26 20:14:11",
        "published_at_raw": "2025-11-26T20:14:11Z",
        "meta_site_name": "Newsmax",
        "description": "A study from the U.S. Department of Agriculture (USDA) found that washing or rinsing raw poultry can actually increase the risk of foodborne illness.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f2ba1172d3ff872796eccdfc2f06a3c1",
        "title": "Democratic attorneys general sue to block USDA guidance that makes some immigrants ineligible for SNAP benefits",
        "doc_url": "https://abc17news.com/politics/national-politics/cnn-us-politics/2025/11/26/democratic-attorneys-general-sue-to-block-usda-guidance-that-makes-some-immigrants-ineligible-for-snap-benefits/",
        "all_text": "By Alison Main, CNN\n(CNN) — A coalition of 21 attorneys general have sued to block new guidance from the US Department of Agriculture that declares some immigrants, including refugees and those granted asylum, ineligible for Supplemental Nutrition Assistance Program, or SNAP, benefits.\nNew York Attorney General Letitia James, who led the coalition of other Democratic attorneys general, said in a statement Wednesday that the Trump administration is illegally cutting off benefits for tens of thousands of lawful permanent residents.\nThe USDA provided the new guidance to states narrowing SNAP eligibility last month, aligning with rollbacks of the program outlined in President Donald Trump’s domestic policy law that passed earlier this year.\nThe attorneys general argue in the lawsuit that the memo goes beyond what the law prescribes since it would make anyone who entered the country through humanitarian protection programs permanently ineligible for SNAP benefits — also known as food stamps — even if they become legal residents.\nThe group of attorneys general warn that the USDA’s guidance, which prompts a swift overhaul of eligibility systems, “threatens to destabilize SNAP nationwide,” and could put significant financial strain on states that would have to shoulder the cost of fines.\nThe lawsuit asks a federal judge in Oregon to vacate and block the implementation of the USDA’s guidance.\nThe filing comes just days after a federal judge in Virginia dismissed an indictment against ",
        "authors": "None",
        "publish_date": "2025-11-26 18:54:16",
        "published_at_raw": "2025-11-26T18:54:16Z",
        "meta_site_name": "ABC17News.com",
        "description": "By Alison Main, CNN (CNN) — A coalition of 21 attorneys general have sued to block new guidance from the US Department of Agriculture that declares some immigrants, including refugees and those granted asylum, ineligible for Supplemental Nutrition Assistance Program, or SNAP, benefits. New York Attorney General Letitia James, who led the coalition of other",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2042f69bd47210542e3a58688f527c40",
        "title": "Democratic attorneys general sue to block USDA guidance that makes some immigrants ineligible for SNAP benefits",
        "doc_url": "https://edition.cnn.com/2025/11/26/politics/snap-democratic-attorneys-general-lawsuit",
        "all_text": "A coalition of 21 attorneys general have sued to block new guidance from the US Department of Agriculture that declares some immigrants, including refugees and those granted asylum, ineligible for Supplemental Nutrition Assistance Program, or SNAP, benefits.\nNew York Attorney General Letitia James, who led the coalition of other Democratic attorneys general, said in a statement Wednesday that the Trump administration is illegally cutting off benefits for tens of thousands of lawful permanent residents.\nThe USDA provided the new guidance to states narrowing SNAP eligibility last month, aligning with rollbacks of the program outlined in President Donald Trump’s domestic policy law that passed earlier this year.\nThe attorneys general argue in the lawsuit that the memo goes beyond what the law prescribes since it would make anyone who entered the country through humanitarian protection programs permanently ineligible for SNAP benefits — also known as food stamps — even if they become legal residents.\nThe group of attorneys general warn that the USDA’s guidance, which prompts a swift overhaul of eligibility systems, “threatens to destabilize SNAP nationwide,” and could put significant financial strain on states that would have to shoulder the cost of fines.\nThe lawsuit asks a federal judge in Oregon to vacate and block the implementation of the USDA’s guidance.\nThe filing comes just days after a federal judge in Virginia dismissed an indictment against James, whom President Donald",
        "authors": "None",
        "publish_date": "2025-11-26 18:54:16",
        "published_at_raw": "2025-11-26T18:54:16Z",
        "meta_site_name": "Cable News Network",
        "description": "A coalition of 21 attorneys general have sued to block new guidance from the US Department of Agriculture that declares some immigrants, including refugees and those granted asylum, ineligible for Supplemental Nutrition Assistance Program, or SNAP, benefits.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2d2151116f8e32412519a4c97c329b9c",
        "title": "Maine drought declared disaster by USDA",
        "doc_url": "https://www.bangordailynews.com/2025/11/26/homestead/homestead-environment/maine-drought-usda-natural-disaster/",
        "all_text": "The U.S. Department of Agriculture has declared Maine’s ongoing drought a natural disaster, allowing farmers to apply for federal emergency assistance loans from the agency.\nFarmers in all 16 counties are eligible for the USDA loans. Funds can be used to pay off debt, for essential living expenses, and to replace product or equipment.\nMuch or all of the state has been gripped by drought for several months now, despite recent rainfall. It started with a dry spell in August and has continued to worsen throughout the growing season. The drought has been severe enough to impact many farmers’ bottom lines: blueberry, apple, potato and maple syrup growers have all felt the effects.\n“We saw significant reduction in crop yield on almost all crops,” said Tom Gordon, soil and water conservation program coordinator at the Maine Department of Agriculture, Conservation and Forestry. “Berry crops were reduced to 50-75%, apple crops were smaller this year.”\nGordon said the federal loan program should help farmers to stabilize their income after a season of losses. But for some crops, he said, the damage will go past this season.\n“One of the problems with berries and fruits is they often need to set their buds this year for next year’s fruiting,” he said. “And the drought has definitely affected the ability of those plants to get themselves ready for next year.”\nIn addition to the federal loans, Maine’s Department of Agriculture, Conservation and Forestry will also take grant applications fo",
        "authors": "None",
        "publish_date": "2025-11-26 15:36:03",
        "published_at_raw": "2025-11-26T15:36:03Z",
        "meta_site_name": "Bangor Daily News",
        "description": "The U.S. Department of Agriculture has declared Maine's drought a natural disaster, allowing farmers to apply for federal emergency assistance loans to mitigate crop losses.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3cf7877c30e3a229d6eb2271e20f8e48",
        "title": "Hogs Look to Wednesday Trade",
        "doc_url": "https://www.barchart.com/story/news/36325972/hogs-look-to-wednesday-trade",
        "all_text": "Lean hog futures posted mixed action on Tuesday, with contracts down 20 to 45 cents higher. Preliminary open interest was 1,349 contracts lower on Tuesday. USDA’s national base hog price was reported at $73.25 in the Tuesday PM print. The CME Lean Hog Index was down another $1.20 on November 21 at $83.61. The market will be closed on Thursday for Thanksgiving, with a normal open on Friday.\nExport Sales data for pork in the week ending on October 9 saw 288,676 MT of bookings. That was a 4-week low. Export Shipments were 28,506 MT, back down from the week prior.\nCFTC data for the week ending on 10/14 showed managed money cutting 12,312 contracts from their net long position, at 28,928 as of that Tuesday.\nUSDA’s pork carcass cutout value from the Tuesday afternoon report was back down $1.53 to $93.25 per cwt. The ham primal was the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 492,000 head, taking the weekly total to 987,000 head. That is 1,000 head below last week and up 2,192 head from same week last year.\nDec 25 Hogs closed at $78.450, up $0.250,\nFeb 26 Hogs closed at $79.000, down $0.175\nApr 26 Hogs closed at $82.950, up $0.425,",
        "authors": "None",
        "publish_date": "2025-11-26 13:26:04",
        "published_at_raw": "2025-11-26T13:26:04Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted mixed action on Tuesday, with contracts down 20 to 45 cents higher. Preliminary open interest was 1,349 contracts lower on Tuesday. USDA’s national base hog price was reported at $73.25 in the Tuesday PM print. The CME Lean Ho...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a693e5ae16bb90c939d7c3f995781583",
        "title": "USDA Chief Economist Seth Meyer to Step Down",
        "doc_url": "https://www.agriculture.com/partners-usda-chief-economist-seth-meyer-to-step-down-11857447",
        "all_text": "By Tom Polansek and Ashitha Shivaprasad\nNov. 25 (Reuters) - Seth Meyer, the USDA's chief economist since 2021, will leave the agency to work for the University of Missouri's food and agricultural policy institute, the university said on Tuesday.\nMeyer's departure comes after the USDA has lost thousands of research staff to President Donald Trump's effort to shrink the federal government.\nMeyer has been the head of the USDA office responsible for assessing crops globally and publishing a monthly World Agricultural Supply and Demand Estimates report that can swing crop prices. The report is considered one of the most influential sources of supply and demand data for agricultural commodities worldwide.\nStarting on Jan. 1, Meyer will join the University of Missouri to lead its Food and Agricultural Policy Research Institute, according to the university. In a statement from the university, he said the job was an opportunity to support the farm sector with agricultural policy development and to return home to Missouri.\nUSDA Secretary Brooke Rollins said Meyer made a lasting impact at the agency.\n\"Secretary Rollins is deeply grateful for Seth Meyer's many years of dedicated service at USDA,\" she said in a statement.\nThe USDA suspended the release of key reports, including weekly data on U.S. grain export sales, during the record-long government shutdown that ended this month.\n(Reporting by Ashitha Shivaprasad in Bengaluru, Tom Polansek in Chicago and Leah Douglas in Washington; Edit",
        "authors": "None",
        "publish_date": "2025-11-26 12:14:22",
        "published_at_raw": "2025-11-26T12:14:22Z",
        "meta_site_name": "Successful Farming",
        "description": "Seth Meyer, the USDA's chief economist since 2021, will leave the agency to work for the University of Missouri's food and agricultural policy institute, the university said on Tuesday.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bdeb892fb10b1345d6505dc1af37a903",
        "title": "USDA chief economist Seth Meyer to step down",
        "doc_url": "https://www.reuters.com/world/us/usda-chief-economist-seth-meyer-step-down-2025-11-26/",
        "all_text": "Nov 25 (Reuters) - Seth Meyer, the U.S. Department of Agriculture's chief economist since 2021, will leave the agency to work for the University of Missouri's food and agricultural policy institute, the university said on Tuesday.\nMeyer's departure comes after the USDA has lost thousands of research staff to President Donald Trump's effort to shrink the federal government.\nSign up here.\nMeyer has been the head of the USDA office responsible for assessing crops globally and publishing a monthly World Agricultural Supply and Demand Estimates report that can swing crop prices. The report is considered one of the most influential sources of supply and demand data for agricultural commodities worldwide.\nStarting on January 1, Meyer will join the University of Missouri to lead its Food and Agricultural Policy Research Institute, according to the university. In a statement from the university, he said the job was an opportunity to support the farm sector with agricultural policy development and to return home to Missouri.\nUSDA Secretary Brooke Rollins said Meyer made a lasting impact at the agency.\n\"Secretary Rollins is deeply grateful for Seth Meyer's many years of dedicated service at USDA,\" she said in a statement.\nThe USDA suspended the release of key reports, including weekly data on U.S. grain export sales, during the record-long government shutdown that ended this month.\nReporting by Ashitha Shivaprasad in Bengaluru, Tom Polansek in Chicago and Leah Douglas in Washington; Edi",
        "authors": "None",
        "publish_date": "2025-11-26 00:28:43",
        "published_at_raw": "2025-11-26T00:28:43Z",
        "meta_site_name": "Reuters",
        "description": "Seth Meyer, the U.S. Department of Agriculture's chief economist since 2021, will leave the agency to work for the University of Missouri's food and agricultural policy institute, the university said on Tuesday.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cf05762bd9aa5ff85a17beaca9fbfdf4",
        "title": "USDA Chief Economist Seth Meyer to Step Down",
        "doc_url": "https://www.usnews.com/news/top-news/articles/2025-11-25/usda-chief-economist-seth-meyer-to-step-down",
        "all_text": "By Tom Polansek and Ashitha Shivaprasad\n(Reuters) -Seth Meyer, the U.S. Department of Agriculture's chief economist since 2021, will leave the agency to work for the University of Missouri's food and agricultural policy institute, the university said on Tuesday.\nMeyer's departure comes after the USDA has lost thousands of research staff to President Donald Trump's effort to shrink the federal government.\nMeyer has been the head of the USDA office responsible for assessing crops globally and publishing a monthly World Agricultural Supply and Demand Estimates report that can swing crop prices. The report is considered one of the most influential sources of supply and demand data for agricultural commodities worldwide.\nStarting on January 1, Meyer will join the University of Missouri to lead its Food and Agricultural Policy Research Institute, according to the university. In a statement from the university, he said the job was an opportunity to support the farm sector with agricultural policy development and to return home to Missouri.\nUSDA Secretary Brooke Rollins said Meyer made a lasting impact at the agency.\n\"Secretary Rollins is deeply grateful for Seth Meyer's many years of dedicated service at USDA,\" she said in a statement.\nThe USDA suspended the release of key reports, including weekly data on U.S. grain export sales, during the record-long government shutdown that ended this month.\n(Reporting by Ashitha Shivaprasad in Bengaluru, Tom Polansek in Chicago and Leah Douglas",
        "authors": "None",
        "publish_date": "2025-11-26 00:28:00",
        "published_at_raw": "2025-11-26T00:28:00Z",
        "meta_site_name": "U.S. News & World Report",
        "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]