[
    {
        "id": "f0d481857780042a0625e7a8d48197c3",
        "title": "Corn Rallies into the Weekend as Export Business Booms to Multi-Year High",
        "doc_url": "https://www.barchart.com/story/news/37206048/corn-rallies-into-the-weekend-as-export-business-booms-to-multi-year-high",
        "all_text": "Corn futures posted 5 to 6 ½ cent gains across most contracts on Friday, as the late week strength took the weekly gain to 5 ¾ cents. This morning’s Export Sales report showed international buyers taking advantage of last week’s price break. The CmdtyView national average Cash Corn price was up 6 3/4 cents at $3.93 1/2.\nUSDA’s Export Sales report from this morning showed corn bookings at the largest since March 2021 at 4.01 MMT in the week of January 15. Excluding China purchases and bunched week sales from previous government shutdowns, that was the largest week of sales since 1991. Sales were more than double the same week last year. The largest buyer was unknown destinations at 1.242 MMT, with 836,700 MT to Japan, 751,500 MT to South Korea, and 422,600 MT to Mexico. Sorghum sales totaled 526,800 MT.\nManaged money trimmed their net short position in corn futures and options by just 450 contracts in the week that ended on January 20. That net short was 81,324 contracts according to Commitment of Traders data from this afternoon.\nMar 26 Corn closed at $4.30 1/2, up 6 1/2 cents,\nNearby Cash was $3.93 1/2, up 6 3/4 cents,\nMay 26 Corn closed at $4.38, up 5 3/4 cents,\nJul 26 Corn closed at $4.43 3/4, up 5 1/4 cents,",
        "authors": "None",
        "publish_date": "2026-01-23 22:46:29",
        "published_at_raw": "2026-01-23T22:46:29Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted 5 to 6 ½ cent gains across most contracts on Friday, as the late week strength took the weekly gain to 5 ¾ cents. This morning’s Export Sales report showed international buyers taking advantage of last week’s price break. The Cmdt...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "243ebc63edf1273c73bfe424ada24cec",
        "title": "Corn Rallying as Export Business Shoots to Multi-Year High",
        "doc_url": "https://www.barchart.com/story/news/37200479/corn-rallying-as-export-business-shoots-to-multi-year-high",
        "all_text": "Corn futures are trading with 5 to 7 cent gains at Friday’s midday. This morning’s Export Sales report showed international buyers taking advantage of last week’s price break. The CmdtyView national average Cash Corn price is up 6 3/4 cents at $3.94 1/2.\nUSDA’s Export Sales report from this morning showed with corn bookings at the largest since March 2021 at 4.01 MMT, and well above estimates of 1.9 to 3.1 MMT in the week of January 15. Excluding China purchases and bunched week sales from previous shutdowns, that was the largest week of sales since 1991. Sales were more than double the same week last year.\nMar 26 Corn is at $4.30 3/4, up 6 3/4 cents,\nNearby Cash is at $3.94 1/2, up 6 3/4 cents,\nMay 26 Corn is at $4.38 1/2, up 6 1/4 cents,\nJul 26 Corn is at $4.44, up 5 1/2 cents,",
        "authors": "None",
        "publish_date": "2026-01-23 18:19:02",
        "published_at_raw": "2026-01-23T18:19:02Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with 5 to 7 cent gains at Friday’s midday. This morning’s Export Sales report showed international buyers taking advantage of last week’s price break. The CmdtyView national average Cash Corn price is up 6 3/4 cents at $3.94...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "93a0c2ab5e012ebdaacaf5c451782800",
        "title": "Corn Holding Near Steady to Start Friday",
        "doc_url": "https://www.barchart.com/story/news/37195146/corn-holding-near-steady-to-start-friday",
        "all_text": "Corn price action is trading steady trade so far on Friday morning. Futures were 2 to 3 cents across most nearby contracts on Thursday. Spillover from strength in wheat was supportive. Preliminary open interest was down 3,516 contracts on Thursday, hinting at some short covering. The CmdtyView national average Cash Corn price was up 2 1/4 cents at $3.87 3/4.\nWeekly EIA data showed a total of 1.119 million barrels per day of ethanol production in the week ending on January 16. That was a drop of 77,000 barrels per day from the previous week’s all time record. Stocks were up 1.266 million barrels to 25.739 million barrels, as the east coast and Gulf saw a majority of the build. Exports did see an uptick of 99,000 bpd from the week prior, nearing a record at 218,000 bpd. Refiner inputs of ethanol were also higher, up 11,000 bpd to 852,000 bpd.\nUSDA’s Export Sales data will be released this morning, with corn books seen at 1.9 to 3.1 MMT in the week of January 15. There were 1.828 MMT in announced daily sales in that week.\nMar 26 Corn closed at $4.24, up 2 1/4 cents, currently unch\nNearby Cash was $3.87 3/4, up 2 1/4 cents,\nMay 26 Corn closed at $4.32 1/4, up 2 1/2 cents, currently unch\nJul 26 Corn closed at $4.38 1/2, up 2 1/4 cents, currently unch",
        "authors": "None",
        "publish_date": "2026-01-23 13:24:23",
        "published_at_raw": "2026-01-23T13:24:23Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is trading steady trade so far on Friday morning. Futures were 2 to 3 cents across most nearby contracts on Thursday. Spillover from strength in wheat was supportive. Preliminary open interest was down 3,516 contracts on Thursday, h...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3f94046474ff632fd5a8fe2aff5e6b2f",
        "title": "India pulls back from soybean oil imports amid rising global prices",
        "doc_url": "https://www.thehindubusinessline.com/markets/commodities/weak-rupee-forces-india-to-scrap-south-american-soy-oil-shipments/article70541840.ece",
        "all_text": "India, the world’s largest vegetable oil buyer, canceled more soybean oil shipments from South America as the rupee’s slump to a record low widened the price gap between local and imported oil.\nAbout 35,000 to 40,000 tonnes of the commodity from Brazil and Argentina, booked for delivery in February and the April-July period, have been scrapped, with total cancellations likely to exceed 50,000 tonnes, said Aashish Acharya, vice president at Patanjali Foods Ltd., one of India’s top vegetable oil buyers. Several other traders contacted by Bloomberg confirmed the action.\nEarlier Pullouts\nThe latest development comes after Indian buyers backed out of more than 100,000 tons of Argentinian deals in December, equivalent to roughly 20 per cent of what the country imports in a month. India relies on overseas purchases for nearly 60 per cent of its edible oil consumption.\nPrice Disparity\nA weaker rupee and higher global prices have pushed up South American soy oil to trade at $25 to $30 a tonnes higher than local supplies, Acharya said in an interview. That disparity has made imports more expensive and uneconomical, prompting buyers to cash out, and instead look at the tropical oil which has been trading at attractive discounts, he said.\nPalm Advantage\nSoy oil’s premium over palm has doubled from the start of the year to around $145 a tonnes, according to data compiled by Bloomberg.\nChina Effect\nSupplies of South American soybean oil have tightened as China ramped up purchases of soybea",
        "authors": "None",
        "publish_date": "2026-01-23 09:44:50",
        "published_at_raw": "2026-01-23T09:44:50Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "India has canceled soybean oil shipments from South America as a weak rupee and high global prices make imports costly, boosting palm oil demand.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ba1f6d2098dae7c2cdbd9eea8c4633b2",
        "title": "India Scraps More South American Soy Oil Cargoes as Rupee Slumps",
        "doc_url": "https://www.bloomberg.com/news/articles/2026-01-23/india-scraps-more-south-american-soy-oil-cargoes-as-rupee-slumps",
        "all_text": "India, the world’s largest vegetable oil buyer, canceled more soybean oil shipments from South America as the rupee’s slump to a record low widened the price gap between local and imported oil.\nAbout 35,000 to 40,000 tons of the commodity from Brazil and Argentina, booked for delivery in February and the April-July period, have been scrapped, with total cancellations likely to exceed 50,000 tons, said Aashish Acharya , vice president at Patanjali Foods Ltd., one of India’s top vegetable oil buyers. Several other traders contacted by Bloomberg confirmed the action.",
        "authors": "None",
        "publish_date": "2026-01-23 04:42:20",
        "published_at_raw": "2026-01-23T04:42:20Z",
        "meta_site_name": "Bloomberg",
        "description": "India, the world’s largest vegetable oil buyer, canceled more soybean oil shipments from South America as the rupee’s slump to a record low widened the price gap between local and imported oil.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7255ad528833b63074de0907467ad1ab",
        "title": "Brazil Soybean Market: Prices, Production & Exports",
        "doc_url": "https://www.argusmedia.com/en/news-and-insights/market-insight-papers/brazil-soybean-market-production-prices-exports",
        "all_text": "Brazil leads global soybean production with a record 171.4mn‑t crop and strong gains in planted area and productivity.\nThe crushing industry processed over 58mn t, boosting meal and oil output, with meal production and exports continuing to rise.\nBrazil is the world’s top exporter of soybeans and the second‑largest exporter of soybean meal, driven by strong Chinese demand.\nSoybean oil is mostly consumed domestically, primarily by the biodiesel sector, which absorbs the majority of output.\nAbout Argus Media\nAs a leading authority on energy and commodity markets across the globe, Argus is uniquely positioned to provide in-depth analysis and expert thought leadership. Our white papers are carefully written by Argus specialists from across our company. Each white paper focuses on a topical theme, exploring areas such supply and demand dynamics, price trends, trading activity and changing regulations. We always aim to provide a balanced view, underpinned by data and insight gathered first hand from the market.",
        "authors": "None",
        "publish_date": "2026-01-23 00:00:00",
        "published_at_raw": "2026-01-23T00:00:00Z",
        "meta_site_name": "Argus Media",
        "description": "Get Argus insights on Brazil’s soybean market, covering soybean prices, production, exports, meal price trends, and the evolving soybean oil market.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "50c3a380ff989c7f5d673a3a62830b33",
        "title": "Banana Flour Market Analysis Report 2026",
        "doc_url": "https://www.globenewswire.com/news-release/2026/01/23/3224873/28124/en/Banana-Flour-Market-Analysis-Report-2026-Global-Industry-Size-Share-Trends-Opportunity-and-Forecast-2021-2031.html",
        "all_text": "Dublin, Jan. 23, 2026 (GLOBE NEWSWIRE) -- The \"Banana Flour Market - Global Industry Size, Share, Trends, Opportunity, and Forecast, 2021-2031\" has been added to ResearchAndMarkets.com's offering.\nThe Global Banana Flour Market is projected to expand from USD 1.12 Billion in 2025 to USD 1.83 Billion by 2031, registering a CAGR of 8.53%\nBanana flour, a gluten-free functional powder made from green bananas, is increasingly used as a wheat alternative due to its versatility and high resistant starch content. Market growth is primarily driven by the rising incidence of celiac disease, which necessitates permanent dietary changes, and the agricultural sector's commitment to sustainability through upcycling imperfect fruit to reduce waste. Unlike temporary health fads, these fundamental drivers serve as enduring stabilizers for the industry.\nHowever, the sector's expansion is hindered by the challenge of securing consistent raw materials amid environmental instability. Data from the Association of Banana Marketing and Export indicates that adverse weather in 2024 reduced banana yields by nearly 15 percent in major production areas, restricting the surplus volume available for processing. This inconsistency in the supply chain creates a significant barrier that could limit production scalability and impede the widespread adoption of banana flour.\nMarket Drivers\nThe growing focus on reducing food waste and sustainable upcycling is fundamentally transforming the market as manufacturer",
        "authors": "None",
        "publish_date": "2026-01-23 14:31:40",
        "published_at_raw": "2026-01-23T14:31:40Z",
        "meta_site_name": "GlobeNewswire",
        "description": "Key market opportunities in the global banana flour sector include its rising demand as a gluten-free wheat alternative, driven by the surge in celiac...",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3f9229e35698aabccc3b7c9801541343",
        "title": "Banana Flour Market Analysis Report 2026",
        "doc_url": "https://www.globenewswire.com/news-release/2026/01/23/3224873/0/en/Banana-Flour-Market-Analysis-Report-2026-Global-Industry-Size-Share-Trends-Opportunity-and-Forecast-2021-2031.html",
        "all_text": "Dublin, Jan. 23, 2026 (GLOBE NEWSWIRE) -- The \"Banana Flour Market - Global Industry Size, Share, Trends, Opportunity, and Forecast, 2021-2031\" has been added to ResearchAndMarkets.com's offering.\nThe Global Banana Flour Market is projected to expand from USD 1.12 Billion in 2025 to USD 1.83 Billion by 2031, registering a CAGR of 8.53%\nBanana flour, a gluten-free functional powder made from green bananas, is increasingly used as a wheat alternative due to its versatility and high resistant starch content. Market growth is primarily driven by the rising incidence of celiac disease, which necessitates permanent dietary changes, and the agricultural sector's commitment to sustainability through upcycling imperfect fruit to reduce waste. Unlike temporary health fads, these fundamental drivers serve as enduring stabilizers for the industry.\nHowever, the sector's expansion is hindered by the challenge of securing consistent raw materials amid environmental instability. Data from the Association of Banana Marketing and Export indicates that adverse weather in 2024 reduced banana yields by nearly 15 percent in major production areas, restricting the surplus volume available for processing. This inconsistency in the supply chain creates a significant barrier that could limit production scalability and impede the widespread adoption of banana flour.\nMarket Drivers\nThe growing focus on reducing food waste and sustainable upcycling is fundamentally transforming the market as manufacturer",
        "authors": "None",
        "publish_date": "2026-01-23 14:31:40",
        "published_at_raw": "2026-01-23T14:31:40Z",
        "meta_site_name": "GlobeNewswire",
        "description": "Key market opportunities in the global banana flour sector include its rising demand as a gluten-free wheat alternative, driven by the surge in celiac...",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "08cdc75a6bce153b87fe216b7c48c895",
        "title": "Cotton Slips Lower into the Friday Close",
        "doc_url": "https://www.barchart.com/story/news/37206102/cotton-slips-lower-into-the-friday-close",
        "all_text": "Cotton futures were steady to 7 points lower in the front months on Friday, as March was 85 points lower this week. Crude oil futures were up $1.95 per barrel at $61.31. The US dollar index was down $0.871 to $97.305.\nUSDA Export Sales data showed 412,457 RB of cotton sold in the week ending on January 15, a marketing year high. Vietnam was the largest buyer of 220,700 RB, with 38,600 RB sold to Bangladesh. Export shipments were 187,776 RB, also a marketing year. The top destination was Vietnam at 62,300 RB, with 45,900 RB headed to Pakistan.\nCommitment of Traders data showed managed money in cotton futures and options adding 1,580 contracts to their net short position as of Tuesday, taking it to 51,952 contracts.\nNASS Cotton Ginnings data showed 732,950 RB of cotton ginned from Jan 1 to Jan 15, taking the marketing year total to 12.695 million RB.\nThe Thursday online auction from The Seam showed sales of 62.43 cents/lb on 16,726 bales. The Cotlook A Index was unchanged on January 22 at 74.55 cents. ICE certified cotton stocks were unchanged on 1/22 with the certified stocks level at 10,422 bales. The Adjusted World Price was updated to 50.99 cents/lb on Thursday afternoon, down 18 points from the week prior.\nMar 26 Cotton closed at 63.81, down 7 points,\nMay 26 Cotton closed at 65.48, down 1 point,\nJul 26 Cotton closed at 66.97, unch",
        "authors": "None",
        "publish_date": "2026-01-23 22:46:30",
        "published_at_raw": "2026-01-23T22:46:30Z",
        "meta_site_name": "Barchart",
        "description": "Cotton futures were steady to 7 points lower in the front months on Friday, as March was 85 points lower this week. Crude oil futures were up $1.95 per barrel at $61.31. The US dollar index was down $0.871 to $97.305. USDA Export Sales data showed 4...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d60796a3c0a2a210b5f43576aafcfb03",
        "title": "USDA Data Flags Salmonella Issues at Costco Chicken Supplier",
        "doc_url": "https://www.mensjournal.com/news/costco-rotisserie-chicken-usda-salmonella-supplier-data",
        "all_text": "Costco’s $4.99 rotisserie chicken has long been an extremely popular food choice for some of the company’s most loyal customers. Many of the people who regularly purchase the product may not know that the USDA has flagged concerns about a facility that supplies the company with a significant portion of its fresh chicken.\nUSDA Data Shows High Salmonella Levels at One of Costco’s $4.99 Rotisserie Chicken Supplier\nOn the website for Lincoln Premium Poultry, it prominently states that it provides chicken sold to Costco customers. “Founded in Fremont, Nebraska, Lincoln Premium Poultry was created to deliver a quality product for Costco members.” The website also states that Lincoln Premium Poultry is owned by Costco before describing its goals. “Our owner and customer, Costco Wholesale, relies on Nebraska and Iowa farmers and team members to provide that every step of our poultry operation reflects the highest level of technology, sustainability, and excellence.” A December 2025 Farm Forward report states that some of Lincoln Premium Poultry products are used for Costco’s $4.99 Rotisserie Chicken, while others are sold fresh.\nIn October 2025, Consumer Reports published its findings on “The Most Contaminated Poultry Plants in the U.S.” One of the many facilities listed in that report is the Lincoln Premium Poultry plant in Fremont, Nebraska. The consumer company’s website states it has been operating for 80 years and describes its goals. “Consumer Reports has long worked to help co",
        "authors": "None",
        "publish_date": "2026-01-23 18:21:16",
        "published_at_raw": "2026-01-23T18:21:16Z",
        "meta_site_name": "Men's Journal",
        "description": "Consumer Reports' analysis of USDA data flags Costco’s rotisserie chicken supplier as one of the most Salmonella-contaminated U.S. plants.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e22690007d1b2648a63778ce2de1944a",
        "title": "Cotton Posting Midday Gains as USDA Reports Marketing Year High in Export Business",
        "doc_url": "https://www.barchart.com/story/news/37200531/cotton-posting-midday-gains-as-usda-reports-marketing-year-high-in-export-business",
        "all_text": "Cotton prices are up 6 to 10 points so far at Friday’s midday. Crude oil futures are up$1.79 per barrel at $61.18. The US dollar index is down $0.584 to $97.595.\nUSDA Export Sales data showed 412,457 RB of cotton sold in the week ending on January 15, a marketing year high. Export shipments were 187,776 RB, also a marketing year.\nThe Thursday online auction from The Seam showed sales of 62.43 cents/lb on 16,726 bales. The Cotlook A Index was unchanged on January 22 at 74.55 cents. ICE certified cotton stocks were unchanged on 1/22 with the certified stocks level at 10,422 bales. The Adjusted World Price was updated to 50.99 cents/lb on Thursday afternoon, down 18 points from the week prior.\nMar 26 Cotton is at 63.98, up 10 points,\nMay 26 Cotton is at 65.56, up 7 points,\nJul 26 Cotton is at 67.03, up 6 points",
        "authors": "None",
        "publish_date": "2026-01-23 18:19:02",
        "published_at_raw": "2026-01-23T18:19:02Z",
        "meta_site_name": "Barchart",
        "description": "Cotton prices are up 6 to 10 points so far at Friday’s midday. Crude oil futures are up$1.79 per barrel at $61.18. The US dollar index is down $0.584 to $97.595. USDA Export Sales data showed 412,457 RB of cotton sold in the week ending on January 1...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "fe0db97c9f72537ee741642e54cab7a1",
        "title": "NUTRAHARMONY Recognized as Best Organic Lymphatic Drainage Drops in 2026 by SupplementInsight",
        "doc_url": "https://www.manilatimes.net/2026/01/24/tmt-newswire/globenewswire/nutraharmony-recognized-as-best-organic-lymphatic-drainage-drops-in-2026-by-supplementinsight/2264467",
        "all_text": "Independent consumer research platform SupplementInsight identified NUTRAHARMONY USDA Organic Lymphatic Drainage Drops as the highest-scoring formula in its 2026 transparency-based evaluation\nCASPER, WY, USA, Jan. 23, 2026 (GLOBE NEWSWIRE) -- NUTRAHARMONY announced that its USDA Organic Lymphatic Drainage Drops were recognized as the highest-scoring product in SupplementInsight’s 2026 consumer research ranking of organic lymphatic drainage supplements. The independent evaluation assessed products based on formulation transparency, ingredient documentation, extraction methods, and routine compatibility.\nAccording to the published research framework, NUTRAHARMONY USDA Organic Lymphatic Drainage Drops received the highest composite score within the ranking due to its alignment with the platform’s transparency and documentation criteria.\nThe product features a multi-botanical blend positioned for routine wellness compatibility, with ingredient disclosures and formulation details accessible through the brand’s official product documentation.\nThese characteristics contributed to its overall ranking performance within SupplementInsight.info’s 2026 evaluation framework.\nProduct Selection Criteria and Initial Screening\nBefore scoring began, SupplementInsight.info conducted a market-wide screening of lymphatic support supplements available in the U.S. consumer market. More than 60 products were reviewed during the initial screening phase.\nTo qualify for inclusion in the 2026 ranking, e",
        "authors": "None",
        "publish_date": "2026-01-23 17:24:22",
        "published_at_raw": "2026-01-23T17:24:22Z",
        "meta_site_name": "The Manila Times",
        "description": "Independent consumer research platform SupplementInsight identified NUTRAHARMONY USDA Organic Lymphatic Drainage Drops as the highest-scoring formula in its 2026 transparency-based evaluation",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "76a83b9a293669e6a629d4c3204045b3",
        "title": "Canyon City Commission addresses public safety bond projects",
        "doc_url": "https://www.amarillo.com/story/news/2026/01/23/canyon-city-commission-addresses-public-safety-bond-projects/88299591007/",
        "all_text": "Canyon got word that they're receiving a USDA grant to supplement a $14 million bond for public safety projects.\nThe city is applying for a grant to cover 60% of a police officer's salary for the third year of a five-year project.\nThe city commission discussed a $435,200 budget for street maintenance, focusing on Hunsley Road and historic brick streets.\nThe Canyon City Commission heard several updates at its most recent meeting Tuesday, Jan. 20, including a $1.4 million boost for public safety to go along with the $14 million bond election approved by voters last year.\nOn Nov. 18, 2025, the Canyon City Commission authorized staff to enter contract negotiations with Paige & Associates Contractors Inc. to proceed as Manager at Risk for construction and remodeling of building projects made possible through the 2025 Public Safety Bond Election. These projects include:\nRenovations to the Canyon Police Department\nConstruction of an animal shelter\nConstruction and renovation to Fire Station No. 1\nConstruction of Firemen’s Training Facility\nConstruction of Physical Training Facility and parking lot\nRenovations of Fire Command Staff Offices\nRenovations to City Hall\nOther project elements under construction\nRenovation of two restrooms\nRenovation of City Hall elevator\nAssistant City Manager Jon Behrens said Tuesday that he had just received a phone call that morning about a USDA grant for $1.4 million to help with the renovations, from US Rep. Ronny Jackson’s office. The amount will be ",
        "authors": "None",
        "publish_date": "2026-01-23 15:34:18",
        "published_at_raw": "2026-01-23T15:34:18Z",
        "meta_site_name": "Amarillo Globe-News",
        "description": "The $14 million bond issue in Canyon is getting a $1.4 million bonus thanks to a USDA grant.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "10e7ba2b1fbf46f45cd054d17726ef10",
        "title": "Hogs Look to Friday Trade",
        "doc_url": "https://www.barchart.com/story/news/37195186/hogs-look-to-friday-trade",
        "all_text": "Lean hog futures settled Thursday with contracts 50 to 75 cents higher on the session and reaching new contract highs. Open interest rose 4,217 contracts on Thursday. USDA’s national base hog price was reported at $83.09 on Thursday afternoon, down $2.04 from the day prior. The CME Lean Hog Index was up another 37 cents on Jan 20 at $82.40.\nUSDA’s pork carcass cutout value from the Thursday PM report was 64 cents higher at $94.62 per cwt. The rib primal was the only reported lower. USDA estimated federally inspected hog slaughter for Thursday at 490,000 head, taking the weekly total to 1.886 million head after a revision 8,000 head lower to Wednesday. That is 87,000 head below last week but 82,281 head above the same week last year.\nFeb 26 Hogs closed at $88.475, up $0.625,\nApr 26 Hogs closed at $96.350, up $0.750\nMay 26 Hogs closed at $99.775, up $0.500,",
        "authors": "None",
        "publish_date": "2026-01-23 13:24:23",
        "published_at_raw": "2026-01-23T13:24:23Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures settled Thursday with contracts 50 to 75 cents higher on the session and reaching new contract highs. Open interest rose 4,217 contracts on Thursday. USDA’s national base hog price was reported at $83.09 on Thursday afternoon, down $...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1a2ab89cbc93d287253233bf4b66d37d",
        "title": "USDA Researchers Instructed to Investigate Foreign Colleagues",
        "doc_url": "https://www.nakedcapitalism.com/2026/01/usda-researchers-instructed-to-investigate-foreign-colleagues.html",
        "all_text": "Yves here. On one level, this story about the Administration intensifying its campaign against furriners, here academics, should come as no surprise. The Trump Team has made clear its desire to remove or downgrade the position of non-whites and women, and also views expertise and education with prejudice. Trying to enlist UDSA investigators into a pogrom of sorts against foreign researchers, even ones not in the US, is a twofer of sorts. It advances the Trump low-brow ethnic purity agenda while also making even the USDA staffers who pass the current test fearful. What McCarthyite pretext might be dreamed up to go after them next?\nBy Lisa Song, who reports on the EPA and related agencies that oversee the environment, climate change, and science for ProPublica and Sharon Lerner, who covers health and the environment and the agencies that govern them for ProPublica. Originally published at ProPublica; cross posted from Undark\nPresident Donald Trump’s administration is directing employees at the U.S. Department of Agriculture to investigate foreign scientists who collaborate with the agency on research papers for evidence of “subversive or criminal activity.”\nThe new directive, part of a broader effort to increase scrutiny of research done with foreign partners, asks workers in the agency’s research arm to use Google to check the backgrounds of all foreign nationals collaborating with its scientists. The names of flagged scientists are being sent to national security experts at t",
        "authors": "None",
        "publish_date": "2026-01-23 08:39:59",
        "published_at_raw": "2026-01-23T08:39:59Z",
        "meta_site_name": "Naked Capitalism",
        "description": "The Trump administration asks USDA scientists to research foreign co-authors for suspected collaboration or crimes.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]