[
    {
        "id": "cf88b19008deace13003302e6d6ea883",
        "title": "Corn Holds onto Losses on Monday",
        "doc_url": "https://www.barchart.com/story/news/36294641/corn-holds-onto-losses-on-monday",
        "all_text": "Corn futures were steady to 2 cents lower in the front months on Monday. The CmdtyView national average Cash Corn price was down ¾ cents at $3.87 ½.\nThe final Crop Progress report from NASS for the year showed a total of 96% of the corn crop harvested, slightly behind the 5-year average of 97%.\nUSDA tallied corn export shipments at 1.63 MMT (64.26 mbu) during the week ending on November 20. That was 20.98% below the week prior but up 61.78% from the same week last year. Mexico was the top destination of 624,332 MT, with 284,704 MT headed to Japan and 137,136 MT to South Korea. Marketing year exports for 2025/26 are now 17.483 MMT (688.27 mbu) since September 1, which is now a staggering 72% above the same period last year.\nExport Sales data will be released on Tuesday morning for the week of 10/9, with traders looking for 0.9-2.5 MMT of corn sales in the delayed dataset.\nBrazil’s first corn crop is estimated at 93% planted as of Thursday in the center south region according to AgRural, still lagging the 95% pace from last year.\nDec 25 Corn closed at $4.23 3/4, down 1 3/4 cents,\nNearby Cash was $3.87 1/2, down 3/4 cent,\nMar 26 Corn closed at $4.36 3/4, down 3/4 cent,\nMay 26 Corn closed at $4.44 1/4, down 1/2 cent,",
        "authors": "None",
        "publish_date": "2025-11-24 23:11:39",
        "published_at_raw": "2025-11-24T23:11:39Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures were steady to 2 cents lower in the front months on Monday. The CmdtyView national average Cash Corn price was down ¾ cents at $3.87 ½. The final Crop Progress report from NASS for the year showed a total of 96% of the corn crop harveste...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "dda5b2d975a9b74621c31c82acb9be57",
        "title": "Corn Holding Lower on Monday",
        "doc_url": "https://www.barchart.com/story/news/36290152/corn-holding-lower-on-monday",
        "all_text": "Corn futures are trading with contracts down fractionally to 2 cents in the front months on Monday. The CmdtyView national average Cash Corn price are down 1 ½ cents at $3.86.\nUSDA tallied corn export shipments at 1.63 MMT (64.26 mbu) during the week ending on November 20. That was 20.98% below the week prior but up 61.78% from the same week last year. Mexico was the top destination of 624,332 MT, with 284,704 MT headed to Japan and 137,136 MT to South Korea. Marketing year exports for 2025/26 are now 17.483 MMT (688.27 mbu) since September 1, which is now a staggering 72% above the same period last year.\nUSDA’s delayed Grain Crushing report showed a total of 463.44 million bushels of corn used in ethanol production during August. That was a 1.2% increase from July but down 3.36% from the year prior.\nBrazil’s first corn crop is estimated at 93% planted as of Thursday in the center south region according to AgRural, still lagging the 95% pace from last year.\nDec 25 Corn is at $4.23 1/2, down 2 cents,\nNearby Cash is at $3.86 1/1, down 1 1/2 cents,\nMar 26 Corn is at $4.37, down 1/2 cent,\nMay 26 Corn is at $4.44 1/2, down 1/4 cent,",
        "authors": "None",
        "publish_date": "2025-11-24 18:22:41",
        "published_at_raw": "2025-11-24T18:22:41Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with contracts down fractionally to 2 cents in the front months on Monday. The CmdtyView national average Cash Corn price are down 1 ½ cents at $3.86. USDA tallied corn export shipments at 1.63 MMT (64.26 mbu) during the wee...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "192384eae4bbb797c1c3b170ac8d7fc5",
        "title": "Cattle Close Monday Locked Limit Down",
        "doc_url": "https://www.barchart.com/story/news/36294673/cattle-close-monday-locked-limit-down",
        "all_text": "Live cattle futures saw $7.25 limit losses across most contracts on Monday, with $10.25 expanded limits set for Tuesday. There was some light cash trade picked up on Monday at $208 by the USDA in the Western Corn Belt. Last week’s cash trade was $215-219 in the North, with $220-224 in the South. Feeder cattle futures closed Monday down the $9.25 limit across the board, with expanded limits of $13.25 for Tuesday. The CME Feeder Cattle Index was down $3.34 to $336.38 on November 21. The weekly OKC feeder cattle auction had an estimated 3,302 head for sale, with feeders down $10-20 and calves down $20-40 early.\nLate on Friday, Tyson announced that it is planning to close its 5,000 head per day Lexington, NE plant and shift its Amarillo, TX plant to a single full capacity shift. The shutdown isn’t expected until January 20, which limits the immediate impact (i.e. the December and February contracts), but longs want out.\nThe monthly Cattle on Feed report from Friday showed the October placement total at 2.039 million head, down 10.02% from last year. Marketings during that month were down 8.02% to 1.697 million head. That took the November 1 on feed number to 11.706 million head, a 2.17% drop from last year and near trade estimates.\nUSDA reported Wholesale Boxed Beef prices lower in the Monday PM report, with the Chc/Sel spread widening to $14.98. Choice boxes were down 99 cents to $370.49, while Select was $1.47 lower at $355.51. USDA federally inspected cattle slaughter for Mond",
        "authors": "None",
        "publish_date": "2025-11-24 23:11:39",
        "published_at_raw": "2025-11-24T23:11:39Z",
        "meta_site_name": "Barchart",
        "description": "Live cattle futures saw $7.25 limit losses across most contracts on Monday, with $10.25 expanded limits set for Tuesday. There was some light cash trade picked up on Monday at $208 by the USDA in the Western Corn Belt. Last week’s cash trade was $215...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "db1d57c9400fd13849aa9afba34e3bfd",
        "title": "Corn Harvest 96% Complete in Final USDA Crop Report of 2025",
        "doc_url": "https://www.agriculture.com/usda-crop-progress-report-november-24-2025-11855841",
        "all_text": "The USDA released the final Crop Progress report of the growing season today. Here’s a look at corn and wheat crop progress for the week ending Nov. 23, 2025.\nCorn Harvest Nearly Wrapped\nAs of Nov. 23, 96% of the corn crop across the country’s top 18 corn-growing states had been harvested, up from 91% a week ago. That's just behind the five-year average of 97%.\nLast year at this time, progress had reached 100%.\nWinter Wheat Mostly Emerged\nAcross the top 18 winter wheat-growing states, planting progress had reached 97% as of Nov. 23, up from 92% last week and level with the five-year average. Last year at this time, progress had also reached 97%.\nEmergence of the crop reached 87% as of Sunday, up from 79% a week ago. The five-year average is 89%, and progress a year ago had reached 88%.\nThe nation’s winter wheat crop was rated 8% excellent, 40% good, 35% fair, 13% poor, and 4% very poor by USDA.\nLast year, the crop was rated 8% excellent, 47% good, 33% fair, 9% poor, and 3% very poor by USDA",
        "authors": "None",
        "publish_date": "2025-11-24 21:24:11",
        "published_at_raw": "2025-11-24T21:24:11Z",
        "meta_site_name": "Successful Farming",
        "description": "The USDA’s final Crop Progress report of 2025 shows 96% of the corn crop harvested and winter wheat progress matching the five-year average. Here’s a closer look.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3490109a9394679b41328addd5641b26",
        "title": "Feds declare Maine’s drought a natural disaster, unlocking relief for farmers",
        "doc_url": "https://www.pressherald.com/2025/11/24/feds-declare-maines-lengthy-drought-a-natural-disaster-unlocking-relief-for-farmers/",
        "all_text": "Maine farmers impacted by the state’s monthslong drought can now apply for emergency loans from the federal government.\nThe Maine Emergency Management Agency announced Monday that the U.S. Department of Agriculture has declared the drought a natural disaster, allowing the USDA’s Farm Service Agency to take applications for emergency loans.\nThe emergency loans can be used to restore or replace property, equipment and livestock, as well as to cover product costs, pay essential living expenses and refinance debts, pending eligibility.\nAll 16 of the state’s counties are included in the disaster declaration, with 10 considered primary counties.\n“Almost every sector of Maine agriculture has suffered losses from this year’s drought,” said Tom Gordon, soil and water conservation program coordinator at the Maine Department of Agriculture, Conservation & Forestry. “These emergency federal programs will provide some economic relief for farmers as they prepare for 2026.”\nThe disaster declaration is split into two.\nAdvertisement\nThe first declaration lists Androscoggin, Cumberland, Franklin, Kennebec, Oxford and Somerset as the primary counties impacted. Contiguous counties that are also eligible include Aroostook, Lincoln, Penobscot, Piscataquis, Sagadahoc, Waldo and York counties. Farmers in those counties have until May 22, 2026, to apply for loans.\nThe second — with Hancock, Knox, Waldo and Washington as primary counties and Aroostook, Kennebec, Lincoln, Penobscot and Somerset as cont",
        "authors": "None",
        "publish_date": "2025-11-24 20:52:14",
        "published_at_raw": "2025-11-24T20:52:14Z",
        "meta_site_name": "Portland Press Herald",
        "description": "Maine farms can now apply for emergency loans from the USDA to cover costs of replacing property, equipment and livestock or to pay essential expenses.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3cbda35424b391d89746b9708c89c13c",
        "title": "USDA Prepares to Reveal Relief Plan That Could Help Kansas Farmers Facing Uncertainty",
        "doc_url": "https://www.agriculture.com/partners-usda-prepares-to-reveal-relief-plan-that-could-help-kansas-farmers-facing-uncertainty-11856036",
        "all_text": "By Morgan Chilson\nTOPEKA — The head of the USDA said the agency would roll out a relief plan for the country’s agriculture sector in December, offering potential good news in a year of uncertainty for Kansans.\nSecretary Brooke Rollins did not give details about the plan but indicated the USDA has been analyzing and building a “formula” around the current situation, Bloomberg News reported.\nThat situation includes the effects of tariffs and trade policy, the lack of a farm bill and the high cost of inputs, factors that are making it difficult for Kansas farmers and ranchers to plan for the future.\nCrop farmers and cattle ranchers in the Sunflower State have shared vastly different experiences this year, according to a Kansas State University professor and economist.\nAcross the board, the agriculture industry has experienced general inflationary pressures on production expenses, said Jennifer Ifft, Kansas State University extension specialist on agricultural policy.\n“But once you get beyond that, I think this year, more than ever, you really have to look at crops and livestock separately,” she said on the Kansas Reflector podcast. “The beef cattle prices are high, historic highs for the cow/calf side. They’re finally making money after some pretty long rough spells.”\nHowever, crop farmers are seeing low prices and high expenses, Ifft said, along with weather pressures.\nKansas’ net farm income looks good, a measure that Ifft likens to the gross domestic product because it incorp",
        "authors": "None",
        "publish_date": "2025-11-24 20:34:32",
        "published_at_raw": "2025-11-24T20:34:32Z",
        "meta_site_name": "Successful Farming",
        "description": "The head of the USDA said the agency would roll out a relief plan for the country’s agriculture sector in December, offering potential good news in a year of uncertainty for Kansans.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a9d7ff0a1b53ea203ab79461b993891e",
        "title": "Soybeans Showing Steady Trade at Midday",
        "doc_url": "https://www.barchart.com/story/news/36290162/soybeans-showing-steady-trade-at-midday",
        "all_text": "Soybeans are showing fractionally mixed trade so far on Monday. The cmdtyView national average Cash Bean price is up 3/4 cent at $10.53 3/4. Soymeal futures are up 70 cents on the day, with Soy Oil futures 12 points lower.\nUSDA reported a private export sale of 123,000 MT of soybeans to China this morning. In a CNBC interview this morning, Ag Secretary Rollins indicated the US and China would be “inking a deal this week or next week” in terms of the 12 MMT soybean commitments that have been previously reported.\nExport Inspections data showed the lowest soybean export total for this week since 2006 at just 799,042 MT (29.36 mbu) shipped in the week that ended on November 20. That was a drop of 33.7% from the week prior and a massive 62.3% reduction from same week last year. Bangladesh was the top destination of 152,725 MT, with 140,821 MT to Algeria and 95,398 MT to Taiwan. China has remained mute as a destination. Marketing year shipments have totaled just 10.937 MMT (401.87 mbu), a 44.5% drop yr/yr.\nUSDA’s monthly Fats & Oils report showed a total of 198 million bushels of soybeans crushed in August. That was a record for the month and 18.19% above last year, but down 3.48% from the July total. Soybean oil stocks were tallied at 1.79 billion lbs, which was down 4.62% from the end of July but 9.71% above the year prior.\nAgRural estimates the Brazilian soybean crop at 81% planted as of Thursday, behind the 86% planting pace from last year\nJan 26 Soybeans are at $11.25 3/4, up ",
        "authors": "None",
        "publish_date": "2025-11-24 18:22:41",
        "published_at_raw": "2025-11-24T18:22:41Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are showing fractionally mixed trade so far on Monday. The cmdtyView national average Cash Bean price is up 3/4 cent at $10.53 3/4. Soymeal futures are up 70 cents on the day, with Soy Oil futures 12 points lower. USDA reported a private ex...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1b601008c5a95c591a7c8f654a1708b6",
        "title": "How to make Paneer stuffed Beetroot Paratha for breakfast",
        "doc_url": "https://timesofindia.indiatimes.com/life-style/food-news/how-to-make-paneer-stuffed-beetroot-paratha-for-breakfast/photostory/125547045.cms",
        "all_text": "Looking for a protein and iron-rich immunity boosting paratha recipe? Give this simple and easy recipe a try, which is made with mashed paneer and beetroot puree. Packed with essential vitamins like vitamin C, folate, and minerals such as potassium and iron, beetroot supports overall health and vitality. Its high amount of dietary fiber helps keep your digestion healthy, and the natural antioxidants, like betalains, can lower inflammation and protect your cells from damage. It is a good source of iron too and plays a crucial role in maintaining overall health. It is a key component of hemoglobin, the protein in red blood cells responsible for carrying oxygen throughout the body, and myoglobin, which supplies oxygen to muscles. According to the USDA data, raw beetroot contains about 0.8 mg of iron per 100 g. Take a look at the simple recipe.",
        "authors": "None",
        "publish_date": "2025-11-24 18:01:06",
        "published_at_raw": "2025-11-24T18:01:06Z",
        "meta_site_name": "Times of India",
        "description": "Looking for a protein and iron-rich immunity boosting paratha recipe? Give this simple and easy recipe a try, which is made with mashed paneer and beetroot puree. Packed with essential vitamins like vitamin C, folate, and minerals such as potassium and iron, beetroot supports overall health and vitality. Its high amount of dietary fiber helps keep your digestion healthy, and the natural antioxidants, like betalains, can lower inflammation and protect your cells from damage. It is a good source of iron too and plays a crucial role in maintaining overall health. It is a key component of hemoglobin, the protein in red blood cells responsible for carrying oxygen throughout the body, and myoglobin, which supplies oxygen to muscles. According to the USDA data, raw beetroot contains about 0.8 mg of iron per 100 g. Take a look at the simple recipe.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0bdbcc93277cbb637a82ec41a50ae2c4",
        "title": "U.S. Corn and Soybean Inspections Drop From Prior Week",
        "doc_url": "https://www.marketscreener.com/news/u-s-corn-and-soybean-inspections-drop-from-prior-week-ce7d5edcd08cf420",
        "all_text": "By Kirk Maltais\nExport inspections of U.S. corn and soybeans declined from the prior week, according to Agriculture Department data.\nIn its latest report released Monday, the USDA said export inspections of U.S. corn for the week ended November 20 totaled 1.63 million metric tons, while soybean inspections were 799,042 tons, which puts both lower than this time last week. Corn remains higher than it was at this time last year, while soybeans are even further behind.\nThe USDA said that for the current marketing year soybean export inspections total 10.94 million tons. That's a 45% drop from inspections at this time last year, which was 19.71 million tons.\nChina is not listed as a destination for U.S. grains in this week's report. Analysts this morning had projected that what the USDA said about China receiving any U.S. grains during the past week would be an important factor for trading today.\nWheat inspections totaled 474,530 tons for the week, which is up from this time last week and last year.\nCBOT grain futures are mixed in morning trading. Most-active wheat futures are down 1%, while corn rises 0.2% and soybeans slip 0.1%.\nTo see related data, search \"USDA Grain Inspections for Export in Metric Tons\" in Dow Jones NewsPlus.\nWrite to Kirk Maltais at kirk.maltais@wsj.com\n(END) Dow Jones Newswires\n11-24-25 1208ET",
        "authors": "None",
        "publish_date": "2025-11-24 17:09:19",
        "published_at_raw": "2025-11-24T17:09:19Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\nExport inspections of U.S. corn and soybeans declined from the prior week, according to Agriculture Department data.\nIn its latest report released Monday, the USDA said export...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "97dd97b3ee564e73080c635a2e6394cc",
        "title": "New USDA website centralizes info in fight against New World screwworm parasite threatening U.S. livestock",
        "doc_url": "https://www.fox9.com/news/new-usda-website-centralizes-info-fight-against-new-world-screwworm-parasite-threatening-u-s-livestock",
        "all_text": "article\nThe Brief\nNew World screwworm (NWS) can infest livestock, pets, wildlife, occasionally birds, and in rare cases, people.\nAnimals and humans become infected with NWS when the parasite lays eggs on and in open wounds.\nThe USDA says NWS is a serious concern for the U.S. economy and the U.S. food supply.\nThe U.S Department of Agriculture (USDA) has launched a new website to centralize federal agencies as they work together to protect livestock, wildlife, and the public’s health against the New World screwworm parasite.\nWhat is New World screwworm?\nWhen NWS fly larvae (maggots) burrow into the flesh of a living animal, they cause serious, often deadly damage to the animal. NWS can infest livestock, pets, wildlife, occasionally birds, and in rare cases, people. This is a serious concern to the U.S. economy and the U.S. food supply and the United States Department of Agriculture (USDA) is committed to combatting the spread of NWS to protect American agriculture.\n\"We do not take lightly the threat NWS poses to our livestock industry, our economy, and our food supply chain, said U.S. Secretary of Agriculture Brooke L. Rollins. \"The United States government will use all resources at its disposal to push back NWS.\"\nAnimals and humans become infected with New World screwworm (NWS) when the parasite lays eggs on and in open wounds. NWS can infest livestock, pets, wildlife, occasionally birds, and in rare cases, people. The FDA says NWS does not regularly occur in the U.S. and is t",
        "authors": "None",
        "publish_date": "2025-11-24 15:58:11",
        "published_at_raw": "2025-11-24T15:58:11Z",
        "meta_site_name": "FOX 9",
        "description": "The U.S  Department of Agriculture (USDA) has launched a new website to centralize federal  agencies as they work together to protect livestock, wildlife, and the public’s health against the New World screwworm parasite.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "03c45dfd91705d7cfd680259707ef7ce",
        "title": "Hogs Look to New Week of Trade",
        "doc_url": "https://www.barchart.com/story/news/36284649/hogs-look-to-new-week-of-trade",
        "all_text": "Lean hog futures saw weakness on Friday, with contracts down $1.67 to $2.42. December saw back and forth trade to close with a 70 cent losses on the week. USDA’s national base hog price from the Friday PM report was down $1.23 from the day prior at $70.64. The CME Lean Hog Index was down another 56 cents on November 19 at $85.71.\nCFTC data for the week ending on 10/7 showed managed money trimming 5,048 contracts from their previous record net long position, at 141,240 as of that Tuesday.\nUSDA’s pork carcass cutout value from the Friday afternoon report was back up $3.22 to $93.43 per cwt. The rib and ham primals were the only reported lower, with the belly back up $11.04. USDA estimated federally inspected hog slaughter for the week at 2.603 million head. That is 102,000 head below last week but up 22,625 head from same week last year.\nDec 25 Hogs closed at $77.800, down $1.675,\nFeb 26 Hogs closed at $77.700, down $1.950\nApr 26 Hogs closed at $81.300, down $2.425,",
        "authors": "None",
        "publish_date": "2025-11-24 13:33:52",
        "published_at_raw": "2025-11-24T13:33:52Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw weakness on Friday, with contracts down $1.67 to $2.42. December saw back and forth trade to close with a 70 cent losses on the week. USDA’s national base hog price from the Friday PM report was down $1.23 from the day prior at $...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8443d2f87b5a09881592cfea8c7a2ade",
        "title": "Deals on Farmer Aid, Chinese Soybean Purchases Coming Within Weeks, USDA Chief Says",
        "doc_url": "https://www.agriculture.com/partners-deals-on-farmer-aid-chinese-soybean-purchases-coming-within-weeks-usda-chief-says-11855536",
        "all_text": "By Susan Heavey\nWASHINGTON, Nov. 24 (Reuters) - U.S. Agriculture Secretary Brooke Rollins on Monday said the Trump administration expected to have deals regarding aid for U.S. farmers and Chinese soybean purchases within the next two weeks, but gave no other details.\n\"We'll have an announcement probably in the next week or two on what that's going to look like,\" the head of the U.S. Department of Agriculture told CNBC, referring to U.S. farmers.\nAsked about China's commitments to buy soybeans from the United States, she said: \"I know they are inking the deal this week or next week.\"\n(Reporting by Susan Heavey; Editing by Jan Harvey)",
        "authors": "None",
        "publish_date": "2025-11-24 12:50:26",
        "published_at_raw": "2025-11-24T12:50:26Z",
        "meta_site_name": "Successful Farming",
        "description": "Ag Secretary Brooke Rollins on Monday said the Trump administration expected to have deals regarding aid for U.S. farmers and Chinese soybean purchases within the next two weeks, but gave no other details.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b585b15e4bc7ea819588075e757d24c4",
        "title": "USDA Expects Deals on Farmer Aid, Chinese Soy Buys Within Weeks",
        "doc_url": "https://www.agriculture.com/partners-usda-expects-deals-on-farmer-aid-chinese-soy-buys-within-weeks-11855536",
        "all_text": "By Susan Heavey and Leah Douglas\nWASHINGTON, Nov. 24 (Reuters) - The Trump administration expects to announce an aid package for U.S. farmers within two weeks and a deal on Chinese soybean purchases, U.S. Agriculture Secretary Brooke Rollins said on Monday, without providing further details.\nThe administration of President Donald Trump has said for months that it would issue aid for farmers hit by low crop prices and trade disputes, but has not yet issued any plan or amount for the aid. U.S. farmers lost billions in soybean sales this year as top buyer China turned to Brazil and Argentina amid tense trade talks with Washington.\n\"We'll have an announcement probably in the next week or two on what that's going to look like,\" Rollins, the head of the U.S. Department of Agriculture, told CNBC of the farmer aid.\nThe American Farm Bureau Federation said on Monday that the aid is \"urgently needed\" as farmers face the compounding pressures of higher input costs and lower crop prices.\nIn October, after Trump met with Chinese President Xi Jinping in South Korea, China agreed to buy 12 million metric tons of American soybeans through January, according to the Trump administration. China purchased nearly 1.6 million metric tons of soybeans over three days last week, its largest single-week tally in two years, buoying crop prices.\nTwo cargo vessels were en route to grain terminals near New Orleans on Monday to load with China's first U.S. soybean shipments since May, according to a shippi",
        "authors": "None",
        "publish_date": "2025-11-24 12:50:26",
        "published_at_raw": "2025-11-24T12:50:26Z",
        "meta_site_name": "Successful Farming",
        "description": "The Trump administration expects to announce an aid package for U.S. farmers within two weeks and a deal on Chinese soybean purchases, U.S. Agriculture Secretary Brooke Rollins said on Monday, without providing further details.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "79305c37c3b8724ce48828225fa981d8",
        "title": "Deals on farmer aid, Chinese soybean purchases coming within weeks, USDA chief says",
        "doc_url": "https://www.reuters.com/world/china/deals-farmer-aid-chinese-soybean-purchases-coming-within-weeks-usda-chief-says-2025-11-24/",
        "all_text": "WASHINGTON, Nov 24 (Reuters) - U.S. Agriculture Secretary Brooke Rollins on Monday said the Trump administration expected to have deals regarding aid for U.S. farmers and Chinese soybean purchases within the next two weeks, but gave no other details.\n\"We'll have an announcement probably in the next week or two on what that's going to look like,\" the head of the U.S. Department of Agriculture told CNBC, referring to U.S. farmers.\nSign up here.\nAsked about China's commitments to buy soybeans from the United States, she said: \"I know they are inking the deal this week or next week.\"\nReporting by Susan Heavey; Editing by Jan Harvey",
        "authors": "None",
        "publish_date": "2025-11-24 12:39:43",
        "published_at_raw": "2025-11-24T12:39:43Z",
        "meta_site_name": "Reuters",
        "description": "U.S. Agriculture Secretary Brooke Rollins on Monday said the Trump administration expected to have deals regarding aid for U.S. farmers and Chinese soybean purchases within the next two weeks, but gave no other details.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]