[
    {
        "id": "d88a0d940aaee0ee413b6831b11ea41c",
        "title": "Corn Holds Higher on Tuesday",
        "doc_url": "https://www.barchart.com/story/news/36195271/corn-holds-higher-on-tuesday",
        "all_text": "Corn futures posted gains across most contracts on Tuesday with contracts closing up 1 to 2 cents. The CmdtyView national average Cash Corn price was up 2 cents at $3.98 1/4.\nAfter a near month and a half hiatus, USDA released their Crop Progress report showing 91% of the corn crop harvested as of 11/16, behind the 94% average harvest pace over the last 5 years.\nA South Korean importer purchased a total of 65,000 MT of corn in a tender on Tuesday, likely US origin.\nCFTC data for the week of September 30 will be released on Wednesday afternoon, with the full Commitment of Traders dataset not expected to be fully updated until January 23.\nEIA data will be released on Wednesday morning, with most looking for ethanol production to be firm with last week’s total.\nDec 25 Corn closed at $4.36 3/4, up 2 cents,\nNearby Cash was $3.98 1/4, up 2 cents,\nMar 26 Corn closed at $4.49 1/2, up 1 1/2 cents,\nMay 26 Corn closed at $4.56 1/2, up 1 cent,",
        "authors": "None",
        "publish_date": "2025-11-18 23:20:30",
        "published_at_raw": "2025-11-18T23:20:30Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted gains across most contracts on Tuesday with contracts closing up 1 to 2 cents. The CmdtyView national average Cash Corn price was up 2 cents at $3.98 1/4. After a near month and a half hiatus, USDA released their Crop Progress re...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "07409e7596bd9a99fd6a487540db57b2",
        "title": "Corn Holding Gains at Midday",
        "doc_url": "https://www.barchart.com/story/news/36189993/corn-holding-gains-at-midday",
        "all_text": "Corn futures are trading with contracts 1 to 2 cents higher at midday. The CmdtyView national average Cash Corn price is up 2 1/4 cents at $3.98 1/4.\nAfter a near month and a half hiatus, USDA released their Crop Progress report showing 91% of the corn crop harvested as of 11/16, behind the 94% average harvest pace over the last 5 years.\nA South Korean importer purchased a total of 65,000 MT of corn in a tender on Tuesday, likely US origin.\nDec 25 Corn is at $4.36 3/4, up 2 cents,\nNearby Cash is at $3.98 1/4, up 2 1/4 cents,\nMar 26 Corn is at $4.49 1/2, up 1 1/2 cents,\nMay 26 Corn is at $4.56 3/4, up 1 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-11-18 18:16:30",
        "published_at_raw": "2025-11-18T18:16:30Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with contracts 1 to 2 cents higher at midday. The CmdtyView national average Cash Corn price is up 2 1/4 cents at $3.98 1/4. After a near month and a half hiatus, USDA released their Crop Progress report showing 91% of the c...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c13846ab3fc2cb487f3b6d16146a32b4",
        "title": "How Much Higher Can Corn Prices Go?",
        "doc_url": "https://www.barchart.com/story/news/36187123/how-much-higher-can-corn-prices-go",
        "all_text": "March corn (ZCH26) futures present a buying opportunity on more price strength.\nSee on the daily bar chart for March corn futures that prices are trending higher and last week hit a four-month high. The bulls have the near-term technical advantage.\nFundamentally, domestic and export demand for U.S. corn remains strong. Recent rallies in soybean (ZSF26) and wheat (KEZ25) (ZWZ25) futures markets have also supported upside price pressure in corn futures.\nA move in March corn futures above chart resistance at $4.50 would give the bulls more power and it would also become a buying opportunity. The upside price objective would be $4.85 or above. Technical support, for which to place a protective sell stop just below, is located at $4.35.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in nature.\nHere is what the Commodity Futures Trading Commission (CFTC) has said about futures trading (and I agree 100%):\nTrading commodity futures and options is not for everyone. IT IS A VOLATILE, COMPLEX AND RISKY BUSINESS. Before you invest any money in futures or options contracts, you should consider your financial experience, goals and financial resources, and know how much you can ",
        "authors": "None",
        "publish_date": "2025-11-18 15:54:07",
        "published_at_raw": "2025-11-18T15:54:07Z",
        "meta_site_name": "Barchart",
        "description": "March corn futures present a buying opportunity on more price strength.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0fce4edd6cf840260bfeff43264f55e9",
        "title": "Corn Continues Strength on Tuesday AM Trade",
        "doc_url": "https://www.barchart.com/story/news/36181819/corn-continues-strength-on-tuesday-am-trade",
        "all_text": "Corn price action is up 3 to 4 cents across most contracts on Tuesday morning. Futures saw gains hold into the Monday close, as contracts were up 3 to 4 ½ cents. March peaked above $4.50 but couldn’t hold into the close. Preliminary open interest was down 11,325 contracts on Monday, with 21,022 contracts leaving the December. The CmdtyView national average Cash Corn price was back up 4 3/4 cents at $3.96 1/4.\nExport Inspections data showed 2.054 MMT (80.86 mbu) of corn shipped in the week that ended on November 13, the largest total for any week since April 2021. That was an increase of 38.35% from the week prior and more than double the same week last year. Mexico was the top destination of 592,006 MT, with 424,773 MT to Japan and 349,789 MT to South Korea. Marketing year shipments have totaled a massive 15.838 MMT (623.5 mbu) already, a 73% increase yr/yr.\nA South Korean importer purchased a total of 65,000 MT of corn in a tender on Tuesday, likely US origin.\nDec 25 Corn closed at $4.34 3/4, up 4 1/2 cents, currently up 3 3/4 cents\nNearby Cash was $3.96 1/4, up 4 3/4 cents,\nMar 26 Corn closed at $4.48, up 4 cents, currently up 3 1/2 cents\nMay 26 Corn closed at $4.55 1/2, up 3 1/4 cents, currently up 3 cents",
        "authors": "None",
        "publish_date": "2025-11-18 13:28:10",
        "published_at_raw": "2025-11-18T13:28:10Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is up 3 to 4 cents across most contracts on Tuesday morning. Futures saw gains hold into the Monday close, as contracts were up 3 to 4 ½ cents. March peaked above $4.50 but couldn’t hold into the close. Preliminary open interest wa...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6649a40d1937862cd798a4bf790d3b78",
        "title": "Soybeans rebound on thaw in Sino-US ties, but outlook cloudy",
        "doc_url": "https://www.thehindubusinessline.com/markets/commodities/soybeans-rebound-on-thaw-in-sino-us-ties-but-outlook-cloudy/article70291703.ece",
        "all_text": "Soybean prices have rebounded to a 16-month high after relations between the US and China thawed, but the outlook for the oilseed remains uncertain, analysts say.\nCurrently, soybeans futures are ruling at $11.38 a bushel (about $380 a tonne) on the Chicago Board of Trade. Soybean prices have witnessed a sharp spike compared to wheat and corn between October 13 and November 11, buoyed by the thaw in Sino-US relations.\nSoybean futures rebounded after China announced it would restore export eligibility for three US firms starting November 10, said the Trading Economics website. Prices have fluctuated since then following a slew of development after the truce.\nActual volumes unclear\n“During the China International Import Expo, Beijing signed several agricultural purchase agreements, including soybeans, though actual purchase volumes remain unclear. Despite the positive signals, US soybeans still face a 13 per cent tariff, compared with 3 per cent for Brazilian and Argentine supplies, limiting US price competitiveness,” it said.\nResearch agency BMI, a unit of Fitch Solutions, said given the weak financial environment of the sector, it sees little scope for more expensive US soybeans to regain significant market share in China’s commercial sector.\nBetween October 31 and November 11, US soybeans reversed from a $17.6/tonne discount to a $6.1 premium over Brazilian supplies, effectively pricing American farmers out of markets.\n“Should market confidence in the purported US-China agree",
        "authors": "None",
        "publish_date": "2025-11-18 03:30:00",
        "published_at_raw": "2025-11-18T03:30:00Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "Soybean prices rise amid improved US-China relations, but high tariffs and weak demand create a cloudy market outlook.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ccd2418b61f4503cdaf177c0e2dbc207",
        "title": "Secretary of Ag. says SNAP beneficiaries will have to reapply, leaving some in limbo",
        "doc_url": "https://wjla.com/news/nation-world/secretary-of-ag-says-snap-beneficiaries-will-have-to-reapply-leaving-some-in-limbo-usda-department-of-agriculture-crackdown-snap-fraud-crackdown-katu-food-stamps-benefits",
        "all_text": "Secretary of Agriculture Brooke Rollins announced last week that the U.S. Department of Agriculture (USDA) will require Supplemental Nutrition Assistance Program (SNAP) recipients to re-apply for their benefits to prevent fraud.\nRollins revealed on Newsmax that data from states showed \"186,000 deceased men and women and children in this country are receiving a check.\" KATU has not independently confirmed this level of fraud.\nKATU reached out to the USDA to find out how this will impact SNAP recipients. A spokesperson provided the following statement:\nSecretary Rollins wants to ensure the fraud, waste, and incessant abuse of SNAP ends. Rates of fraud were only previously assumed, and President Trump is doing something about it. Using standard recertification processes for households is a part of that work. As well as ongoing analysis of State data, further regulatory work, and improved collaboration with States.\nWe followed up with the USDA, asking them a slew of questions including when recipients will have to reapply, whether benefits will stop, if eligibility requirements will change, and how the government has discovered fraud.\nWe have not yet heard back.\nKATU also reached out to the Oregon Department of Human Services (ODHS) for information on federal directives. A spokesperson said us they have not yet heard anything, and that they cannot start a re-application process without clear direction.\nScott Kerman, Executive Director of the Blanchet House and Farm, expressed con",
        "authors": "None",
        "publish_date": "2025-11-18 22:31:59",
        "published_at_raw": "2025-11-18T22:31:59Z",
        "meta_site_name": "WJLA",
        "description": "Secretary of Agriculture Brooke Rollins announced last week that the USDA will require SNAP recipients to reapply.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "274850176ee341f18769e13d10c55c67",
        "title": "Secretary of Ag. says SNAP beneficiaries will have to reapply, leaving some in limbo",
        "doc_url": "https://foxbaltimore.com/news/nation-world/secretary-of-ag-says-snap-beneficiaries-will-have-to-reapply-leaving-some-in-limbo-usda-department-of-agriculture-crackdown-snap-fraud-crackdown-katu-food-stamps-benefits",
        "all_text": "Secretary of Agriculture Brooke Rollins announced last week that the U.S. Department of Agriculture (USDA) will require Supplemental Nutrition Assistance Program (SNAP) recipients to re-apply for their benefits to prevent fraud.\nRollins revealed on Newsmax that data from states showed \"186,000 deceased men and women and children in this country are receiving a check.\" KATU has not independently confirmed this level of fraud.\nKATU reached out to the USDA to find out how this will impact SNAP recipients. A spokesperson provided the following statement:\nSecretary Rollins wants to ensure the fraud, waste, and incessant abuse of SNAP ends. Rates of fraud were only previously assumed, and President Trump is doing something about it. Using standard recertification processes for households is a part of that work. As well as ongoing analysis of State data, further regulatory work, and improved collaboration with States.\nWe followed up with the USDA, asking them a slew of questions including when recipients will have to reapply, whether benefits will stop, if eligibility requirements will change, and how the government has discovered fraud.\nWe have not yet heard back.\nKATU also reached out to the Oregon Department of Human Services (ODHS) for information on federal directives. A spokesperson said us they have not yet heard anything, and that they cannot start a re-application process without clear direction.\nScott Kerman, Executive Director of the Blanchet House and Farm, expressed con",
        "authors": "None",
        "publish_date": "2025-11-18 22:31:59",
        "published_at_raw": "2025-11-18T22:31:59Z",
        "meta_site_name": "Baltimore News",
        "description": "Secretary of Agriculture Brooke Rollins announced last week that the USDA will require SNAP recipients to reapply.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "dc9558dc180abc2a40f93e2f12be7f72",
        "title": "USDA ‘Crunching Numbers’ for Potential Tariff Relief, Official Says ‘Lots’ Changed During Shutdown",
        "doc_url": "https://www.agriculture.com/partners-usda-crunching-numbers-for-potential-tariff-relief-official-says-lots-changed-during-shutdown-11852149",
        "all_text": "By Cassandra Stephenson\nThe USDA is “crunching numbers” as it considers potential relief for farmers from tariff-related losses, U.S. Deputy Secretary of Agriculture Stephen A. Vaden said Monday.\nPresident Donald Trump’s administration previously hinted that it might devote up to $12 billion to aid payments for farmers who were hurt by tariff policies this year, Politico reported in late October.\n“This department only woke back up on Thursday of last week,” Vaden said, referencing the Nov. 12 conclusion of the longest government shutdown in U.S. history. “Lots of things changed during (the government shutdown),” including trade agreements with China, Southeast Asia, Pakistan, and Japan, he added.\n“Those have resulted in major commitments to buy American commodities and USDA now needs to take into account the effect that those commodity purchases will have on the market … going into 2026,” Vaden said.\nChina is a top consumer of U.S. soybean exports, the largest agricultural export in the U.S. China froze purchases of U.S. soybeans this year while battling with Trump over tariffs, leaving U.S. soybean farmers without orders from their largest customer for months.\nThe White House announced a trade agreement with China in October in which China agreed to purchase at least 12 million metric tons of U.S. soybeans by the end of 2025, and at least 25 million metric tons each year through 2028.\nBut USDA data logging sales activity from Oct. 2–Nov. 12 shows China made only two soybean ",
        "authors": "None",
        "publish_date": "2025-11-18 20:43:06",
        "published_at_raw": "2025-11-18T20:43:06Z",
        "meta_site_name": "Successful Farming",
        "description": "The USDA is “crunching numbers” as it considers potential relief for farmers from tariff-related losses, U.S. Deputy Secretary of Agriculture Stephen A. Vaden said Monday.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7ab091b50b5b8c1650f311b13b852a77",
        "title": "Soybean Futures Fall After USDA Confirms Chinese Buy - Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/soybean-futures-fall-after-usda-confirms-chinese-buy-daily-grain-highlights-ce7d5edbd08ffe27",
        "all_text": "By Kirk Maltais\n--Soybeans for January delivery fell 0.6%, to $11.51 a bushel, on the Chicago Board of Trade Tuesday, after the USDA confirmed a large purchase of U.S. soybeans by China and traders opted to \"buy the rumor, sell the fact.\"\n--Wheat for December delivery rose 0.1%, to $5.60 a bushel.\n--Corn for December delivery rose 0.2%, to $4.35 1/2 a bushel.\nHIGHLIGHTS\nAbsence of Suspense: With the USDA confirming a flash sale of 792,000 metric tons of soybeans to China for delivery in the 2025/26 marketing year, traders opted to rake in their profits. \"Almost everything today is consolidation,\" said Karl Setzer of Consus Ag Consulting. Soybeans rose Monday following reports of the sale, although those reports indicated sales of over 1 million metric tons.\nRetracing Steps: Last week's WASDE showed larger-than-expected corn production and yields, but corn futures have turned around since then and signal more upside, said Phil Flynn of Price Futures Group. \"The corn futures are pretty good from the demand side,\" he said, adding that the demand may use up a bigger part of the record-sized corn crop than originally anticipated. \"I think the ethanol situation should be favorable from a demand viewpoint over the next couple weeks,\" said Flynn. The EIA reported record-large daily ethanol production last month, at 1.123 million barrels a day.\nINSIGHT\nOn the Books: The USDA confirmed a sale of U.S. soybean exports to China on Tuesday morning, with 792,000 tons sold for delivery in th",
        "authors": "None",
        "publish_date": "2025-11-18 20:33:41",
        "published_at_raw": "2025-11-18T20:33:41Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\n--Soybeans for January delivery fell 0.6%, to $11.51 a bushel, on the Chicago Board of Trade Tuesday, after the USDA confirmed a large purchase of U.S. soybeans by China and...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "70c7a45bce715833e5176d06d7e700ed",
        "title": "Wheat Mixed, with Most on the Higher Side",
        "doc_url": "https://www.barchart.com/story/news/36190013/wheat-mixed-with-most-on-the-higher-side",
        "all_text": "The wheat complex are mixed across the board on Tuesday. Chicago SRW futures are 1 to 3 cents higher on Tuesday. KC HRW futures are fractionally lower at midday. MPLS spring wheat futures are continuing strength, up 4 to 9 ½ cents.\nUSDA released their Crop Progress report this morning showing the winter wheat crop at 92% planted, lagging the 95% average pace. Emergence was at 79%, behind the 84% 5-year average. Condition ratings were pegged at 45% in good/excellent ratings, which was down from 49% last year. That equated to 328 on the Brugler500 index, down from 338 a year ago.\nDec 25 CBOT Wheat is at $5.46 3/4, up 2 1/2 cents,\nMar 26 CBOT Wheat is at $5.60, up 1 1/2 cents,\nDec 25 KCBT Wheat is at $5.28 1/4, down 1/2 cent,\nMar 26 KCBT Wheat is at $5.44 1/4, down 1/2 cent,\nDec 25 MGEX Wheat is at $5.83 1/4, up 9 1/2 cents,\nMar 26 MGEX Wheat is at $5.85 1/4, up 4 cents,",
        "authors": "None",
        "publish_date": "2025-11-18 18:16:30",
        "published_at_raw": "2025-11-18T18:16:30Z",
        "meta_site_name": "Barchart",
        "description": "The wheat complex are mixed across the board on Tuesday. Chicago SRW futures are 1 to 3 cents higher on Tuesday. KC HRW futures are fractionally lower at midday. MPLS spring wheat futures are continuing strength, up 4 to 9 ½ cents. USDA released the...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bc59a1c6c75fca490365d7f5c8e48fe0",
        "title": "USDA Crop Progress Report Returns After Shutdown: Corn, Soy Harvest Nearly Done",
        "doc_url": "https://www.agriculture.com/usda-crop-progress-report-nov-18-2025-11851911",
        "all_text": "Following six missed reports, the USDA has released the first Crop Progress report since the government shutdown ended. Here’s a look at corn, soybean, and wheat crop progress for the week ending Nov. 16.\nCorn\nAs of Nov. 16, 91% of the corn crop across the country’s top 18 corn-growing states had been harvested, behind the five-year average of 94%. Last year at this time, progress had reached 98%.\nSoybeans\nThe USDA reported 95% of the soybean crop across the top 18 soybean-growing states had been harvested by Nov. 16, just behind the five-year average of 96%. Last year at this time, progress had reached 98%.\nWinter Wheat\nAcross the top 18 winter wheat-growing states, progress had reached 92% as of Nov. 16, 3 percentage points shy of the five-year average. Last year at this time, progress had reached 94%.\nEmergence of the crop reached 79% as of Sunday. The five-year average is 84%, and progress a year ago had reached 83%.\nThe nation's winter wheat crop was rated 8% excellent, 37% good, 36% fair, 13% poor, and 6% very poor by USDA.",
        "authors": "None",
        "publish_date": "2025-11-18 18:00:44",
        "published_at_raw": "2025-11-18T18:00:44Z",
        "meta_site_name": "Successful Farming",
        "description": "Following six missed reports, the USDA has released the first Crop Progress report since the government shutdown ended. Here’s a look at corn, soybean, and wheat progress for the week ending Nov. 16.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:25",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6b4a0922ffbffd1152d73203bfeb91fa",
        "title": "What we know about claims USDA found thousands of dead and double-enrolled people on SNAP",
        "doc_url": "https://www.snopes.com/news/2025/11/18/usda-snap-fraud/",
        "all_text": "In November 2025, a claim (archived) circulated online that U.S. Secretary of Agriculture Brooke Rollins found that 500,000 people on the Supplemental Nutrition Assistance Program (SNAP) benefit were double-enrolled and that 5,000 dead people still received the benefit.\nAccording to the U.S. Department of Agriculture (USDA), nearly 42 million people received monthly SNAP benefits, sometimes referred to as food stamps, in fiscal year 2024. On average, SNAP provided $187 per month, or about $6 per day, in benefits to help seniors, people with disabilities and families purchase household food staples.\nOne Threads user who shared the claim about the double-enrolled and dead people receiving SNAP benefits posted a video clip from a Fox News interview of Rollins with the caption, \"🚨 BREAKING: In a jaw-dropping revelation, Sec. Brooke Rollins found 5,000 DEAD PEOPLE getting SNAP, and 500,000 PEOPLE getting SNAP '2 times under the same name.'\"\nThe claim also circulated on Facebook (archived), X (archived), Instagram (archived) and TikTok.\nDuring an interview with Fox News' Laura Ingraham on Nov. 12, 2025, Rollins said (time code 02:26) her department found, \"Half a million people getting benefits two times under the same name. 5,000 dead people,\" during a review of SNAP recipient information the USDA gathered from 29 states. The next day, on Nov. 13, 2025, Rollins told \"Rob Schmitt Tonight\" on Newsmax, \"That 5,000 dead people, that was just one month. The number is closer to 186,000 ",
        "authors": "None",
        "publish_date": "2025-11-18 15:34:12",
        "published_at_raw": "2025-11-18T15:34:12Z",
        "meta_site_name": "Snopes.com",
        "description": "U.S. Secretary of Agriculture Brooke Rollins said the numbers came from SNAP recipient data from 29 \"red\" states.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:25",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "14e7f189af0f0b3ab017262c1edff881",
        "title": "When are they returning? How to re-apply",
        "doc_url": "https://www.pjstar.com/story/news/politics/2025/11/18/illinois-snap-benefits-update-recipients-must-re-apply-when-is-snap-returning-food-stamps/87333525007/",
        "all_text": "Recipients of the Supplemental Nutrition Assistance Program (SNAP) will have to reapply for benefits following the re-opening of the government in attempts to combat \"fraud,\" Agriculture Secretary Brooke Rollins said.\nRollins said SNAP, meant to be a nutrition lifeline for financially struggling households, was among the first priorities she targeted for review, citing concerns about eligibility and oversight in an interview with Newsmax on Nov. 13.\n\"Make sure that everyone that’s taking a taxpayer-funded benefit through ... food stamps, that they literally are vulnerable and they can’t survive without it,\" she said.\nBut how do you reapply for benefits in Illinois? Here's what we know.\nWhat is SNAP?\nSNAP, also known as food stamps, is a federal program that provides low-income families monthly benefits to afford healthy food. The program is typically run by state public assistance agencies through their local offices.\nHow rare is SNAP fraud?\nDuring the Newsmax interview, Rollins claimed preliminary data from 29 states showed more than 186,000 \"deceased\" individuals are \"receiving a check\" through SNAP. However, benefits are distributed on electronic cards, not checks.\nFraud happens in three primary ways, according to the USDA: applicants misrepresenting income or identity, retailers trading benefits for cash or unapproved items, or criminals stealing benefits by scanning or cloning EBT cards.\nThe U.S. Congressional Research Service described SNAP fraud as \"rare\" in an April 7",
        "authors": "None",
        "publish_date": "2025-11-18 14:48:53",
        "published_at_raw": "2025-11-18T14:48:53Z",
        "meta_site_name": "Peoria Journal Star",
        "description": "The USDA head said SNAP recipients must re-apply for benefits to combat \"fraud.\" Here's how to do it in Illinois.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:25",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ef46f977505f21b10d2c0c99a692d39c",
        "title": "SNAP benefits: All recipients must reapply under new Trump administration policy",
        "doc_url": "https://www.oregonlive.com/politics/2025/11/everyone-on-snap-will-need-to-reapply-for-benefits-trump-official-says.html",
        "all_text": "Every person who receives SNAP benefits will soon have to reapply, according to Secretary of Agriculture Brooke Rollins.\nRollins appeared on Newsmax’s Rob Schmitt Tonight on Thursday and reiterated that the Trump Administration is serious about “clamping down” on fraud within the SNAP system. This has been the messaging of the USDA under Rollins since she took office.\nShe made an X post featuring a clip from a Fox News interview at the beginning of the month, talking about a Trump executive order, which attempted to compel states to transmit SNAP benefits data to the USDA’s Food and Nutrition Service.\nOnly 29 states willingly participated. Rollins claimed in an X post that just two states had sued the Trump Administration over the issue.\nHowever, Oregon and 20 other states came together to sue the Trump Administration and won.\nThe states won the right to keep the sensitive information of SNAP beneficiaries -- including home addresses, social security numbers and immigration status -- out of the hands of federal agencies.\nThe lawsuit was announced in July and argued that the information would likely be shared across federal agencies and used for immigration enforcement, which is illegal.\nDuring the same Fox News segment, Rollins said the USDA was asking for this data to “better understand how this explosion of SNAP benefits happened under Joe Biden. We increased almost 40% on this program in just a couple of years under the Biden administration.”\n“Of course, we know they were ",
        "authors": "None",
        "publish_date": "2025-11-18 14:00:01",
        "published_at_raw": "2025-11-18T14:00:01Z",
        "meta_site_name": "The Oregonian",
        "description": "USDA chief Brooke Rollins said all SNAP beneficiaries will have to reapply, claiming widespread fraud despite data showing minimal increases in enrollment.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:25",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "36e0cc604d9e2026dbe62c3e82bc27a2",
        "title": "Hogs Start the Week Mixed",
        "doc_url": "https://www.barchart.com/story/news/36181861/hogs-start-the-week-mixed",
        "all_text": "Lean hog futures posted mixed Monday trade, with contracts up 7 cents to 20 cents lower across the front months. Preliminary open interest suggested a rotations of ownership, up 372 contracts. USDA’s national base hog price from Monday afternoon was up 30 cents from Friday at $76.14. The CME Lean Hog Index was down 89 cents on November 13 at $87.94.\nUSDA’s pork carcass cutout value from the Monday PM report was back down 21 cents to $97.01 per cwt. The picnic, rib, and ham primals were the only reported higher. USDA estimated federally inspected hog slaughter for the Monday at 494,000 head. That is even with last Monday and up 4,006 head from same week last year.\nDec 25 Hogs closed at $78.575, up $0.075,\nFeb 26 Hogs closed at $79.425, up $0.050\nApr 26 Hogs closed at $83.025, down $0.125,",
        "authors": "None",
        "publish_date": "2025-11-18 13:28:11",
        "published_at_raw": "2025-11-18T13:28:11Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted mixed Monday trade, with contracts up 7 cents to 20 cents lower across the front months. Preliminary open interest suggested a rotations of ownership, up 372 contracts. USDA’s national base hog price from Monday afternoon was...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:25",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e23058bc86e65f183e1ad57a10878d28",
        "title": "What the U.S. Government Is Dismissing That Could Seed a Bird Flu Pandemic",
        "doc_url": "https://www.propublica.org/article/bird-flu-airborne-usda-pandemic",
        "all_text": "Nearly a million chickens packed the barns at Howe’s Hens last Christmas Eve when the first of them tested positive for bird flu. The deadly virus spreads so fast that even if only one hen is infected, farmers are legally obligated to kill all of the others. Massive mounds of carcasses soon appeared outside the Ohio egg farm, covered in compost.\nThe slaughter wasn’t enough. The virus tore through industrial barns in Darke County and moved on through one of the most poultry-dense regions in America, crossing the state line into Indiana. Rows of raised earth became a familiar sight alongside the roads that crisscrossed the plains. The air stank of death, recalled cafe owner Deborah Mertz: “The smell of every bird in Mercer County, rotting.”\nThe U.S. Department of Agriculture urged farmers to follow a longstanding playbook that assumes that bird flu is spread by wild birds and tracked into barns with lax safety practices. The agency blamed the outbreak on “shared people and equipment.”\nThree years into a brutal wave of the virus, industry leaders raised evidence that bird flu was entering barns differently and evading even the strictest protocols. They suspected it could be airborne and begged officials to deploy a proven weapon against the disease: a vaccine for poultry.\nThe USDA didn’t do that or explore their theory, and its playbook failed: In just three months, the virus that erupted in a single Ohio farm spread to flocks with over 18 million hens — 5% of America’s egg laye",
        "authors": "None",
        "publish_date": "2025-11-18 10:00:00",
        "published_at_raw": "2025-11-18T10:00:00Z",
        "meta_site_name": "ProPublica",
        "description": "Egg producers suspect bird flu is traveling through the air. After a disastrous Midwestern outbreak early this year, we tested that theory and found that where the wind blew, the virus followed. Vaccines could help, but the USDA hasn’t approved them.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:25",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "276a7fde9b0604beaa9e17742d608772",
        "title": "SNAP “reset”: USDA requires recipients to reapply for benefits",
        "doc_url": "https://www.naturalnews.com/2025-11-18-usda-requires-snap-recipients-reapply-for-benefits.html",
        "all_text": "The Trump administration is requiring every one of the 42 million SNAP (food stamp) recipients to reapply for their benefits, framing it as a fundamental \"reset\" of the program to combat alleged systemic fraud.\nThe policy is driven by an ongoing USDA audit that claims to have found benefits being paid for nearly 200,000 deceased individuals and over 500,000 cases of duplicate registrations, though data from 21 states is still being contested.\nThe reapplication process is designed to enforce stricter eligibility rules, shifting the program's purpose from broad nutritional support to a tightly targeted safety net for only the most vulnerable, with an aim to push able-bodied individuals into the workforce.\nThe policy faces major hurdles, including a lawsuit from 21 states blocking federal data collection and strong opposition from critics who argue it exaggerates fraud to justify ideologically-driven cuts.\nCritics warn that forcing 42 million people to reapply simultaneously could cause a bureaucratic disaster, where even eligible individuals risk losing crucial benefits due to processing delays or paperwork errors, threatening their food security.\nIn a move that promises to reshape America's largest food assistance program, Agriculture Secretary Brooke Rollins announced a monumental policy shift requiring every single recipient of the Supplemental Nutrition Assistance Program (SNAP) to reapply for their benefits. The declaration, made on November 14, signals the Trump administr",
        "authors": "None",
        "publish_date": "2025-11-18 05:08:14",
        "published_at_raw": "2025-11-18T05:08:14Z",
        "meta_site_name": "Natural News",
        "description": "The Trump administration is requiring every one of the 42 million SNAP (food stamp) recipients to reapply for their benefits, framing it as a fundamental “reset” of the program to combat alleged systemic fraud. The policy is driven by an ongoing USDA audit that claims to have found benefits being paid for nearly 200,000 deceased […]",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:25",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]