[
    {
        "id": "7b5c6dec9ed4cd9c07395017874bcff9",
        "title": "Corn Slipping Back on Wednesday Morning",
        "doc_url": "https://www.barchart.com/story/news/19240/corn-slipping-back-on-wednesday-morning",
        "all_text": "Corn prices are down 1 to 2 cents so far on Wednesday morning trade. Futures were 2 to 3 cents higher at the Tuesday close. The CmdtyView national average Cash Corn price was up 2 1/2 cents at $3.94 1/4.\nThe Treasury issued guidance on the 45Z tax credit on Tuesday morning. They still need to go through a public hearing process, which is scheduled for May.\nEIA data will be released on Wednesday morning, with most expecting to see a reduction in ethanol output for the week ending on January 30.\nA South Korean importer purchased a total of 65,000 MT of corn in a private tender on Tuesday.\nMar 26 Corn closed at $4.28 1/2, up 2 3/4 cents, currently down 2 cents\nNearby Cash was $3.94 1/4, up 2 1/2 cents,\nMay 26 Corn closed at $4.35 3/4, up 2 1/4 cents, currently down 1 1/2 cents\nJul 26 Corn closed at $4.42, up 2 1/4 cents, currently down 1 1/2 cents",
        "authors": "None",
        "publish_date": "2026-02-04 13:29:47",
        "published_at_raw": "2026-02-04T13:29:47Z",
        "meta_site_name": "Barchart",
        "description": "Corn prices are down 1 to 2 cents so far on Wednesday morning trade. Futures were 2 to 3 cents higher at the Tuesday close. The CmdtyView national average Cash Corn price was up 2 1/2 cents at $3.94 1/4. The Treasury issued guidance on the 45Z tax c...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cbbd0827a866efd83174f49ea8af61c2",
        "title": "China signals strong demand for soybean imports in 2026 rural blueprint",
        "doc_url": "https://www.scmp.com/economy/china-economy/article/3342390/china-signals-strong-demand-soybean-imports-2026-rural-blueprint",
        "all_text": "Despite a tight balance between production and demand, China would diversify import sources and make full use of international markets, said Han Wenxiu, head of the office of the Communist Party’s rural affairs leading group.\nHis remarks followed Tuesday’s release of Beijing’s 2026 rural blueprint, known as the “No 1 Document” and traditionally the leadership’s first policy directive of the year.\nThe blueprint pledged to boost soybean output by prioritising yields and better aligning domestic production with trade, marking a shift from Beijing’s years-long emphasis on expanding planting acreage to curb dependence on major overseas suppliers such as the US.\n“We will actively pursue broader and higher-level opening-up, including in agriculture”, Han said, while stressing that “it is essential to appropriately regulate the pace and extent of farm product imports to protect national food security”.",
        "authors": "None",
        "publish_date": "2026-02-04 11:02:46",
        "published_at_raw": "2026-02-04T11:02:46Z",
        "meta_site_name": "South China Morning Post",
        "description": "Beijing also vows broader agricultural opening while safeguarding domestic production and farmers.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "42d7195366941af4a10f0a1ca6a5f63c",
        "title": "Hogs Post Early Week Rally, as Traders Look to Wednesday",
        "doc_url": "https://www.barchart.com/story/news/19335/hogs-post-early-week-rally-as-traders-look-to-wednesday",
        "all_text": "Lean hog futures closed with Monday gains of 80 cents to $1.55 in the front months. USDA’s national base hog price was reported at $86.37 on Tuesday afternoon, up $4.15 from the Monday report. The CME Lean Hog Index was back down 7 cents on Jan 30 at $85.71.\nUSDA’s pork carcass cutout value from Tuesday afternoon report was $1.67 higher to $97.37 per cwt. The rib and belly were the only primals reported higher, with the Rib up $5.06 and belly $15.32 higher. USDA estimated federally inspected hog slaughter on Tuesday was 487,000 head, taking the weekly total to 931,000 head. That was 33,000 head above last week but 32,851 head below the same week last year.\nFeb 26 Hogs closed at $88.550, up $0.800,\nApr 26 Hogs closed at $98.150, up $1.525\nMay 26 Hogs closed at $101.925, up $1.300,",
        "authors": "None",
        "publish_date": "2026-02-04 13:29:48",
        "published_at_raw": "2026-02-04T13:29:48Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed with Monday gains of 80 cents to $1.55 in the front months. USDA’s national base hog price was reported at $86.37 on Tuesday afternoon, up $4.15 from the Monday report. The CME Lean Hog Index was back down 7 cents on Jan 30 at...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f3ff947002d669c7486ba0d8c00ac22f",
        "title": "Kris Kobach pushes Kansas bill to share SNAP data with Trump's USDA",
        "doc_url": "https://www.cjonline.com/story/news/politics/government/2026/02/04/kris-kobach-pushes-kansas-bill-to-share-snap-data-with-trumps-usda/88482842007/",
        "all_text": "Kansas Attorney General Kris Kobach is asking lawmakers to require the governor's administration to share food stamp data with the federal government.\nThe U.S. Department of Agriculture has requested the data to ensure program integrity, but Gov. Laura Kelly's administration has refused, citing privacy concerns.\nThe governor's office and food banks argue that sharing personal data, including Social Security numbers, could violate privacy laws and is an overreach.\nKobach contends the data is needed to combat fraud and that a new law would clarify the state's obligation to comply with the federal request.\nAttorney General Kris Kobach is asking Kansas lawmakers to pass a law intended to explicitly require Gov. Laura Kelly's administration to turn over food stamp data to the federal government.\nThe move is the latest development in the conflict between the Republican attorney general and Democratic governor over compliance with Republican President Donald Trump's administration.\nAt issue is a demand from the U.S. Department of Agriculture for data on the Supplemental Nutrition Assistance Program. The USDA has said the data will go into a SNAP information database and is needed to ensure \"program integrity.\" The Kansas Department for Children and Families has refused, arguing it would be a violation of data privacy laws.\nKobach previously sued Kelly in Shawnee County District Court in an attempt to force her to turn over the data, but that effort failed. The USDA has proceeded wit",
        "authors": "None",
        "publish_date": "2026-02-04 10:08:17",
        "published_at_raw": "2026-02-04T10:08:17Z",
        "meta_site_name": "Topeka Capital-Journal",
        "description": "Attorney General Kris Kobach wants Kansas lawmakers to pass a bill requiring Gov. Laura Kelly to share food stamp data with the Trump administration.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]