[
    {
        "id": "5d81271b1471bdd0a1e2f94d2149db42",
        "title": "Corn Slips into the Weekend",
        "doc_url": "https://www.barchart.com/story/news/36261798/corn-slips-into-the-weekend",
        "all_text": "Corn futures held onto the losses across the front months on Friday, as contracts were fractionally to a penny lower. December was down 4 ¾ cents this week as the contract’s options expired today. The CmdtyView national average Cash Corn price was down a penny at $3.87 1/4.\nUSDA’s delayed Grain Crushing report showed a total of 463.44 million bushels of corn used in ethanol production during August. That was a 1.2% increase from July but down 3.36% from the year prior.\nCFTC data from the week of October 7 showed managed money with a net short position of 141,966 contracts in corn futures and options. That was an addition of 6,656 contracts as of that week.\nThe Buenos Aires Grain Exchange estimates the Argentina corn crop at 37.3% planted, a 0.7 percentage point increase on the week. That lags the same week last year. The crop is rated 79% in excellent to normal categories.\nDec 25 Corn closed at $4.25 1/2, down 1 cent,\nNearby Cash was $3.87 1/4, down 1 cent,\nMar 26 Corn closed at $4.37 1/2, down 1/4 cent,\nMay 26 Corn closed at $4.44 3/4, down 1/2 cent,",
        "authors": "None",
        "publish_date": "2025-11-21 22:42:11",
        "published_at_raw": "2025-11-21T22:42:11Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures held onto the losses across the front months on Friday, as contracts were fractionally to a penny lower. December was down 4 ¾ cents this week as the contract’s options expired today. The CmdtyView national average Cash Corn price was do...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ebe1c3b883ab761c6d0f99c05faf9319",
        "title": "Corn Holding Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/36257695/corn-holding-lower-on-friday",
        "all_text": "Corn futures are trading with fractional to penny losses across the front months on Friday’ midday. December corn options expire today. The CmdtyView national average Cash Corn price is down a penny at $3.87 1/4.\nInternational Grains Council data showed world corn production up just 1 MMT from last month in their Thursday update, with stocks up 1 MMT in no other major changes to the balance sheet.\nThe Buenos Aires Grain Exchange estimates the Argentina corn crop ay 37.3T% planted, a 0.7 percentage point increase on the week. That lags the same week last year. The crop is rated 79% in excellent to normal categories.\nDec 25 Corn is at $4.25 1/2, down 1 cent,\nNearby Cash is at $3.87 1/4, down 1 cent,\nMar 26 Corn is at $4.37, down 3/4 cent,\nMay 26 Corn is at $4.44 1/4, down 1 cent,",
        "authors": "None",
        "publish_date": "2025-11-21 18:16:27",
        "published_at_raw": "2025-11-21T18:16:27Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with fractional to penny losses across the front months on Friday’ midday. December corn options expire today. The CmdtyView national average Cash Corn price is down a penny at $3.87 1/4. International Grains Council data sh...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "deac433e63ce8e73658175d412a2f391",
        "title": "U.S. commodity markets are crashing: Why oil, gold, silver and bond markets are breaking at the same time - the real reason prices are falling now",
        "doc_url": "https://economictimes.indiatimes.com/news/international/us/u-s-commodity-markets-are-crashing-why-oil-gold-silver-and-bond-markets-are-breaking-at-the-same-time-the-real-reason-prices-are-falling-now/articleshow/125488800.cms",
        "all_text": "Synopsis\nU.S. commodity markets are sliding sharply as oil, metals and bonds weaken together. Crude oil fell to $58.28 and Brent dropped to $62.77. Gold futures slipped to $4,038.90 while spot silver fell to $49.85. Copper eased to $4.92. Corn, wheat and soybeans also declined, and coffee tumbled 4.46% to 388.35 USC. The U.S. 10-year yield dropped to 4.065%. Traders blame weak global demand, a stronger dollar, China’s slowdown and rising supply pressures for the broad commodity selloff.\nU.S. commodity markets are sliding sharply, with oil, metals, grains and bonds all weakening at the same time, and the latest data shows a broad deterioration across nearly every category. Oil prices continue to fall, with NYMEX crude at $58.28, down 1.22 percent, and Brent at $62.77, down 0.96 percent, as U.S.–China trade tensions intensify and global demand weakens.\nThe World Bank’s latest Commodity Markets Outlook shows the energy price index dropping 3.7 percent in October, with crude oil down roughly 5.1 percent, confirming a clear downtrend.\nAgricultural markets are also losing ground, with CBOT corn at 425.75 USC, wheat at 526.25 USC, and soybeans at 1,119.00 USC, all showing small but persistent declines, while coffee futures see one of the largest moves, falling 4.46 percent to 388.35 USC. Some softs such as cocoa and cotton edge higher, but global food and beverage prices remain pressured, with the World Bank showing food down 0.8 percent and beverages down 5.6 percent.\nMetals weaken",
        "authors": "None",
        "publish_date": "2025-11-21 14:34:00",
        "published_at_raw": "2025-11-21T14:34:00Z",
        "meta_site_name": "The Economic Times",
        "description": "U.S. commodity markets are sliding sharply as oil, metals and bonds weaken together. Crude oil fell to $58.28 and Brent dropped to $62.77. Gold futures slipped to $4,038.90 while spot silver fell to $49.85. Copper eased to $4.92. Corn, wheat and soybeans also declined, and coffee tumbled 4.46% to 388.35 USC. The U.S. 10-year yield dropped to 4.065%. Traders blame weak global demand, a stronger dollar, Chinas slowdown and rising supply pressures for the broad commodity selloff.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9e004cbcca7dac22b4666e4fffbc38aa",
        "title": "Corn Weakness Extending to Friday Morning",
        "doc_url": "https://www.barchart.com/story/news/36252109/corn-weakness-extending-to-friday-morning",
        "all_text": "Corn price action is showing fractional losses across the front months on Friday morning. Futures closed the Thursday session with contracts down 1 to 3 3/4 cents across the board. Strong export sales data from more than a month ago failed to get the bulls excited. Preliminary open interest was up 1,503 contracts on Thursday at 35,674 were exiting the December, and March rising 21,538. The CmdtyView national average Cash Corn price was down 3 1/4 cents at $3.88 1/4.\nExport Sales for 2025/26 corn bookings in the week of October 2 were tallied at 2.26 MMT, on the high side of analysts estimates of 1.4 to 2.5 MMT. That was the largest so far in the marketing year and 84.9% above the same week last year.\nThree separate South Korean importers purchased a total of 329,000 MT of corn in tenders overnight, with the origins not listed.\nInternational Grains Council data showed world corn production seen up just 1 MMT from last month, with stocks up 1 MMT in no other major changes to the balance sheet.\nDec 25 Corn closed at $4.26 1/2, down 3 1/4 cents, currently down 1/2 cent\nNearby Cash was $3.88 1/4, down 3 1/4 cents,\nMar 26 Corn closed at $4.37 3/4, down 3 3/4 cents, currently down 3/4 cent\nMay 26 Corn closed at $4.45 1/4, down 3 3/4 cents, currently down 3/4 cent",
        "authors": "None",
        "publish_date": "2025-11-21 13:26:41",
        "published_at_raw": "2025-11-21T13:26:41Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is showing fractional losses across the front months on Friday morning. Futures closed the Thursday session with contracts down 1 to 3 3/4 cents across the board. Strong export sales data from more than a month ago failed to get th...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3ec3b105e777933b7a155f88cfa23ce7",
        "title": "Soybean Near Unchanged at Midday",
        "doc_url": "https://www.barchart.com/story/news/36257705/soybean-near-unchanged-at-midday",
        "all_text": "Soybeans are trading with firmer action on Friday, with contracts within a penny of unchanged. The cmdtyView national average Cash Bean price is up 1/2 cent at $10.50 1/2. Soymeal futures are back down steady to 50 cents higher, with Soy Oil futures 35 to 42 points lower.\nWorld soybean production was trimmed by 2 MMT according to International Grains Council data, with consumption rising 1 MMT and ending stocks down 2 MMT to 77 MMT.\nBuenos Aires Grains Exchange data showed soybean planting progressing 12% on the week to 24.6%, which is still 11% behind the same week last year.\nJan 26 Soybeans are at $11.23, up 1/2 cent,\nNearby Cash is at $10.50 1/2, up 1/2 cent,\nMar 26 Soybeans are at $11.31 3/4, down 1/4 cent,\nMay 26 Soybeans are at $11.40 1/2, down 1 cent,",
        "authors": "None",
        "publish_date": "2025-11-21 18:16:27",
        "published_at_raw": "2025-11-21T18:16:27Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are trading with firmer action on Friday, with contracts within a penny of unchanged. The cmdtyView national average Cash Bean price is up 1/2 cent at $10.50 1/2. Soymeal futures are back down steady to 50 cents higher, with Soy Oil futures...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ca78a0ae086f96e8fb924c47ca82ff35",
        "title": "Malted Wheat Flour Market Size, Share and Trends Analysis",
        "doc_url": "https://www.globenewswire.com/news-release/2025/11/21/3192856/28124/en/Malted-Wheat-Flour-Market-Size-Share-and-Trends-Analysis-2025-2033-by-Application-End-User-and-Region-with-Growth-Forecasts.html",
        "all_text": "Dublin, Nov. 21, 2025 (GLOBE NEWSWIRE) -- The \"Malted Wheat Flour Market Size, Share and Trends Analysis Report by Application, End User, Region and Segment Forecasts 2025-2033\" has been added to ResearchAndMarkets.com's offering.\nThe Malted Wheat Flour Market is expected to reach US$ 69.17 billion by 2033 from US$ 41.22 billion in 2024, with a CAGR of 5.92% from 2025 to 2033. The market for malted wheat flour is expanding because of its capacity to enhance baking quality, growing consumer demand for natural and clean-label ingredients, growing health consciousness, and the growth of convenience foods. Trends in artisanal baking also increase its appeal globally.\nGrowth Drivers for the Malted Wheat Flour Market\nRising demand for clean-label and natural baking ingredients: The market for malted wheat flour is expected to grow significantly due to the growing demand for natural and clean-label baking ingredients. Today's consumers are more conscious of ingredient transparency and favor goods devoid of artificial chemicals, additives, and preservatives. This trend is well suited to malted wheat flour, which is made using natural germination and drying techniques to improve the quality of bread and bakery goods without the use of chemical enhancers. Its inherent enzymatic qualities enhance dough flavor, texture, and fermentation, making it a popular option for producers trying to adhere to clean-label regulations. Malted wheat flour is being used by bakers and food manufacturers ",
        "authors": "None",
        "publish_date": "2025-11-21 00:00:00",
        "published_at_raw": "2025-11-21T00:00:00Z",
        "meta_site_name": "GlobeNewswire",
        "description": "Challenges such as shelf life and high production costs persist, yet demand is bolstered by global trends towards nutritional and functional food products...",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7665aa4c340f91d9d9c8dac40d0bb3a5",
        "title": "Arkansas farmers will get state income tax exemption on USDA disaster aid, relief payments",
        "doc_url": "https://www.arkansasonline.com/news/2025/nov/21/arkansas-farmers-will-get-state-income-tax/",
        "all_text": "Your browser does not support the audio element.\nArkansas farmers and ranchers who receive federal disaster and relief aid through the U.S. Department of Agriculture will get an exemption from state taxes on these payments.\nGov. Sarah Huckabee Sanders signed into law Act 696 of 2025, under which USDA payments to farmers and ranchers under the American Relief Act of 2025 will be exempt from Arkansas state income tax.\n\"There is no denying that Arkansas' agricultural producers are enduring one of the most difficult seasons in modern memory,\" Sanders said in a news release. \"Not only do these exemptions provide immediate relief to our hardworking farmers and ranchers, but they also help bolster Arkansas' number one industry.\"\nBoth Emergency Commodity Assistance Program and Emergency Livestock Relief Program payments will qualify for state income tax exemption for the applicable tax years that agricultural producers receive these federal assistance payments, according to the news release.\nThe tax exemption will include assistance provided via the Emergency Commodity Assistance Program, which disburses economic assistance to eligible agricultural producers for the 2024 crop year.\nArkansas agricultural producers are projected to receive approximately $286.2 million via the Emergency Commodity Assistance Program.\nArkansas law additionally exempts from income tax any payments made to a cattle producer from an agricultural disaster program. The exemption applies to payments from the Em",
        "authors": "None",
        "publish_date": "2025-11-21 23:33:00",
        "published_at_raw": "2025-11-21T23:33:00Z",
        "meta_site_name": "Arkansas Online",
        "description": "Arkansas farmers and ranchers who receive federal disaster and relief aid through the U.S. Department of Agriculture will get an exemption from state taxes on these payments.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "05cc5b73f5a9d439b4589a7a821cfa4d",
        "title": "Cattle Slip Lower into Friday’s Close As Traders Square Up Ahead of USDA Data",
        "doc_url": "https://www.barchart.com/story/news/36261828/cattle-slip-lower-into-fridays-close-as-traders-square-up-ahead-of-usda-data",
        "all_text": "Live cattle futures saw Friday losses of 27 to 62 cents, with the weekly loss taken to $4.70 in December. A few cash sales in the north were reported at $215-219 this week, with most on the higher side of that range, and $222-224 in the South. Feeder cattle futures were $1.20 to $215 lower on Friday after a back and forth session, as January was down $6.32 on the week. The CME Feeder Cattle Index was up $1.44 to $339.72 on November 20.\nLate on Thursday, President Trump removed the 40% tariff on Brazilian beef imports (now at 26.4% with the active tariff rate quota), retroactive to November 13.\nThe monthly Cattle on Feed report this afternoon showed the October placement total at 2.039 million head, down 10.02% from last year. Marketings during that month were down 8.02% to 1.697 million head. That took the November 1 on feed number to 11.706 million head, a 2.17% drop from last year and near trade estimates.\nLater on Friday, Tyson announced that it is planning to close its 5,000 head per day Lexington, NE plant and shift its Amarillo, TX plant to a single full capacity shift.\nUSDA reported Wholesale Boxed Beef prices higher in the Friday PM report, with the Chc/Sel spread narrowing to $14.50. Choice boxes were up 20 cents to $371.48, while Select was $2.80 higher at $356.98. USDA federally inspected cattle slaughter for this week was estimated at 585,000 head. That 9,000 head above last week but 50,308 head below the same week last year.\nDec 25 Live Cattle closed at $214.450,",
        "authors": "None",
        "publish_date": "2025-11-21 22:42:11",
        "published_at_raw": "2025-11-21T22:42:11Z",
        "meta_site_name": "Barchart",
        "description": "Live cattle futures saw Friday losses of 27 to 62 cents, with the weekly loss taken to $4.70 in December. A few cash sales in the north were reported at $215-219 this week, with most on the higher side of that range, and $222-224 in the South. Feeder...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7d004baab6eca4cc9e9a9587d66de9ad",
        "title": "Hogs Post Losses on Friday",
        "doc_url": "https://www.barchart.com/story/news/36261838/hogs-post-losses-on-friday",
        "all_text": "Lean hog futures saw weakness on Friday, with contracts down $1.67 to $2.42. December saw back and forth trade to close with a 70 cent losses on the week. USDA’s national base hog price from the Friday PM report was down $1.23 from the day prior at $70.64. The CME Lean Hog Index was down another 56 cents on November 19 at $85.71.\nCFTC data for the week ending on 10/7 showed managed money trimming 5,048 contracts from their previous record net long position, at 141,240 as of that Tuesday.\nUSDA’s pork carcass cutout value from the Friday afternoon report was back up $3.22 to $93.43 per cwt. The rib and ham primals were the only reported lower, with the belly back up $11.04. USDA estimated federally inspected hog slaughter for the week at 2.603 million head. That is 102,000 head below last week but up 22,625 head from same week last year.\nDec 25 Hogs closed at $77.800, down $1.675,\nFeb 26 Hogs closed at $77.700, down $1.950\nApr 26 Hogs closed at $81.300, down $2.425,",
        "authors": "None",
        "publish_date": "2025-11-21 22:42:11",
        "published_at_raw": "2025-11-21T22:42:11Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw weakness on Friday, with contracts down $1.67 to $2.42. December saw back and forth trade to close with a 70 cent losses on the week. USDA’s national base hog price from the Friday PM report was down $1.23 from the day prior at $...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5008b19de7f67251dbea4df2a516e479",
        "title": "USDA Unveils Central Hub for New World Screwworm Response",
        "doc_url": "https://www.agriculture.com/usda-unveils-central-hub-for-new-world-screwworm-response-11854837",
        "all_text": "The USDA has launched a new website to centralize information about New World Screwworm (NWS). The website serves as a landing page for the latest USDA-verified information on cases and response activities. Targeted resources for a range of stakeholders – including livestock producers, veterinarians, researchers, and more – is also available.\nLivestock producers can find information about the pest’s current status, as well as fact sheets and resources for suspected cases. Detailed information about USDA’s five-pronged plan is also available.\n“To ensure timely and effective communications, this new unified website will be a one stop shop for all screwworm related information and will help our stakeholders be better informed as new information comes available,” said Secretary of Agriculture Brooke Rollins in a news release. “We are grateful for the robust interagency collaboration, and we continue to work every day with our state and industry partners to implement our screwworm plan. This is a national security priority and it has the full attention of our team.”\nThe website is another step in a whole-of-government response led by USDA, and will also host information from partner agencies such as the Centers for Disease Control and Prevention, the Department of the Interior, the Food and Drug Administration, and more.",
        "authors": "None",
        "publish_date": "2025-11-21 19:44:21",
        "published_at_raw": "2025-11-21T19:44:21Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA has launched a new website to provide the latest verified information, resources, and response updates on New World Screwworm for livestock producers and partners.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0c133e4c75a8d705d61284cf67a2bba7",
        "title": "Hogs Falling Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/36257735/hogs-falling-lower-on-friday",
        "all_text": "Lean hog futures are down $1.0 to $2.25 at midday. USDA’s national base hog price from the Friday AM report was down $1.93 from the day prior at $70.31. The CME Lean Hog Index was down another 56 cents on November 19 at $87.71.\nUSDA’s pork carcass cutout value from the Friday APM report was back up $2.59 to $92.80 per cwt. The rib and ham primals were the only reported lower, with the belly back up $9.71. USDA estimated federally inspected hog slaughter for Thursday at 494,000 head and the week to date total at 1.976 million head. That is 4,000 head above last week and up 30,598 head from same week last year.\nDec 25 Hogs are at $78.075, down $1.400,\nFeb 26 Hogs are at $77.925, down $1.725\nApr 26 Hogs is at $81.600, down $2.125,",
        "authors": "None",
        "publish_date": "2025-11-21 18:16:28",
        "published_at_raw": "2025-11-21T18:16:28Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are down $1.0 to $2.25 at midday. USDA’s national base hog price from the Friday AM report was down $1.93 from the day prior at $70.31. The CME Lean Hog Index was down another 56 cents on November 19 at $87.71. USDA’s pork carcass c...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e86a4679e2183b873e800d3320328f99",
        "title": "Hogs Look to Round Out the Week on Friday",
        "doc_url": "https://www.barchart.com/story/news/36252151/hogs-look-to-round-out-the-week-on-friday",
        "all_text": "Lean hog futures settled the Thursday session with most contracts 30 to 65 cents higher. Open interest was down just 92 contracts on Thursday, suggesting a rotation of ownership. USDA’s national base hog price from Thursday afternoon was reported at $71.87, down $2.74 from the day prior. The CME Lean Hog Index was down another 40 cents on November 18 at $86.27.\nWeekly export sales data showed 32,705 MT in the week of October 2, a drop from the previous week. Shipments were 29,209 MT in that week.\nUSDA’s pork carcass cutout value from the Thursday PM report was down $2.93 to $90.23 per cwt. The loin and ham primals were the only reported higher, with the belly dropping $16.77. USDA estimated federally inspected hog slaughter for Thursday at 494,000 head and the week to date total at 1.976 million head. That is 4,000 head above last week and up 30,598 head from same week last year.\nDec 25 Hogs closed at $79.475, up $0.625,\nFeb 26 Hogs closed at $79.650, up $0.625\nApr 26 Hogs closed at $83.725, up $0.650,",
        "authors": "None",
        "publish_date": "2025-11-21 13:26:42",
        "published_at_raw": "2025-11-21T13:26:42Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures settled the Thursday session with most contracts 30 to 65 cents higher. Open interest was down just 92 contracts on Thursday, suggesting a rotation of ownership. USDA’s national base hog price from Thursday afternoon was reported at...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5319b2cdd7bab18befb16dd726a3d368",
        "title": "Aroostook farm-to-table mission links local growers to community",
        "doc_url": "https://www.bangordailynews.com/2025/11/21/aroostook/aroostook-health/aroostook-farm-to-table-mission-joam40zk0w/",
        "all_text": "HOULTON, Maine — Local fresh food advocate Roxanne Bruce served cricket powder muffins to students in Easton on Thursday, but she’s saving her only edible scorpion for a special food challenge choice: Eat cooked carrots or eat the bug.\nBruce, who lives in Ludlow, is on a farm-to-table mission that’s taking her around Aroostook and northern Washington counties to link farmers, kids, schools and community members to fresh local foods.\nHer eventual goal is to promote healthy eating, increase food security and keep small farms alive. It’s part of a larger effort to address food insecurity in Maine, in the wake of recent funding cuts by the Trump administration that have made it harder to buy from local growers.\nNearly 25% of kids in Aroostook County are food insecure, and in Washington County 27% do not have enough to eat, according to the USDA. But Bruce and other groups aim to change that, she said.\n“Since we started Northern Maine FarmDrop in June we brought in $8,000 and in the last two weeks we sold $4,000 from individuals and schools ordering on FarmDrop,” she said. “There is no reason that the money should not be staying in Aroostook County.”\nGetting kids to eat the fresh grown foods is part of the challenge and in northern Maine, Bruce often starts with taste testing food challenges: Taste the edible bugs, like ants, crickets or mealworms or taste the vegetables.\n“About 50% try both, 25% try just the vegetable and 25% pick the bug,” she said. “At East Grand School a pre-K",
        "authors": "None",
        "publish_date": "2025-11-21 06:00:00",
        "published_at_raw": "2025-11-21T06:00:00Z",
        "meta_site_name": "Bangor Daily News",
        "description": "Nearly 25% of kids in Aroostook County are food insecure, and in Washington County 27% do not have enough to eat, according to the USDA.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]