[
    {
        "id": "1f461377937c79641a461fce9e6a7f35",
        "title": "Corn Posts Losses on Thursday",
        "doc_url": "https://www.barchart.com/story/news/36241346/corn-posts-losses-on-thursday",
        "all_text": "Corn futures closed the Thursday session with contracts down 1 to 3 3/4 cents across the board. Strong export sales data from more than a month ago failed to get the bulls excited. The CmdtyView national average Cash Corn price was down 3 1/4 cents at $3.88 1/4.\nExport Sales for 2025/26 corn bookings in the week of October 2 were tallied at 2.26 MMT, on the high side of analysts estimates of 1.4 to 2.5 MMT. That was the largest so far in the marketing year and 84.9% above the same week last year.\nThree separate South Korean importers purchased a total of 329,000 MT of corn in tenders overnight, with the origins not listed.\nInternational Grains Council data showed world corn production seen up just 1 MMT from last month, with stocks up 1 MMT in no other major changes to the balance sheet.\nDec 25 Corn closed at $4.26 1/2, down 3 1/4 cents,\nNearby Cash was $3.88 1/4, down 3 1/4 cents,\nMar 26 Corn closed at $4.37 3/4, down 3 3/4 cents,\nMay 26 Corn closed at $4.45 1/4, down 3 3/4 cents,",
        "authors": "None",
        "publish_date": "2025-11-20 22:24:00",
        "published_at_raw": "2025-11-20T22:24:00Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Thursday session with contracts down 1 to 3 3/4 cents across the board. Strong export sales data from more than a month ago failed to get the bulls excited. The CmdtyView national average Cash Corn price was down 3 1/4 cents a...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3961373b23e9748b6bd8d0e60b3cf1a8",
        "title": "Corn Pressure Continues at Midday",
        "doc_url": "https://www.barchart.com/story/news/36236692/corn-pressure-continues-at-midday",
        "all_text": "Corn futures are trading with 3 to 4 cent losses at Thursday’s midday, as the weakness continues this week ahead of next week’s holiday. The CmdtyView national average Cash Corn price is down 3 cents at $3.988 1/2.\nExport Sales for 2025/26 corn bookings in the week of October 2 were tallied at 2.26 MMT, on the high side of analysts estimates of 1.4 to 2.5 MMT. That was the largest so far in the marketing year and 84.9% above the same week last year.\nCFTC data from Wednesday afternoon showed speculators in corn futures and options adding 40,635 contracts to their net short position in the week that ended on September 30. As of that date, which was more than a month and half ago, their net short was 135,310 contracts.\nThree separate South Korean importers purchased a total of 329,000 MT of corn in tenders overnight, with the origins not listed.\nDec 25 Corn is at $4.26 3/4, down 3 cents,\nNearby Cash is at $3.88 1/2, down 3 cents,\nMar 26 Corn is at $4.38 1/4, down 3 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-11-20 18:21:17",
        "published_at_raw": "2025-11-20T18:21:17Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with 3 to 4 cent losses at Thursday’s midday, as the weakness continues this week ahead of next week’s holiday. The CmdtyView national average Cash Corn price is down 3 cents at $3.988 1/2. Export Sales for 2025/26 corn book...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d91fe709750336b860781e8907da95ad",
        "title": "Corn Starting Thursday with Fractional Gains",
        "doc_url": "https://www.barchart.com/story/news/36229458/corn-starting-thursday-with-fractional-gains",
        "all_text": "Corn price action is up ¼ to ¾ cent across most contracts to start Thursday trade. Futures closed the Wednesday session under pressure, as contracts were down 7 to 8 cents across most months. Preliminary open interest was down 8,919 contracts on Wednesday, mostly exiting the December, down 30,638 contracts. The CmdtyView national average Cash Corn price was down 6 3/4 cents at $3.91 1/4. Outside markets added pressure, with crude oil down $1.15 and the dollar index up $0.606.\nExport Sales for the week of October 2 will be released this morning, with analysts looking for 1.4 to 2.5 MMT of corn sold.\nEIA data from Wednesday showed a rebound of 16,000 barrels per day to 1.091 million bpd in the week ending on November 14. Stocks of ethanol were up 88,000 barrels to 22.307 million barrels. Exports slipped by 12,000 bpd to 145,000 bpd, with refiner inputs of ethanol down 7,000 bpd to 888,000.\nCensus data was released on Wednesday, showing August corn exports at 6.397 MMT (251.8 mbu). That was a record for the month at 25.42% above last year and a 2.76% increase from July. Distillers exports were up 7.47% from a year ago at 1.167 MMT. Ethanol exports were a record for August at 188.77 million gallons, up 23.76% from last year and 14.84% larger than in July.\nCFTC data from Wednesday afternoon showed speculators in corn futures and options adding 40,635 contracts to their net short position in the week that ended on September 30. As of that date, which was more than a month and half ",
        "authors": "None",
        "publish_date": "2025-11-20 13:27:20",
        "published_at_raw": "2025-11-20T13:27:20Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is up ¼ to ¾ cent across most contracts to start Thursday trade. Futures closed the Wednesday session under pressure, as contracts were down 7 to 8 cents across most months. Preliminary open interest was down 8,919 contracts on Wedn...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "75ce599fae69d6e238d2756c8ade7bba",
        "title": "Soybean Losses Continue on Thursday",
        "doc_url": "https://www.barchart.com/story/news/36241356/soybean-losses-continue-on-thursday",
        "all_text": "Soybeans posted losses of 9 to 13 ¾ cents on Thursday in the front months, with deferred contracts 3 to 7 ½ cents in the red. Futures continue to sell the fact as China purchases trickle in. The cmdtyView national average Cash Bean price was 13 1/2 cents lower at $10.49 1/4. Soymeal futures were back down $1.50 to $4.90, with Soy Oil futures 37 to 47 points lower.\nSoybean export bookings came in the middle of the trade range estimates of 0.6 to 1.6 MMT at 919,447 MT for the week of 10/2. That was a 3-week high but still down 8.6% from the same week last year. Soy meal sales were 328,300 MT, on the high side of between 150,000 and 350,000 MT estimates. Bean oil sales were net reductions of 11,800 MT.\nUSDA reported another 462,000 MT of soybeans sold to China via their daily announcement system on Wednesday morning. That followed the total 1.122 MMT so far this week and takes the total known sales to China to 1.812 MMT.\nWorld soybean production was trimmed by 2 MMT according to International Grains Council data, with consumption rising 1 MMT and ending stocks down 2 MMT to 77 MMT.\nJan 26 Soybeans closed at $11.22 1/2, down 13 3/4 cents,\nNearby Cash was $10.49 1/4, down 13 1/2 cents,\nMar 26 Soybeans closed at $11.32, down 12 1/2 cents,\nMay 26 Soybeans closed at $11.41 1/2, down 11 cents,",
        "authors": "None",
        "publish_date": "2025-11-20 22:24:00",
        "published_at_raw": "2025-11-20T22:24:00Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans posted losses of 9 to 13 ¾ cents on Thursday in the front months, with deferred contracts 3 to 7 ½ cents in the red. Futures continue to sell the fact as China purchases trickle in. The cmdtyView national average Cash Bean price was 13 1/2 c...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2b6da36ef1ac89a8c0428dafd6ab3f76",
        "title": "Soybeans Fading Lower at Midday",
        "doc_url": "https://www.barchart.com/story/news/36236702/soybeans-fading-lower-at-midday",
        "all_text": "Soybeans are down 6 to 9 ½ cents across most contracts at midday. The cmdtyView national average Cash Bean price is 9 1/2 cents lower at $10.53 1/4. Soymeal futures were back down $5.40, with Soy Oil futures 32 points lower.\nSoybean export bookings came in the middle of the trade range estimates of 0.6 to 1.6 MMT at 919,447 MT for the week of 10/2. That was a 3-week high but still down 8.6% from the same week last year. Soy meal sales were 328,300 MT, on the high side of between 150,000 and 350,000 MT estimates. Bean oil sales were net reductions of 11,800 MT.\nUSDA reported another 462,000 MT of soybeans sold to China via their daily announcement system on Wednesday morning. That followed the total 1.122 MMT so far this week and takes the total known sales to China to 1.812 MMT.\nCommitment of Traders data from the week of September 30 showed managed money increasing their net short in soybean futures and options by 9,410 contracts. That brough their net short to 38,712 contracts at the end of September.\nJan 26 Soybeans are at $11.26 3/4, down 9 1/2 cents,\nNearby Cash is at $10.53 1/4, down 9 1/2 cents,\nMar 26 Soybeans are at $11.36 1/4, down 8 1/4 cents,\nMay 26 Soybeans are at $11.45, down 7 1/2 cents,",
        "authors": "None",
        "publish_date": "2025-11-20 18:21:17",
        "published_at_raw": "2025-11-20T18:21:17Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are down 6 to 9 ½ cents across most contracts at midday. The cmdtyView national average Cash Bean price is 9 1/2 cents lower at $10.53 1/4. Soymeal futures were back down $5.40, with Soy Oil futures 32 points lower. Soybean export bookings...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "623e02bd9b37e0adddaa7c33c6e80898",
        "title": "Should U.S. Growers Look to Africa as the Next Big Market? Understanding Africa’s Soy Import Demand",
        "doc_url": "https://www.agriculture.com/partners-should-u-s-growers-look-to-africa-as-the-next-big-market-understanding-africa-s-soy-import-demand-11853436",
        "all_text": "By Peter Goldsmith, Guy Allen, and Mike Doherty\nIntroduction\nThe Soybean Innovation Lab (SIL) introduces readers to the question whether Sub Saharan Africa (SSA) presents a new market opportunity for U.S. soybean growers. Over the next three weeks SIL and farmdoc will deliver three articles on the topic of Africa as a potential export market for U.S. soybeans. The African market presents a very complex landscape. While it is large, diverse, and growing rapidly, there exists great uncertainty, significant business risks, and demand for soybean and associated products are just beginning to emerge.\nThis first article in the series focused on the larger food and oil trends dominating the African continent (see farmdoc daily from Nov. 13, 2025). Today’s article delves into the import flows of soybean, oil, and meal into Africa. The third article will wrap up the series by outlining four specific country examples — Egypt, Ghana, Nigeria, and Tanzania — touching on their imports of soy and soy products, logistics infrastructure, and existing policies on genetically modified soybean imports. The third and final article will also include a relevant literature review on the subject of soy trade and Africa.\nSoy Import Demand in SSA\nIs SSA soy import demand significant, or at least potentially significant? The answer is yes. Soy product demand is potentially very significant. Using the soybean equivalent import metric, Africa imported a soybean equivalent of 2.1 billion bushels on averag",
        "authors": "None",
        "publish_date": "2025-11-20 12:58:47",
        "published_at_raw": "2025-11-20T12:58:47Z",
        "meta_site_name": "Successful Farming",
        "description": "Over the next three weeks the Soybean Innovation Lab and Farmdoc will deliver three articles on the topic of Africa as a potential export market for U.S. soybeans. Today’s article delves into the import flows of soybean, oil, and meal into Africa.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "44dd9f1271e49b53ab7ff92d48fa96c4",
        "title": "Climate Matters: Climate change drives up food prices, impacting holiday meals",
        "doc_url": "https://abc17news.com/weather/insider-blog/2025/11/20/climate-matters-climate-change-drives-up-food-prices-impacting-holiday-meals/",
        "all_text": "You may not be thankful for some food prices this holiday season, as climate change is disrupting the supply and quality of food.\nThe big bird on everyone's mind is the turkey, which is up 40% according to the USDA, thanks to all those bird flu headlines you saw earlier in the year. Climate change is also expected to drive up food inflation in the coming decades as drought, heat waves, and heavy rain all make it harder to grow food.\nAgriculture and climate change are closely connected. Growing food accounts for 10% of greenhouse gas emissions in the US and a quarter of heat-trapping emissions worldwide.\nAs the climate responds, extreme weather events like droughts and heavy rains are affecting the food supply chain and driving up prices. And we can see that trend.\nResearch indicates that nearly 20% of insured crop losses between 1991 and 2017 were due to a warming climate. These losses travel from farms to grocery stores and ultimately to your wallet.\nScientists also find that rising temperatures are expected to raise food inflation in the United States by 1.4% to 1.8% annually by 2035. Rising temperatures, longer droughts, heavy rain, and stronger hurricanes can all impact the supply, quality, and distribution of food.\nFood inflation caused by climate change could speed up by the middle of the century, rising by 1.9% to 3.9% each year by 2060.",
        "authors": "None",
        "publish_date": "2025-11-20 23:25:07",
        "published_at_raw": "2025-11-20T23:25:07Z",
        "meta_site_name": "ABC17News.com",
        "description": "You may not be thankful for some food prices this holiday season, as climate change is disrupting the supply and quality of food. The big bird on everyone's mind is the turkey, which is up 40% according to the USDA, thanks to all those bird flu headlines you saw earlier in the year. Climate change is also",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6b8a15a335d7f3eee1bde9e5f60eab67",
        "title": "Hogs Pop Higher on Thursday",
        "doc_url": "https://www.barchart.com/story/news/36241391/hogs-pop-higher-on-thursday",
        "all_text": "Lean hog futures settled the Thursday session with most contracts 30 to 65 cents higher. USDA’s national base hog price from Thursday afternoon was reported at $71.87, down $2.74 from the day prior. The CME Lean Hog Index was down another 40 cents on November 18 at $86.27.\nWeekly export sales data showed 32,705 MT in the week of October 2, a drop from the previous week. Shipments were 29,209 MT in that week.\nUSDA’s pork carcass cutout value from the Thursday PM report was down $2.93 to $90.23 per cwt. The loin and ham primals were the only reported higher, with the belly dropping $16.77. USDA estimated federally inspected hog slaughter for Thursday at 494,000 head and the week to date total at 1.976 million head. That is 4,000 head above last week and up 30,598 head from same week last year.\nDec 25 Hogs closed at $79.475, up $0.625,\nFeb 26 Hogs closed at $79.650, up $0.625\nApr 26 Hogs closed at $83.725, up $0.650,",
        "authors": "None",
        "publish_date": "2025-11-20 22:24:00",
        "published_at_raw": "2025-11-20T22:24:00Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures settled the Thursday session with most contracts 30 to 65 cents higher. USDA’s national base hog price from Thursday afternoon was reported at $71.87, down $2.74 from the day prior. The CME Lean Hog Index was down another 40 cents on...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3d422a6f4e511fd6d2f0784aef10204a",
        "title": "SNAP users may have to reapply for benefits, USDA says. Here’s how it could affect Texans",
        "doc_url": "https://www.dallasnews.com/news/healthy-living/2025/11/20/snaps-food-insecurity-texas/",
        "all_text": "The Supplemental Nutrition Assistance Program will require all participants to reapply for benefits under an upcoming overhaul, Agriculture Secretary Brooke Rollins told multiple news outlets following last week’s federal reopening.\nThe recent 43-day government shutdown, which ended Nov. 12, placed SNAP at the center of several legal disputes and led to the first pause in benefits on Nov. 1.\nRollins said in a Newsmax interview on Nov. 13 that the overhaul is aimed at reducing what she described as fraud.\nShe cited preliminary figures from 29 states claiming more than 186,000 deceased individuals were “receiving a check.” SNAP benefits, however, are issued through electronic benefit transfer cards, not mailed checks, according to the Texas Health and Human Services.\nIn an April 7 analysis, the Congressional Research Service reported that SNAP fraud is considered rare and noted that many over payments result from unintentional reporting errors rather than deliberate misuse.\nHow this could affect Texans\nAbout 3.5 million Texans rely on SNAP, according to the HHSC. The expected change could affect households that depend on monthly food assistance.\nUnder the proposed shift, families may be required to submit full income, identity and household documentation rather than a standard renewal form. Processing times could increase as the state handles complete applications rather than renewals.\n“HHSC is awaiting federal guidance,” an agency spokesperson told The Dallas Morning News in a",
        "authors": "None",
        "publish_date": "2025-11-20 20:28:51",
        "published_at_raw": "2025-11-20T20:28:51Z",
        "meta_site_name": "The Dallas Morning News",
        "description": "Texas SNAP recipients may need to reapply under new federal rules. Here is what we know",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "211cc50efe22312a3db042e527598b90",
        "title": "US farmers bag $16 billion rescue deal as wildfires and floods trigger emergency aid - here's how to enrol",
        "doc_url": "https://economictimes.indiatimes.com/news/international/us/us-farmers-bag-16-billion-rescue-deal-as-wildfires-and-floods-trigger-emergency-aid-heres-how-to-enrol/articleshow/125471725.cms",
        "all_text": "Synopsis\nUSDA $16 billion aid: American farmers facing increasing natural disaster threats will receive a significant financial boost. The USDA announced a $16 billion Supplemental Disaster Relief Program (SDRP) to aid producers in recovering from losses due to extreme weather. This funding targets previously uncovered \"shallow losses\" and includes support for dairy and stored commodity losses.\nUSDA $16 billion aid: American farmers facing the growing threat of natural disasters are set to receive a major financial boost. The US Department of Agriculture (USDA) has announced a new $16 billion funding package under the Supplemental Disaster Relief Program (SDRP), aimed at helping producers recover from losses caused by wildfires, floods, droughts, and other extreme weather events, as per a report.\nHow Extreme Weather Poses a Growing Threat to American Agriculture\nThe funding comes amid rising pressures on American agriculture, including historic droughts, hurricanes, tornadoes, winter storms, excessive heat, freezes, smoke exposure, and heavy rainfall, as per a Newsweek report. These challenges have put farm operations, rural communities, and the nation’s food supply under increasing strain, as per the report.\nALSO READ: Millions switching jobs — here’s the trick to make sure your retirement money follows you\nUSDA Announces $16 Billion Disaster Relief for US Farmers\nStage two of the $16 billion SDRP, launched under the Trump administration, specifically targets previously unco",
        "authors": "None",
        "publish_date": "2025-11-20 20:23:00",
        "published_at_raw": "2025-11-20T20:23:00Z",
        "meta_site_name": "The Economic Times",
        "description": "USDA $16 billion aid: The USDA has introduced a $16 billion aid package under the Supplemental Disaster Relief Program to support US farmers affected by extreme weather events like wildfires, floods, and droughts. This funding aims to help restore agricultural productivity and ensure food supply stability.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bc9d61682c1c005f62bf9808f429cc0a",
        "title": "Hogs Posting Gains at Midday",
        "doc_url": "https://www.barchart.com/story/news/36236732/hogs-posting-gains-at-midday",
        "all_text": "Lean hog futures are up 60 to 70 cents across most contracts on Thursday. USDA’s national base hog price from Thursday morning was reported at $72.24. The CME Lean Hog Index was down another 40 cents on November 18 at $86.27.\nWeekly export sales data showed 32,705 MT in the week of October 2, a drop from the previous week. Shipments were 29,209 MT in that week.\nLarge managed money speculators were holding a record net long position as of September 30 at 146,288 contracts according to government shutdown delayed CFTC data.\nUSDA’s pork carcass cutout value from the Thursday AM report was up 34 cents to $93.48 per cwt. The picnic and rib primals were the only reported lower. USDA estimated federally inspected hog slaughter for Wednesday at 494,000 head and the week to date total at 1.482 million head. That is 34,000 head above last week and up 13,911 head from same week last year.\nDec 25 Hogs are at $79.450, up $0.600,\nFeb 26 Hogs are at $79.650, up $0.625\nApr 26 Hogs is at $83.775, up $0.700,",
        "authors": "None",
        "publish_date": "2025-11-20 18:21:17",
        "published_at_raw": "2025-11-20T18:21:17Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are up 60 to 70 cents across most contracts on Thursday. USDA’s national base hog price from Thursday morning was reported at $72.24. The CME Lean Hog Index was down another 40 cents on November 18 at $86.27. Weekly export sales data...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "42fe3390ed822f9744868a43c4f5eca0",
        "title": "Wheat Weakness Resumes on Thursday",
        "doc_url": "https://www.barchart.com/story/news/36236712/wheat-weakness-resumes-on-thursday",
        "all_text": "The wheat complex is continuing weakness on Thursday. Chicago SRW futures are 5 to 6 cents lower Thursday. KC HRW futures are slipping 6 to 7 cents lower so far at midday. MPLS spring wheat futures are 5 to 7 ¾ cents in the red on the day.\nUSDA reported a private export sale of 132,000 MT of white wheat to China this morning.\nExport Sales from this morning for the week of 10/2 showed 887,864 MT in wheat sales, exceeding analysts’ estimates of 350,000 and 600,000 MT. That was a marketing year high for wheat.\nRain is expected to fall across much of Southern Plains over the next week, extending over to parts of SRW country. Totals are heaviest in TX, OK, and AR, with 4 to 6 inches expected and other totals over an inch.\nDelayed Commitment of Traders data showed specs adding 1,474 contracts to their net short in CBT wheat by September 30 to 99,209 contracts. In KC wheat, they were adding 3,569 contracts to 53,873 contracts net short.\nSaudi Arabia issued a tender to buy 300,000 MT of wheat with offers due on Friday. SovEcon estimates the 2026 Russian wheat crop at 83.8 MMT, down from their 2025 crop estimate at 88.6 MMT.\nDec 25 CBOT Wheat is at $5.31 1/4, down 5 1/2 cents,\nMar 26 CBOT Wheat is at $5.43 3/4, down 5 3/4 cents,\nDec 25 KCBT Wheat is at $5.08 3/4, down 6 3/4 cents,\nMar 26 KCBT Wheat is at $5.25 1/2, down 6 1/4 cents,\nDec 25 MGEX Wheat is at $5.73 1/2, down 7 3/4 cents,\nMar 26 MGEX Wheat is at $5.80 3/4, down 5 cents,",
        "authors": "None",
        "publish_date": "2025-11-20 18:21:17",
        "published_at_raw": "2025-11-20T18:21:17Z",
        "meta_site_name": "Barchart",
        "description": "The wheat complex is continuing weakness on Thursday. Chicago SRW futures are 5 to 6 cents lower Thursday. KC HRW futures are slipping 6 to 7 cents lower so far at midday. MPLS spring wheat futures are 5 to 7 ¾ cents in the red on the day. USDA repor...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5b46575027490904e75dbb4fde1bc356",
        "title": "Trump admin backs off idea to force SNAP users to reapply",
        "doc_url": "https://www.politico.com/news/2025/11/20/trump-rollins-snap-benefits-reapplication-00661001",
        "all_text": "“Rates of fraud were only previously assumed, and President [Donald] Trump is doing something about it. Using standard recertification processes for households is a part of that work,” a USDA spokesperson said in a statement. “As well as ongoing analysis of State data, further regulatory work, and improved collaboration with States.”\nRollins’ previous comments created another layer of uncertainty for local officials who were attempting to return their program operations to normal after the 43-day government shutdown. Neither she nor USDA at the time clarified the timeline for reapplication and how it would differ from current state requirements.\nThe closure, which halted SNAP funding for the first time in the program’s history, prompted conservative commentators and administration officials to complain about how much the government spends on the food aid program — and claim that it’s serving people who don’t actually need the help.\n“An unintended consequence of the Democrats shutting the government down for 43 days is it shined this very bright light on one of their pet programs and now has given us a platform to completely deconstruct the program,” Rollins said in a Fox Business interview Tuesday.\nRepublicans passed a major SNAP overhaul in July that slashes the program’s spending by billions of dollars over the next decade, imposes new work requirements for participants and forces states to start paying for some food aid benefits. The Trump administration is still fighting ",
        "authors": "None",
        "publish_date": "2025-11-20 17:00:00",
        "published_at_raw": "2025-11-20T17:00:00Z",
        "meta_site_name": "POLITICO",
        "description": "Officials will rely on state standards that are already in place to ensure eligibility, despite USDA chief Brooke Rollins’ comments last week.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "949695ee1cfb0d3bd6cc5d22718c3d72",
        "title": "Corn and Soy Lower This Morning | Thursday, Nov. 20, 2025",
        "doc_url": "https://www.agriculture.com/corn-and-soy-lower-this-morning-or-thursday-nov-20-2025-11853616",
        "all_text": "Not long past 9:30 a.m. CT, March corn was down 2¾¢ at $4.38¾ per bushel.\nJanuary soybeans were down 3¾¢ at $11.32½ per bushel.\nMarch CBOT wheat was down 4¾¢ at $5.44¾ per bushel. March KC wheat was down 5¢ at $5.26¾ per bushel. March Minneapolis wheat was down 2¾¢ at $5.83.\n“Buy the rumor; sell the fact,” said Naomi Blohm, senior market advisor with Total Farm Marketing. “Soybean prices fell lower yesterday in spite of two days of export sales announcements to China. The news and expectations had already been priced into the market last week.”\nThis morning, USDA made it three days of announcements, reporting these sales to China:\n132,000 metric tons of white wheat for the 2025/2026 marketing year\n462,000 metric tons of soybeans for the 2025/2026 marketing year.\nNot long past 9:30 a.m. CT, January feeder cattle were down $4.80 at $316.65 per hundredweight (cwt). February live cattle were down $2.28 at $214.98 per cwt. February lean hogs were up 93¢ at $79.95 per cwt.\nJanuary crude oil was up 72¢ at $59.97 per barrel.\nThe U.S. Dollar Index December contract was up to 100.17.",
        "authors": "None",
        "publish_date": "2025-11-20 16:03:57",
        "published_at_raw": "2025-11-20T16:03:57Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA announced export sales to China for the third day in a row.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ad9db0e65edf4e20f1c230be0efafbc5",
        "title": "USDA Confirms More Soybean Exports to China and First Wheat Sale",
        "doc_url": "https://www.bloomberg.com/news/articles/2025-11-20/usda-confirms-more-soybean-exports-to-china-and-first-wheat-sale",
        "all_text": "The US Department of Agriculture announced more sales of American soybeans to China along with the first known sales of wheat to the Asian nation.\nThe USDA in its daily export sales reporting system Thursday saidBloomberg Terminal China booked 462,000 tons of US soybeans and 132,000 tons of white wheat. That brings the volume of soybeans sold to China since Oct. 30 to 1.8 million. Traders now are watching for further signs of buying, with officials in Washington estimating Beijing’s pledge at 12 million tons of US soybeans by the end of this year.",
        "authors": "None",
        "publish_date": "2025-11-20 15:26:08",
        "published_at_raw": "2025-11-20T15:26:08Z",
        "meta_site_name": "Bloomberg",
        "description": "The US Department of Agriculture announced more sales of American soybeans to China along with the first known sales of wheat to the Asian nation.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e0280c98c3d1ae6d807e31673455e00e",
        "title": "Hog Bulls Looking to Extend Wednesday Gains",
        "doc_url": "https://www.barchart.com/story/news/36229498/hog-bulls-looking-to-extend-wednesday-gains",
        "all_text": "Lean hog futures saw a rebound on Wednesday, up 95 cents to $1.45 at the close. Open interest was down 1,227 contracts on Wednesday. USDA’s national base hog price from Wednesday afternoon was reported at $74.61, down 95 cents from the day prior. The CME Lean Hog Index was down another 33 cents on November 17 at $86.67.\nPork exports during August were tallied at 542.8 million lbs according to a delayed release of Census trade data on Wednesday morning. That was the second largest August total on record, 3.1% below last year.\nLarge managed money speculators were holding a record net long position as of September 30 at 146,288 contracts according to government shutdown delayed CFTC data.\nUSDA’s pork carcass cutout value from the Wednesday PM report was down $2.25 to $93.14 per cwt. The rib primal was the only primal reported higher, with the belly leading the downward charge, losing $8.43. USDA estimated federally inspected hog slaughter for Wednesday at 494,000 head and the week to date total at 1.482 million head. That is 34,000 head above last week and up 13,911 head from same week last year.\nDec 25 Hogs closed at $78.850, up $0.950,\nFeb 26 Hogs closed at $79.025, up $1.000\nApr 26 Hogs closed at $83.075, up $1.450,",
        "authors": "None",
        "publish_date": "2025-11-20 13:27:21",
        "published_at_raw": "2025-11-20T13:27:21Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw a rebound on Wednesday, up 95 cents to $1.45 at the close. Open interest was down 1,227 contracts on Wednesday. USDA’s national base hog price from Wednesday afternoon was reported at $74.61, down 95 cents from the day prior. The...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "20a3a7ed514ee1fecec989fc769fba62",
        "title": "USDA's Rollins: SNAP Faces 'Right-Sizing' Changes",
        "doc_url": "https://www.newsmax.com/newsfront/snap-benefits-brooke-rollins-usda/2025/11/19/id/1235276/",
        "all_text": "Agriculture Secretary Brooke Rollins said Wednesday that the Supplemental Nutrition Assistance Program will undergo major changes, even though regular funding has resumed now that the government shutdown is over.\nOn \"NewsNation Now,\" Rollins said, \"Clearly there's a right-sizing that needs to happen with the program.\"\nAfter the 43-day shutdown ended, Rollins announced that SNAP beneficiaries must reapply in order to eliminate suspected fraud, adding that other changes to the benefits program will be announced after Thanksgiving.\n\"We have to make sure that for those who really need this benefit, it's going to the right people,\" she said. \"So, we're making a lot of structural changes in SNAP.\"\nRollins said that before the shutdown, USDA data from 29 Republican-led states showed that 186,000 deceased enrollees were still receiving SNAP benefits and 500,000 people were receiving benefits twice.\n\"And that just includes the states that have sent their data in,\" Rollins said. \"That doesn't include most of the blue states, where we believe there's even more fraud and abuse.\"\nShe added that SNAP benefits increased by 40% under the Biden administration. \"The unintended consequence of the Democrat shutdown is that the spotlight has been shined on this,\" she said, \"and we have to make sure that for those who really need this benefit, it's going to the right people.\"\nIn fiscal 2024, SNAP served an average of 41.7 million people each month, with federal spending totaling $99.8 billion, abo",
        "authors": "None",
        "publish_date": "2025-11-20 00:03:29",
        "published_at_raw": "2025-11-20T00:03:29Z",
        "meta_site_name": "Newsmax",
        "description": "Agriculture Secretary Brooke Rollins says the Supplemental Nutrition Assistance Program will undergo major changes, even though regular funding has resumed now that the government shutdown is over.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]