[
    {
        "id": "2a773ca087fecbb3bc4c4fe4c39c87fb",
        "title": "Corn Closes Tuesday with Most Contracts Higher",
        "doc_url": "https://www.barchart.com/story/news/36316068/corn-closes-tuesday-with-most-contracts-higher",
        "all_text": "Corn futures closed Tuesday with contracts seeing some spreading and adding carry back into the market as December was up ¼ cent and deferreds up 2 ½ cents. The CmdtyView national average Cash Corn price was up 1/4 cent at $3.88. The market will be closed on Thursday for Thanksgiving, with a hard open at 8:30 CST on Friday.\nExport Sales data from this morning showed a total of 1.327 MMT of corn sold in the week of 10/9, in the middle of traders looking for 0.9-2.5 MMT in the delayed dataset. That was a 4-week low and below the same week last year. Data for the week of 10/16 will be out on Friday.\nDelayed CFTC data from the week of October 14 showed managed money with a net short position of 191,055 contracts in corn futures and options. That was an addition of 49,089 contracts as of that week.\nSeveral South Korean importers purchased a total of at least 324,000 MT of corn in tenders overnight, with at least 68,000 MT expected from the US. Brazilian corn exports in November are expected to total 6.11 MMT according to ANEC, down 0.25 MMT from the week prior.\nDec 25 Corn closed at $4.23 1/2, down 1/4 cent,\nNearby Cash was $3.88, up 1/4 cent,\nMar 26 Corn closed at $4.38 1/4, up 1 1/2 cents,\nMay 26 Corn closed at $4.46 3/4, up 2 1/2 cents,",
        "authors": "None",
        "publish_date": "2025-11-25 23:23:37",
        "published_at_raw": "2025-11-25T23:23:37Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed Tuesday with contracts seeing some spreading and adding carry back into the market as December was up ¼ cent and deferreds up 2 ½ cents. The CmdtyView national average Cash Corn price was up 1/4 cent at $3.88. The market will be c...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "83dfc5429506d75c2fb8bff55665d679",
        "title": "How Can Farmers Turn Corn and Soybean Volatility Into Opportunity?",
        "doc_url": "https://www.agriculture.com/how-can-farmers-turn-corn-and-soybean-volatility-into-opportunity-11856868",
        "all_text": "What’s Happened\nIn early October, January 2026 soybean futures were trading near $10.20 with little hope of a potential rally. However, by mid-November, the market rallied an astounding $1.50 thanks to word of cooperative U.S. and Chinese trade deals along with strong domestic demand.\nMeanwhile, corn futures have been trading in a quiet 20–25¢ trading range since October due to a plentiful U.S. corn supply meeting impressive demand.\nWhile time will ultimately tell which way prices will trend in the New Year, price volatility and potential dramatic price swings seem likely as traders sort through important corn and soybean price fundamentals.\nFrom a Marketing Perspective\nSoybean Futures: When looking at potential price moves for soybean futures, the upcoming December and January WASDE reports will be of utmost importance.\nIn the November WASDE, soybean yield was lowered to 53 from 53.5 bushels per acre, mostly in line with pre-report expectations. In that report, the USDA acknowledged the slow export pace of soybeans, specifically to China, and lowered demand for US soybean exports for 2025/2026 to 1.635 billion bushels. That is down nearly 13% from the previous year.\nGoing forward — and imperative for future price direction for soybeans — traders will have one eye on U.S. export demand and one eye on South America's crop-growing weather.\nWhile the current administration has touted that China will purchase large quantities of U.S. soybeans, China has only purchased an estimate",
        "authors": "None",
        "publish_date": "2025-11-25 18:23:35",
        "published_at_raw": "2025-11-25T18:23:35Z",
        "meta_site_name": "Successful Farming",
        "description": "Analyst Naomi Blohm outlines potential corn and soybean price swings in 2026 and shares how farmers can manage volatility and protect profits with smart marketing strategies.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "61f808adb80cedbdf4be59fdada14441",
        "title": "China’s soy glut spurs surge in cooking oil exports to India",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/chinas-soy-glut-spurs-surge-in-cooking-oil-exports-to-india/article70323243.ece",
        "all_text": "China’s exports of soybean oil to India are surging as weak domestic demand for the cooking ingredient coincides with robust imports of soybeans from South America and, more recently, the US.\nAsia’s largest economy shipped a record 70,877 tons of the cooking oil in October, according to customs data, most of which went to India. Exports in the first 10 months of the year have reached 329,000 tons, almost triple what they were for the whole of 2024.\nBeijing has long viewed its dependence on foreign soybeans, which are processed into animal feed and cooking oil, as a vulnerability in a world where geopolitics and viruses can quickly disrupt commodity flows. However, robust imports from South America are hitting a fairly tepid local economy, forcing Chinese soyoil processors to seek new markets.\nIt’s another example of flagging consumption in China resulting in a surplus, with the excess flooding into global markets. In this case it’s a development that’s welcome in India, the world’s biggest importer of soybean oil. This newly forged trade route is likely to become busier, as China returns to buying US soybeans after last month’s trade truce, and relations between Beijing and New Delhi improve.\nThe trade makes logistical sense for India, said Aashish Acharya, a vice president at Patanjali Foods Ltd., one of the country’s top vegetable-oil buyers. “Quality is comparable with South American supplies, prices are competitive and Chinese exporters are seeking reliable buyers.”\nChine",
        "authors": "None",
        "publish_date": "2025-11-25 17:02:31",
        "published_at_raw": "2025-11-25T17:02:31Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "China's soybean oil exports to India surge due to weak domestic demand and strong imports, creating new trade opportunities.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c6550d2139a0a0ff5926b699cbc186d6",
        "title": "Soy retreats in Chicago amid uncertainty over Chinese demand",
        "doc_url": "https://www.marketscreener.com/news/soy-retreats-in-chicago-amid-uncertainty-over-chinese-demand-ce7d5eddda8bfe2d",
        "all_text": "Soybean prices fell on the Chicago futures market on Monday, erasing part of the gains made the previous week. Traders remain cautious in the absence of clear signals of fresh Chinese orders, despite the announcement of a sale of 123,000 tonnes to China for the 2025/26 marketing year. Last week, Beijing bought 1.584 million tonnes, but the market is waiting for follow-through after a reported Chinese commitment to buy up to 12 million tonnes by the end of 2025. A phone call between the US and Chinese presidents, the details of which remain unclear, adds to the uncertainty.\nCaution is dominating trade, with investors hesitant to commit without clarification on the state of US-China commercial dialogue. Corn traded in a scattered manner, influenced by technical factors and by the weakness in soybeans. In contrast, wheat prices continued to fall, pressured by low Russian prices and fierce international competition. A tender in Saudi Arabia confirmed the competitiveness of Black Sea and Argentine suppliers, where a record harvest is expected.\nBy midday, soybeans were down 1.5 cent at $11.23 a bushel, corn was up 0.25 cent at $4.37, while wheat was down 5 cents at $5.34. US exports are also suffering from the decline in Brazilian premiums, which is making South American soybeans more competitive. According to some analysts, the market now doubts US ability to increase sales before the end of the year, both to China and to other export destinations.",
        "authors": "None",
        "publish_date": "2025-11-25 07:04:05",
        "published_at_raw": "2025-11-25T07:04:05Z",
        "meta_site_name": "MarketScreener",
        "description": "Soybean prices fell on the Chicago futures market on Monday, erasing part of the gains made the previous week. Traders remain cautious in the absence of clear signals of fresh Chinese orders, despite...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6a55a9869f1f39e954f0fc9fbaba672b",
        "title": "Sindh's Farmers Caught in Policy Limbo: The Sugarcane Price Standoff",
        "doc_url": "https://www.devdiscourse.com/article/international/3709165-sindhs-farmers-caught-in-policy-limbo-the-sugarcane-price-standoff",
        "all_text": "Farmers in Sindh are expressing mounting frustration over the provincial government's failure to set sugarcane prices for the 2025-26 season on schedule. The indecision, reportedly influenced by International Monetary Fund (IMF) loan conditions, has left growers in a bind, with many blaming policy paralysis for the ongoing standstill.\nDespite the Sindh Agriculture Department's official notice to begin the crushing season on November 15, several sugar mills remained inactive until November 21. This inactivity has added to the uncertainty faced by growers, who still await clarity on purchasing rates from the mills. The situation exacerbates farmers' financial strain as they also await the announcement of wheat support prices.\nMeanwhile, nearly 790,000 acres of land dedicated to sugarcane, which overlap with wheat zones, face potential disruption due to delayed cane harvesting impacting wheat sowing times. The Sindh Chamber of Agriculture's Vice President questioned IMF's restrictions on sugarcane price setting, further underscoring the situation's complexity as the provincial cabinet belatedly approved the November 15 crushing date.\n(With inputs from agencies.)",
        "authors": "None",
        "publish_date": "2025-11-25 09:53:39",
        "published_at_raw": "2025-11-25T09:53:39Z",
        "meta_site_name": "Devdiscourse",
        "description": "Farmers in Sindh face frustration as provincial indecision over sugarcane pricing persists, influenced by IMF loan conditions. The delay impacts timely wheat sowing, with mill inactivity compounding the issue. Calls are intensifying for clear pricing announcements amid sector-wide financial strain.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f7408445420d7dad3492e687a289e321",
        "title": "Hogs Close Mixed on Tuesday",
        "doc_url": "https://www.barchart.com/story/news/36316108/hogs-close-mixed-on-tuesday",
        "all_text": "Lean hog futures posted mixed action on Tuesday, with contracts down 20 to 45 cents higher. USDA’s national base hog price was reported at $73.25 in the Tuesday PM print. The CME Lean Hog Index was down another $1.20 on November 21 at $83.61.\nExport Sales data for pork in the week ending on October 9 saw 288,676 MT of bookings. That was a 4-week low. Export Shipments were 28,506 MT, back down from the week prior.\nCFTC data for the week ending on 10/14 showed managed money cutting 12,312 contracts from their net long position, at 28,928 as of that Tuesday.\nUSDA’s pork carcass cutout value from the Tuesday afternoon report was back down $1.53 to $93.25 per cwt. The ham primal was the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 492,000 head, taking the weekly total to 987,000 head. That is 1,000 head below last week and up 2,192 head from same week last year.\nDec 25 Hogs closed at $78.450, up $0.250,\nFeb 26 Hogs closed at $79.000, down $0.175\nApr 26 Hogs closed at $82.950, up $0.425,",
        "authors": "None",
        "publish_date": "2025-11-25 23:23:37",
        "published_at_raw": "2025-11-25T23:23:37Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted mixed action on Tuesday, with contracts down 20 to 45 cents higher. USDA’s national base hog price was reported at $73.25 in the Tuesday PM print. The CME Lean Hog Index was down another $1.20 on November 21 at $83.61. Export...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3206657bd1779cfcf8d51dce83942c55",
        "title": "USDA opening NRCS Central Region hub in Lincoln, Nebraska",
        "doc_url": "https://journalstar.com/news/state-regional/government-politics/article_02974efd-c988-480a-b3a8-79dd793e6926.html",
        "all_text": "Reach the writer at 402-473-7120 or cdunker@journalstar.com.\nOn Bluesky @chrisdunker.bsky.social\nLove\n0\nFunny\n0\nWow\n0\nSad\n0\nAngry\n0\nGet Government & Politics updates in your inbox!\nStay up-to-date on the latest in local and national government and political topics with our newsletter.\n* I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy.\nChris Dunker\nHigher education/statehouse reporter\nGet email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}\nEmail notifications are only sent once a day, and only if there are new matching items.\nFollowed notifications\nPlease log in to use this feature\nLog In\nDon't have an account? Sign Up Today",
        "authors": "None",
        "publish_date": "2025-11-25 22:30:00",
        "published_at_raw": "2025-11-25T22:30:00Z",
        "meta_site_name": "Lincoln Journal Star",
        "description": "Lincoln will be home to the NRCS’ new hub for the Central Region, which also includes Arkansas, Iowa, Kansas, Louisiana, Minnesota, Missouri, North Dakota, Oklahoma, South Dakota and Texas.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c98080d4ac9a58b3da6f51ba90af3e2d",
        "title": "USDA’s Top Economist to Leave For Missouri Policy Institute",
        "doc_url": "https://www.bloomberg.com/news/articles/2025-11-25/usda-s-top-economist-to-leave-for-missouri-policy-institute",
        "all_text": "The US Agriculture Department’s top economist is departing from the agency to lead the University of Missouri’s food and agricultural policy institute.\nSeth Meyer has been the USDA’s chief economist since 2021, helming an office whose responsibilities include the market-moving monthly World Agricultural Supply and Demand Estimates report. Meyer will be leading the Food and Agricultural Policy Research Institute starting Jan. 1, succeeding Pat Westhoff , who is retiring in March, the University of Missouri said in a Tuesday release.",
        "authors": "None",
        "publish_date": "2025-11-25 21:39:14",
        "published_at_raw": "2025-11-25T21:39:14Z",
        "meta_site_name": "Bloomberg",
        "description": "The US Agriculture Department’s top economist is departing from the agency to lead the University of Missouri’s food and agricultural policy institute.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "13addefec729bf46b0b52bcdcbc1502c",
        "title": "Hogs Mixed at Tuesday’s Midday",
        "doc_url": "https://www.barchart.com/story/news/36310779/hogs-mixed-at-tuesdays-midday",
        "all_text": "Lean hog futures are trading with mixed action on Tuesday, with February down a nickel and other contracts up 25 to 50 cents. USDA’s national base hog price was not reported on Tuesday morning with the 5-day rolling average at $70.92. The CME Lean Hog Index was down another 80 cents on November 21 at $83.61.\nExport Sales data for pork in the week ending on October 9 saw 288,676 MT of bookings. That was a 4-week low. Export Shipments were 28,506 MT, back down from the week prior.\nUSDA’s pork carcass cutout value from the Tuesday morning report was back down 56 cents to $93.22 per cwt. The rib and ham primals were the only reported higher. USDA estimated federally inspected hog slaughter for Monday at 495,000 head. That is 1,000 head above last week and up 2,528 head from same week last year.\nDec 25 Hogs are at $78.525, up $0.325,\nFeb 26 Hogs are at $79.125, down $0.050\nApr 26 Hogs is at $83.025, up $0.500,",
        "authors": "None",
        "publish_date": "2025-11-25 18:19:23",
        "published_at_raw": "2025-11-25T18:19:23Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are trading with mixed action on Tuesday, with February down a nickel and other contracts up 25 to 50 cents. USDA’s national base hog price was not reported on Tuesday morning with the 5-day rolling average at $70.92. The CME Lean Ho...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "29ee10776515bee0fc7b91eb73e344c0",
        "title": "What’s Going on With the U.S. Winter Wheat Crop?",
        "doc_url": "https://www.agriculture.com/what-s-going-on-with-the-u-s-winter-wheat-crop-11856811",
        "all_text": "In its final Crop Progress report of the growing season, the USDA on Monday detailed the progress and condition of the nation’s growing winter wheat crop. Only a small percentage of the crop is not yet planted, and 87% of it is out of the ground. Plus, overall crop conditions improved compared to a week ago.\nHere’s a final state-by-state look at the condition and progress of the country’s winter wheat crop.\nCondition\nAcross the top 18 winter wheat-growing states, 48% of the crop was rated good/excellent as of Nov. 23. That’s an improvement compared to last week, when the percentage was only 45%, but it’s worse than last year at this time, when good/excellent wheat made up 55% of the crop.\nCrop condition among states varied widely, based on the USDA report. Farmers in California are finding 95% of their crop in the top two condition categories, while for growers in Montana, that percentage is just 10%.\nIncluding California, 14 of the 18 top states had a higher percentage of good/excellent winter wheat than the 48% average.\nBesides Montana, good/excellent wheat in Oklahoma, South Dakota, and Texas fell below the 48% average.\nPlanting\nAverage planting progress across the top 18 winter wheat-growing states had reached 97% by Sunday, on track with the five-year average.\nFarmers in eight states were done with planting:\nColorado\nIdaho\nKansas\nMichigan\nMontana\nOregon\nSouth Dakota\nWashington\nHere’s how progress in all states measured up to respective five-year averages.\nEmergence\nAn av",
        "authors": "None",
        "publish_date": "2025-11-25 17:49:54",
        "published_at_raw": "2025-11-25T17:49:54Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA’s final Crop Progress report shows nearly all U.S. winter wheat planted, 87% emerged, and overall crop conditions improving compared to last week.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "705e9132d3191bceca512854b9d423d3",
        "title": "Corn and Soy Up Slightly | Tuesday, Nov. 25, 2025",
        "doc_url": "https://www.agriculture.com/corn-and-soy-up-slightly-or-tuesday-nov-25-2025-11856639",
        "all_text": "Ahead of 10 a.m. CT, March corn was up 1½¢ at $4.38¼ per bushel.\nJanuary soybeans were up less than a penny at $11.23½ per bushel.\nMarch CBOT wheat was up 2¼¢ at $5.37 per bushel. March KC wheat was up 2¢ at $5.24½ per bushel. March Minneapolis wheat was unchanged at $5.76.\nThis morning, USDA released export sales data as part of the agency's schedule to catch up from the recent government shutdown.\n“Delayed weekly export sales data for the week ended Oct. 9 released this morning by USDA pegged net U.S corn export sales for that week at 52.2 million bushels,” said The Brock Report. “Net U.S. soybean export sals for the week ended Oct. 9 came in at 28.9 million bushels, while net weekly wheat export sales came in at 22.6 million bushels.”\nAhead of 10 a.m. CT, January feeder cattle were up $2.25 at $307.23 per hundredweight (cwt). February live cattle were up 10¢ at $207.63 per cwt. February lean hogs were up 8¢ at $79.25 per cwt.\nJanuary crude oil was down $1.53 at $57.31 per barrel.\nThe U.S. Dollar Index December contract was down to 99.66.\nPublished: 10:14 a.m. CT",
        "authors": "None",
        "publish_date": "2025-11-25 16:14:48",
        "published_at_raw": "2025-11-25T16:14:48Z",
        "meta_site_name": "Successful Farming",
        "description": "This morning, USDA released export sales data as part of the agency's schedule to catch up from the recent government shutdown.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "48c0cd35278e01cdef994476d2e3ad38",
        "title": "Hogs Look to Tuesday Following Monday Gains",
        "doc_url": "https://www.barchart.com/story/news/36304624/hogs-look-to-tuesday-following-monday-gains",
        "all_text": "Lean hog futures were up 40 cents to $1.50 across most nearby contracts on Monday. Open interest was down 2,311 contracts on Monday, mostly in December (3,360). USDA’s national base hog price was not reported on Monday afternoon with the 5-day rolling average at $74.08. The CME Lean Hog Index was down another 90 cents on November 19 at $84.81.\nUSDA’s pork carcass cutout value from the Monday afternoon report was up another 35 cents to $93.78per cwt. The butt and ham primals were the only reported lower. USDA estimated federally inspected hog slaughter for Monday at 495,000 head. That is 1,000 head above last week and up 2,528 head from same week last year.\nDec 25 Hogs closed at $78.200, up $0.400,\nFeb 26 Hogs closed at $79.175, up $1.475\nApr 26 Hogs closed at $82.525, up $1.225,",
        "authors": "None",
        "publish_date": "2025-11-25 13:32:06",
        "published_at_raw": "2025-11-25T13:32:06Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were up 40 cents to $1.50 across most nearby contracts on Monday. Open interest was down 2,311 contracts on Monday, mostly in December (3,360). USDA’s national base hog price was not reported on Monday afternoon with the 5-day rollin...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a98ad49382f32d6246a179a8180a8beb",
        "title": "2025 Harvest Complete in Iowa; Producers Hope to Improve Ag Economy for 2026",
        "doc_url": "https://www.agriculture.com/partners-2025-harvest-complete-in-iowa-producers-hope-to-improve-ag-economy-for-2026-11856424",
        "all_text": "By Cami Koons\nThe corn and soybean harvest is complete in Iowa, according to the final USDA crop report. Producers, meanwhile, remain concerned about the cost of inputs, commodity prices and markets.\nThe report said Iowa corn harvest, at 99% of acres harvested, is “virtually” complete. The national report shows the other top corn-producing states have on average just 4% left to harvest.\nIowa Secretary of Agriculture Mike Naig said farmers delivered a “significant crop” in 2025 despite “variable” weather conditions, disease and a challenging agricultural economy.\n“Strong production requires strong markets, and we will continue working to build and diversify demand at home, across the country and around the world,” Naig said in a statement.\nAccording to the report, 67% of topsoil moisture and 66% of subsoil moisture across Iowa is adequate. South central Iowa has the driest soil conditions with about 60% of topsoil and subsoil short of moisture.\nState Climatologist Justin Glisan said the statewide average precipitation for the Nov. 17 through Nov. 23 reporting period was 0.20 inch. That means precipitation was about half of the normal of 0.43 inch.\nGlisan said the statewide average temperature for the period at 43.8 degrees Fahrenheit was 6.1 degrees above the normal.\nWill Cannon, a board member with Iowa Corn Growers Association and a farmer in Jasper County, said his harvest wrapped up in a “pretty typical timeframe” though he said almost everyone he has spoken to had a handf",
        "authors": "None",
        "publish_date": "2025-11-25 12:30:28",
        "published_at_raw": "2025-11-25T12:30:28Z",
        "meta_site_name": "Successful Farming",
        "description": "The corn and soybean harvest is complete in Iowa, according to the final USDA crop report. Producers, meanwhile, remain concerned about the cost of inputs, commodity prices and markets.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0620e8b024b8dd97cbf71ba0c31973d6",
        "title": "When will you get the SNAP benefit checks for December? Complete schedule for SNAP benefits for every US state after shutdown disruptions",
        "doc_url": "https://economictimes.indiatimes.com/news/international/us/when-will-you-get-the-snap-benefit-checks-for-december-complete-schedule-for-snap-benefits-for-every-us-state-after-shutdown-disruptions/articleshow/125560493.cms",
        "all_text": "Synopsis\nSNAP benefits December dates: Americans can now expect their SNAP benefits for December. The USDA confirmed full restoration following a 43-day government shutdown. This brings relief to millions who faced payment delays and uncertainty. States will begin issuing benefits according to their specific schedules. Recipients should verify their exact payment dates. This ensures food security for many households.\nAfter weeks of uncertainty triggered by the historic 43-day government shutdown in October, people are eagerly waiting to know the SNAP benefits for December dates; 42 million Americans can finally expect clarity. The USDA has confirmed that SNAP benefits for December are now fully restored, ending a chaotic period marked by suspended payments, legal battles, and even benefit clawbacks in some states.\nAlso Read: Social Security and SSI Schedule for December 2025: Americans to receive three payments in December, who qualifies and what 2026 COLA means for you and the important dates\nThe prolonged shutdown left the Supplemental Nutrition Assistance Program in disarray. In early November, the USDA abruptly halted funding for SNAP, forcing several states to pause payments altogether.\nSNAP benefits for December complete schedule\nCongress passed a last-minute funding bill on November 12, 2025, allowing states to restart delayed November benefits and stabilize the system. Below is the state-by-state schedule for December 2025, summarized by Futbolete. Individual payment ",
        "authors": "None",
        "publish_date": "2025-11-25 09:00:00",
        "published_at_raw": "2025-11-25T09:00:00Z",
        "meta_site_name": "The Economic Times",
        "description": "SNAP benefits December dates: Americans can now expect their SNAP benefits for December. The USDA confirmed full restoration following a 43-day government shutdown. This brings relief to millions who faced payment delays and uncertainty. States will begin issuing benefits according to their specific schedules. Recipients should verify their exact payment dates. This ensures food security for many households.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b41e5fccf5eb8c0b29867ca16b48cff0",
        "title": "Daybreak Nov. 24: IARC Finds Atrazine ‘Probably’ Causes Cancer in Humans; Syngenta Pushes Back",
        "doc_url": "https://www.agriculture.com/partners-daybreak-nov-24-iarc-finds-atrazine-probably-causes-cancer-in-humans-syngenta-pushes-back-11855727",
        "all_text": "The International Agency for Research on Cancer’s classification of commonly used weedkiller atrazine as “probably carcinogenic to humans” prompted a quick response from the herbicide’s supporters and critics.\nAtrazine manufacturer Syngenta says IARC’s “mandate [is] to determine if a substance could cause cancer from a potential hazard perspective. In fact, IARC – which is not a regulatory agency – does not determine the likelihood of cancer occurring at realistic levels of exposure (technically called “risk”).”\nSyngenta says “close to 50 regulatory authorities and scientific expert bodies worldwide … have concluded that atrazine does not pose any carcinogenic risk and is safe when used in accordance with the registered label instructions.”\nIARC, which is part of the World Health Organization, previously classified the weedkiller glyphosate as a probable human carcinogen. Bayer, which manufactures glyphosate, says that finding is not supported by government regulatory agencies but has been used to support thousands of lawsuits against the company.\nIARC says its classification rests in part on combinations of “limited evidence for cancer in humans and sufficient evidence for cancer in experimental animals.” IARC also says “positive associations have been observed for non-Hodgkin lymphoma that is positive for the chromosomal translocation.”\nThe Center for Biological Diversity said the classification “was determined by a working group of 22 expert cancer researchers from 12 diff",
        "authors": "None",
        "publish_date": "2025-11-25 09:00:00",
        "published_at_raw": "2025-11-25T09:00:00Z",
        "meta_site_name": "Successful Farming",
        "description": "Plus, U.S. and EU trade talks heat up, USDA debuts screwworm info site, DOJ opens beef probe, and Tyson closes Nebraska plant amid restructuring.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7f0015674ce45a4c6ec04ac97eec02f1",
        "title": "USDA to Purchase $30M in Fruit for Americans in Need",
        "doc_url": "https://www.newsmax.com/newsfront/usda-brooke-rollins-food-banks/2025/11/24/id/1235896/",
        "all_text": "The Department of Agriculture announced Monday it will buy up to $30 million in fresh fruit from U.S. farmers and producers to distribute to food banks and nutrition assistance programs nationwide.\nThe USDA said the purchases through its Agricultural Marketing Service include $15 million in oranges, $10 million in grapefruit, and $5 million in mandarin oranges.\n\"These fresh fruits will reach those in need, boosting healthier options for Americans at food banks across the country, all while benefiting American farmers facing unfair actions from foreign competitors,\" USDA Secretary Brooke Rollins said in a news release.\nThe Agricultural Marketing Service purchases a variety of domestically produced and processed agricultural products as authorized by Section 32 of the Agriculture Act of 1935.\nThose foods are provided to the USDA's Food and Nutrition Service programs, including food banks that are a vital component of the nation's food safety net.\nThe program helps ensure surplus crops are not wasted and instead benefit Americans in need.\n\"President Trump is standing with America's farmers, especially right now while the farm economy recovers from years of neglect under the last administration,\" Rollins said.\n\"Certain commodities are experiencing a surplus and USDA is ensuring these crops do not go to waste and instead go to Americans in need across the country,\" she added.\nRollins earlier Monday reportedly said the Trump administration expects to announce an aid package for U.S",
        "authors": "None",
        "publish_date": "2025-11-25 01:06:14",
        "published_at_raw": "2025-11-25T01:06:14Z",
        "meta_site_name": "Newsmax",
        "description": "The Department of Agriculture announced Monday it will purchase up to $30 million in fresh fruit from U.S. farmers for distribution to food banks and nutrition assistance programs nationwide.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "53b93cbea687955bcd123c33f50ad5ea",
        "title": "USDA to Purchase $30M in Fruit for Americans in Need",
        "doc_url": "https://www.newsmax.com/newsfront/usda-brooke-rollins-foodbanks/2025/11/24/id/1235896/",
        "all_text": "The Department of Agriculture announced Monday it will buy up to $30 million in fresh fruit from U.S. farmers and producers to distribute to food banks and nutrition assistance programs nationwide.\nThe USDA said the purchases through its Agricultural Marketing Service include $15 million in oranges, $10 million in grapefruit, and $5 million in mandarin oranges.\n\"These fresh fruits will reach those in need, boosting healthier options for Americans at food banks across the country, all while benefiting American farmers facing unfair actions from foreign competitors,\" USDA Secretary Brooke Rollins said in a news release.\nThe Agricultural Marketing Service purchases a variety of domestically produced and processed agricultural products as authorized by Section 32 of the Agriculture Act of 1935.\nThose foods are provided to the USDA’s Food and Nutrition Service programs, including food banks that are a vital component of the nation’s food safety net.\nThe program helps ensure surplus crops are not wasted and instead benefit Americans in need.\n\"President Trump is standing with America’s farmers, especially right now while the farm economy recovers from years of neglect under the last administration,\" Rollins said.\n\"Certain commodities are experiencing a surplus and USDA is ensuring these crops do not go to waste and instead go to Americans in need across the country,\" she added.\nRollins earlier Monday reportedly said the Trump administration expects to announce an aid package for U.S",
        "authors": "None",
        "publish_date": "2025-11-25 00:27:34",
        "published_at_raw": "2025-11-25T00:27:34Z",
        "meta_site_name": "Newsmax",
        "description": "The USDA said the purchases through its Agricultural Marketing Service include $15 million in oranges, $10 million in grapefruit, and $5 million in mandarin oranges.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]