[
    {
        "id": "a18464ae20993a972afc958fac7e87d5",
        "title": "Corn Gives into Weakness on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/37162143/corn-gives-into-weakness-on-wednesday",
        "all_text": "Corn futures posted weaker trade heading into Wednesday, with contracts fractionally to 2 cents lower on the session. The CmdtyView national average Cash Corn price was down 1 1/2 cents at $3.84 1/2.\nUSDA reported a couple private export sales of 150,000 MT of corn to Colombia and 195,000 MT to unknown destinations this morning.\nWeekly EIA data will be pushed back to Thursday morning due to the Monday holiday, with most looking for ethanol production to pull back from last week’s surge to a new all time record.\nA Taiwan importer purchased a total of 65,000 MT of US con in a tender overnight.\nMar 26 Corn closed at $4.21 3/4, down 2 cents,\nNearby Cash was $3.84 1/2, down 1 1/2 cents,\nMay 26 Corn closed at $4.29 3/4, down 1 1/2 cents,\nJul 26 Corn closed at $4.36 1/4, down 1 1/2 cents,",
        "authors": "None",
        "publish_date": "2026-01-21 23:01:12",
        "published_at_raw": "2026-01-21T23:01:12Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted weaker trade heading into Wednesday, with contracts fractionally to 2 cents lower on the session. The CmdtyView national average Cash Corn price was down 1 1/2 cents at $3.84 1/2. USDA reported a couple private export sales of 1...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2c266a920706acb44a2c9fbec0b6713f",
        "title": "Corn Posting Wednesday AM Gains",
        "doc_url": "https://www.barchart.com/story/news/37149025/corn-posting-wednesday-am-gains",
        "all_text": "Corn price action is up 2 to 3 ½ cents in the front months on Wednesday. Futures posted fractional to penny losses in the nearbys on Tuesday, with other contracts fractionally to 1 ¾ cents higher. Preliminary open interest was down 1,533 contracts on Tuesday. The CmdtyView national average Cash Corn price was down 1 ¼ cents at $3.86.\nExport Inspections data showed corn shipments at 1.484 MMT (58.4 mbu) shipped in the week that ended on January 15. That was down 1.35% from the week prior, and 3.81% below the same week last year. Mexico was the top destination of 401,809 MT, with 252,324 MT to Colombia and 243,588 MT to Japan. Marketing year shipments have totaled 29.92 MMT (1.178 bbu), which is up 55.46% yr/yr.\nA Taiwan importer purchased a total of 65,000 MT of US con in a tender overnight.\nANEC estimates the Brazilian corn export total for January at 3.45 MMT, a 0.18 MMT increase from last week.\nMar 26 Corn closed at $4.23 3/4, down 1 cent, currently up 3 1/2 cents\nNearby Cash was $3.86, down 1 1/4 cents,\nMay 26 Corn closed at $4.31 1/4, down 3/4 cent, currently up 3 1/2 cents\nJul 26 Corn closed at $4.37 3/4, down 1/4 cent, currently up 3 1/4 cents",
        "authors": "None",
        "publish_date": "2026-01-21 13:25:28",
        "published_at_raw": "2026-01-21T13:25:28Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is up 2 to 3 ½ cents in the front months on Wednesday. Futures posted fractional to penny losses in the nearbys on Tuesday, with other contracts fractionally to 1 ¾ cents higher. Preliminary open interest was down 1,533 contracts on...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1b848b14345498efb25a2f14552ca5de",
        "title": "Soybean Rally Holding on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/37162154/soybean-rally-holding-on-wednesday",
        "all_text": "Soybeans futures held on to the Wednesday gains as contracts were up 8 to 11 ½ cents across most months. The cmdtyView national average Cash Bean price was 12 1/4 cents lower at $9.94. Soymeal futures were down 20 cents to $2.10/ton, with Soy Oil futures 107 to 145 points higher.\nIn an interview late on Tuesday, US Trade Rep Greer stated there is a chance that he and secretary Bessent meet with Chinese counterparts before April when President Trump is expected to meet with President Xi. Secretary Bessent met with China’s Vice Premier on Wednesday in Davos and had positive trade tals\nRains are expected in northern portions of Brazil in the next week, slowing some early harvest. The southern portions are expected to be drier, as well as parts of Argentina.\nMar 26 Soybeans closed at $10.64 1/2, up 11 1/2 cents,\nNearby Cash was $9.94, up 12 1/4 cents,\nMay 26 Soybeans closed at $10.75, up 11 cents,\nJul 26 Soybeans closed at $10.87 1/4, up 11 cents,",
        "authors": "None",
        "publish_date": "2026-01-21 23:01:12",
        "published_at_raw": "2026-01-21T23:01:12Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans futures held on to the Wednesday gains as contracts were up 8 to 11 ½ cents across most months. The cmdtyView national average Cash Bean price was 12 1/4 cents lower at $9.94. Soymeal futures were down 20 cents to $2.10/ton, with Soy Oil fu...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "657482c3b5906a9444bec15fc5bd7dbf",
        "title": "Soybean Futures Rise on Biofuel Hopes -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/soybean-futures-rise-on-biofuel-hopes-daily-grain-highlights-ce7e58d2da88f325",
        "all_text": "By Kirk Maltais\n--Soybeans for March delivery rose 1.1% to $10.65 a bushel on the Chicago Board of Trade Wednesday, in anticipation of new regulations coming from the EPA to solidify demand for soybean oil for use in biofuel.\n--Corn for March delivery fell 0.5% to $4.22 a bushel.\n--Wheat for March delivery fell 0.4% to $5.08 3/4 a bushel.\nHIGHLIGHTS\nFueling the Fire: Soybean oil futures jumped by nearly 3% in Wednesday's trading, which helped lift underlying soybean futures. Behind the uptick was hopes that the EPA will soon release its final regulations around biofuels, including the status of small refinery exemptions. \"There's a cautious optimism that those final regulations will be positive for demand for feedstocks going into the production of biomass diesel, including soybean oil,\" says Arlan Suderman of StoneX in a note.\nBack to the Table: Indications that U.S. officials have met with their Chinese counterparts while attending the World Economic Forum in Davos, Switzerland boosted soybeans in early trade. Treasury Secretary Scott Bessent is reported to have met with Chinese Vice Premier He Lifeng in Davos, and U.S. Trade Representative Jamieson Greer floated the possibility of the two sides meeting again before a scheduled sit down between President Trump and Chinese President Xi in April.\nCooling Off: Financial markets across the board breathed a sigh of relief in the U.S.-Greenland situation Wednesday, after President Trump ruled out a military takeover in remarks at",
        "authors": "None",
        "publish_date": "2026-01-21 20:16:23",
        "published_at_raw": "2026-01-21T20:16:23Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\n--Soybeans for March delivery rose 1.1% to $10.65 a bushel on the Chicago Board of Trade Wednesday, in anticipation of new regulations coming from the EPA to solidify demand for...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "93f1706fbe0ba83ff8cc811a5b65fb47",
        "title": "Soybean Rally Holding on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/37156958/soybean-rally-holding-on-wednesday",
        "all_text": "Soybeans futures are trading with 12 to 13 cent gains in the nearbys on Wednesday. The cmdtyView national average Cash Bean price is 13 1/4 cents lower at $9.95. Soymeal futures are down 40 to 70 cents, with Soy Oil futures 141 to 144 points higher.\nIn an interview late on Tuesday, US Trade Rep Greer stated there is a chance that he and secretary Bessent meet with Chinese counterparts before April when President Trump is expected to meet with President XI.\nRains are expected in northern portions of Brazil in the next week, slowing some early harvest. The southern portions are expected to be drier, as well as parts of Argentina.\nMar 26 Soybeans are at $10.65 3/4, up 12 3/4 cents,\nNearby Cash is at $9.95, up 13 1/4 cents,\nMay 26 Soybeans are at $10.76 1/2, up 12 1/2 cents,\nJul 26 Soybeans are at $10.88 3/4, up 12 1/2 cents,",
        "authors": "None",
        "publish_date": "2026-01-21 18:22:17",
        "published_at_raw": "2026-01-21T18:22:17Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans futures are trading with 12 to 13 cent gains in the nearbys on Wednesday. The cmdtyView national average Cash Bean price is 13 1/4 cents lower at $9.95. Soymeal futures are down 40 to 70 cents, with Soy Oil futures 141 to 144 points higher....",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3df7021bb976fd79e8a5d788cbe7c4ea",
        "title": "Govt to procure 30,000 tonnes fertilizer, 27.1m litres of soybean oil",
        "doc_url": "https://www.dhakatribune.com/business/401515/govt-to-procure-30-000-tonnes-fertilizer-27.1m",
        "all_text": "The government on Wednesday approved separate proposals for procuring some 30,000 tonnes of urea fertilizer and more than 27.1 million liters of soybean oil to meet the growing demand for the country.\nThe approval came from the 3rd meeting of the Advisers Council Committee on Government Purchase in this year held at the Cabinet Division Conference Room at Bangladesh Secretariat with Finance and Science and Technology Adviser Dr Salehuddin Ahmed in the chair.\nFollowing a proposal from the Ministry of Commerce, the committee recommended it for procuring 27.15 million litres of refined soybean oil from the international market through the direct procurement method (DPM) from NSRIC Green Supplies, Canada with around Tk357 crore, to ensure adequate domestic supply and stabilize the edible oil market ahead of the month of Ramadan.\nPer liter soybean oil will cost Tk131.49.\nThe meeting also approved a proposal from the Ministry of Industries to import 30,000 tonnes of bagged granular urea fertilizer from Karnaphuli Fertilizer Company Limited (Kafco) under the 11th lot for the current FY26 with around Tk149.17 crore, to meet demand for such key agricultural input.\nUnder the consignment, per tonne fertilizer would cost $405.25.\nIn addition to these key import proposals, the committee considered positively several other agenda items, including construction of fertilizer buffer warehouse in Faridpur and Gaibandha, procurement of high-speed boats for the Bangladesh Coast Guard, and multip",
        "authors": "None",
        "publish_date": "2026-01-21 13:34:47",
        "published_at_raw": "2026-01-21T13:34:47Z",
        "meta_site_name": "Dhaka Tribune",
        "description": "The government on Wednesday approved separate proposals for procuring some 30,000 tonnes of urea fertilizer and more than 27.1 million liters of soybean oil to meet the growing demand for the country. The approval came from the 3rd meeting of the Advisers Council Committee on...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f0733be0b33825afb971fcb00ede8a39",
        "title": "KP CM directs to ensure smooth supply of wheat to masses",
        "doc_url": "https://www.nation.com.pk/22-Jan-2026/kp-cm-directs-ensure-smooth-supply-wheat-masses",
        "all_text": "PESHAWAR - Following imposition of re­strictions by the Punjab gov­ernment on inter-provin­cial movement of wheat, Chief Minister Khyber Pakh­tunkhwa Sohail Afridi has ini­tiated immediate measures to safeguard public interest and stabilize wheat prices in the province.\nThe Chief Minister directed the Provincial Food Depart­ment to commence the re­lease of 136,000 metric tons of wheat from strategic reserves to shield consumers from es­calating price pressures in the open market and ensure unin­terrupted availability of essen­tial food items to the public.\nFollowing the restriactions imposed by the Punjab govern­ment, wheat prices in the pro­vincial open market surged to Rs13,650 per 100 kilograms.\nTo counter this pressure and ensure affordability, the pro­vincial government has decid­ed to supply wheat at a sub­sidized rate of Rs10,414 per 100 kilograms. As a result, a 20-kilogram bag of flour will be available to the public at a subsidized price of Rs2,220 in­stead of Rs3,020.\nThe Chief Minister empha­sized that Article 151 of the Constitution of Paki­stan guarantees the free movement of essential commodities across the country, and that the Khyber Pakhtunkhwa government will not al­low food availability to become hostage to pro­vincial barriers or ad­ministrative restrictions. He said that safeguard­ing the fundamental rights of the people is a constitutional obligation of the government, and no compromise will be made in this regard.\nThe Chief Minister stressed that the w",
        "authors": "None",
        "publish_date": "2026-01-21 19:00:00",
        "published_at_raw": "2026-01-21T19:00:00Z",
        "meta_site_name": "The Nation",
        "description": "PESHAWAR  -  Following imposition of re­strictions by the Punjab gov­ernment on inter-provin­cial movement of wheat, Chief Minister Khyber",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cf88506b0eaaa61b6e2ab2a37686f16e",
        "title": "Punjab announces Rs45b subsidy to ensure uninterrupted flour supply",
        "doc_url": "https://www.nation.com.pk/22-Jan-2026/punjab-announces-rs45b-subsidy-ensure-uninterrupted-flour-supply",
        "all_text": "LAHORE - The Punjab government has launched a Rs45 billion subsidy on 1.2 million metric tons of wheat to ensure the uninterrupted availability of affordable wheat and flour across the province, Director General Food Punjab Amjad Hafeez said on Wednesday. The DG Food stated that the daily supply of subsidised wheat to operational flour mills has been increased from 15,000 to 20,000 metric tons, a quantity sufficient to meet 100 per cent of Punjab’s daily flour requirements. Briefing on supply arrangements, the DG Food said that under the initiative, the Pakistan Agricultural Storage and Services Corporation (PASSCO) has already delivered the first tranche of 300,000 metric tons of wheat to Punjab, while a further 400,000 metric tons has also been handed over to the provincial government. He said wheat was being released into the market in a phased and well-coordinated manner under a clear strategy aimed at maintaining an uninterrupted supply chain.\n“As a result of these timely measures, wheat and flour supplies have remained stable, market pressure has eased, and prices are expected to decline in the coming days,” he added, noting that the steps would directly benefit consumers.\nAmjad Hafeez further said that, alongside consumer relief, the government was also taking measures to safeguard farmers’ interests and strengthen the agricultural economy. In the upcoming season, wheat procurement through the private sector will be increased from 2.5 million metric tons to 3 million m",
        "authors": "None",
        "publish_date": "2026-01-21 19:00:00",
        "published_at_raw": "2026-01-21T19:00:00Z",
        "meta_site_name": "The Nation",
        "description": "LAHORE   -   The Punjab government has launched a Rs45 billion subsidy on 1.2 million metric tons of wheat to ensure the uninterrupted availability",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "84b1aeeda0824ebe9bbc5d2264c1eb12",
        "title": "Market Bottom Alert: Are Wheat Prices Heading Higher from Here?",
        "doc_url": "https://www.barchart.com/story/news/37154979/market-bottom-alert-are-wheat-prices-heading-higher-from-here",
        "all_text": "May soft red winter wheat (ZWK26) futures present a buying opportunity on fresh price strength.\nSee on the daily bar chart for May soft red winter wheat futures that prices have been trading choppy and sideways at lower levels for four weeks. It’s my bias that this price action is “basing” that will put in a market bottom and set off a price uptrend. See, too, at the bottom of the chart that the moving average convergence divergence (MACD) indicator is in a bullish posture as the blue MACD line is above the red trigger line and both lines are trending up.\nFundamentally, global geopolitical risks, the possibility of winterkill in parts of Asia and the U.S. amid the upcoming extreme cold weather, and the prospect of fund short covering are potentially bullish elements for the wheat futures markets.\nA move in May SRW wheat futures above chart resistance at $5.33 would give the bulls some fresh power and it would also become a buying opportunity. The upside price objective would be $5.80 or above. Technical support, for which to place a protective sell stop just below, is located at the contract low of $5.13.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in nature.\nH",
        "authors": "None",
        "publish_date": "2026-01-21 16:47:07",
        "published_at_raw": "2026-01-21T16:47:07Z",
        "meta_site_name": "Barchart",
        "description": "May soft red winter wheat futures present a buying opportunity on fresh price strength.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "584d5154f512b45337538960870adebb",
        "title": "Hog Bulls Push Back Higher on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/37162184/hog-bulls-push-back-higher-on-wednesday",
        "all_text": "Lean hog futures closed steady to 45 cents higher in the front months on Wednesday. USDA’s national base hog price was reported at $85.13 on Wednesday afternoon, up $4.94 from the day prior. The CME Lean Hog Index was up another 27 cents on Jan 19 at $82.03.\nUSDA’s pork carcass cutout value from the Wednesday PM report was 51 cents higher at $93.98 per cwt. The butt and picnic primals were reported lower. USDA estimated federally inspected hog slaughter for Wednesday at 495,000 head, taking the weekly total to 1.404 million head after a revision 4,000 head lower to Tuesday. That is 77,000 head below last week but 64,132 head above the same week last year.\nFeb 26 Hogs closed at $87.850, up $0.000,\nApr 26 Hogs closed at $95.600, up $0.425\nMay 26 Hogs closed at $99.275, up $0.275,",
        "authors": "None",
        "publish_date": "2026-01-21 23:01:12",
        "published_at_raw": "2026-01-21T23:01:12Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed steady to 45 cents higher in the front months on Wednesday. USDA’s national base hog price was reported at $85.13 on Wednesday afternoon, up $4.94 from the day prior. The CME Lean Hog Index was up another 27 cents on Jan 19 at...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:59",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5e9ae65dec36b05f3f56dfa76917eee8",
        "title": "Trump Administration Orders USDA To Investigate Foreign Researchers It Work With",
        "doc_url": "https://www.agriculture.com/partners-trump-administration-orders-usda-to-investigate-foreign-researchers-it-work-with-11889911",
        "all_text": "By Lisa Song and Sharon Lerner\nThis report was first published by ProPublica, a nonprofit newsroom that investigates abuses of power. Sign up to receive its biggest stories as soon as they’re published.\nThe Trump administration is directing employees at the USDA to investigate foreign scientists who collaborate with the agency on research papers for evidence of “subversive or criminal activity.”\nThe new directive, part of a broader effort to increase scrutiny of research done with foreign partners, asks workers in the agency’s research arm to use Google to check the backgrounds of all foreign nationals collaborating with its scientists. The names of flagged scientists are being sent to national security experts at the agency, according to records reviewed by ProPublica.\nAt a meeting last month, USDA supervisors pushed back against the instructions, with one calling it “dystopic” and others expressing shock and confusion, according to an audio recording reviewed by ProPublica.\nThe USDA frequently collaborates with scientists based at universities in the U.S. and abroad. Some agency workers told ProPublica they were uncomfortable with the new requirement because they felt it could put those scientists in the crosshairs of the administration. Students and postdocs are particularly vulnerable as many are in the U.S. on temporary visas and green cards, the employees said.\nJennifer Jones, director for the Center for Science and Democracy at the Union of Concerned Scientists, called",
        "authors": "None",
        "publish_date": "2026-01-21 21:49:21",
        "published_at_raw": "2026-01-21T21:49:21Z",
        "meta_site_name": "Successful Farming",
        "description": "The Trump administration is directing employees at the USDA to investigate foreign scientists who collaborate with the agency on research papers for evidence of “subversive or criminal activity.”",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:59",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f438ee9318e588f89917ecedc3ffe2e7",
        "title": "USDA Says Reorganization Moves Will Happen This Summer",
        "doc_url": "https://www.agriculture.com/usda-says-reorganization-moves-will-happen-this-summer-11889794",
        "all_text": "The movement of USDA employees to five regional hubs across the U.S. will take place between the end of this school year and the beginning of the next, USDA Deputy Secretary Stephen Vaden said Wednesday.\nDuring an event hosted by the National Agricultural Law Center, Vaden discussed topics such as the One Big Beautiful Bill Act, trade, bridge payments, antitrust laws, and foreign land ownership. USDA reorganization, a controversial move announced by the department last summer, also came up.\nVaden said one of his first tasks after returning from the holiday break was to sign a memorandum authorizing entry into leases for the new facilities USDA will expand in as part of the reorganization. “All the facilities that we are expanding in are already government owned or government leased. They just happen to be unoccupied or underused,” he said.\n“As we go forward this calendar year, you will see further announcements of leases that we are entering into,” he said. “You will see us delivering notices to those employees whom we will request to move to the new hub locations.\nVaden said the department is taking into account employees with children in school when it comes to the timing of move requests.\n“We anticipate the moves will take place after the school year ends ... so that they can move during the summer and be settled by the time the school year begins and their children can go to school in their new schools in the fall of this year,” he said.\nUSDA held a public comment period ",
        "authors": "None",
        "publish_date": "2026-01-21 19:25:00",
        "published_at_raw": "2026-01-21T19:25:00Z",
        "meta_site_name": "Successful Farming",
        "description": "The movement of USDA employees to five regional hubs across the U.S. will take place between the end of this school year and the beginning of the next, USDA Deputy Secretary Stephen Vaden said during an event Wednesday.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:59",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "10898f86d508759fa4e275138a06220e",
        "title": "Hogs Holding Steady at Midday",
        "doc_url": "https://www.barchart.com/story/news/37156993/hogs-holding-steady-at-midday",
        "all_text": "Lean hog futures are steady to 15 cents lower in the front months on Wednesday. USDA’s national base hog price was not reported this morning. The CME Lean Hog Index was up another 27 cents on Jan 19 at $82.03.\nUSDA’s pork carcass cutout value from the Wednesday AM report was 94 cents higher at $94.41 per cwt. The butt, picnic, and ham primals were reported lower. USDA estimated federally inspected hog slaughter for Tuesday at 492,000 head, taking the weekly total to 914,000. That is 72,000 head below last week but 13,430 head above the same week last year.\nFeb 26 Hogs are at $87.700, down $0.150,\nApr 26 Hogs are at $95.175, down $0.000\nMay 26 Hogs are at $98.900, down $0.100,",
        "authors": "None",
        "publish_date": "2026-01-21 18:22:18",
        "published_at_raw": "2026-01-21T18:22:18Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are steady to 15 cents lower in the front months on Wednesday. USDA’s national base hog price was not reported this morning. The CME Lean Hog Index was up another 27 cents on Jan 19 at $82.03. USDA’s pork carcass cutout value from th...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:59",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3fe55c4995592e046ddbb00453b7d9fb",
        "title": "USDA money helps Stockton further maple program",
        "doc_url": "https://pressofatlanticcity.com/news/local/education/article_d348ec33-0d18-4753-a3b0-8c7e50e7fe1c.html",
        "all_text": "More than 1,000 volunteers participated in Stockton University’s Martin Luther King Jr. Day of Service on Monday, school officials said.\nContact Dan Grote:\n609-272-7234\ndgrote@pressofac.com\nX @ACPress_Grote\nWant to see more like this?\nGet our local education coverage delivered directly to your inbox.\n* I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy.\nDan Grote\nNews editor\nGet email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}\nEmail notifications are only sent once a day, and only if there are new matching items.\nFollowed notifications\nPlease log in to use this feature\nLog In\nDon't have an account? Sign Up Today",
        "authors": "None",
        "publish_date": "2026-01-21 15:30:00",
        "published_at_raw": "2026-01-21T15:30:00Z",
        "meta_site_name": "Press of Atlantic City",
        "description": "Now in its sixth year, the Stockton University Maple Project recently received a $273,000 grant from the U.S. Department of Agriculture.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:59",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "33a9df8920c315a67dd43fc3c1da3e79",
        "title": "Hog Traders Look to Wednesday Trade After Mixed Tuesday Action",
        "doc_url": "https://www.barchart.com/story/news/37149069/hog-traders-look-to-wednesday-trade-after-mixed-tuesday-action",
        "all_text": "Lean hog futures settled Tuesday with mixed trade, as front months were a tick to 42 cents lower with some deferreds higher. Preliminary open interest was up 7,867 contracts on Tuesday. USDA’s national base hog price was reported at $80.19 on Tuesday afternoon. The CME Lean Hog Index was up another 76 cents on Jan 16 at $81.76.\nUSDA’s pork carcass cutout value from the Tuesday afternoon report was 73 cents lower at $93.47 per cwt. The loin, belly, and picnic primals were reported lower. USDA estimated federally inspected hog slaughter for Tuesday at 492,000 head, taking the weekly total to 914,000. That is 72,000 head below last week but 13,430 head above the same week last year.\nFeb 26 Hogs closed at $87.850, down $0.425,\nApr 26 Hogs closed at $95.175, down $0.025\nMay 26 Hogs closed at $99.000, up $0.275,",
        "authors": "None",
        "publish_date": "2026-01-21 13:25:28",
        "published_at_raw": "2026-01-21T13:25:28Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures settled Tuesday with mixed trade, as front months were a tick to 42 cents lower with some deferreds higher. Preliminary open interest was up 7,867 contracts on Tuesday. USDA’s national base hog price was reported at $80.19 on Tuesday...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:59",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]