[
    {
        "id": "e0055e38a7761244248061e0eeb33fed",
        "title": "Former US Rep. Yvette Herrell confirmed for USDA role despite home state senators' opposition",
        "doc_url": "https://www.abqjournal.com/news/senate-votes-to-confirm-yvette-herrells-nomination-to-trump-administration-post/2945390",
        "all_text": "SANTA FE — Former New Mexico congresswoman Yvette Herrell's nomination to a Trump administration post was confirmed this week by the U.S. Senate, despite both of her home state senators casting \"no\" votes.\nHerrell was appointed by the president in June to be an assistant secretary for congressional relations in the U.S. Department of Agriculture, and her nomination was bundled together with about 100 other nominees for a final confirmation vote.\nOn a party-line vote, the U.S. Senate voted 53-43 late Thursday to confirm the nominees. New Mexico's two U.S. senators — Ben Ray Luján and Martin Heinrich — joined other Senate Democrats in voting against the nomination package.\nA Luján spokesperson said Friday the second-term senator voted for Herrell's nomination in the U.S. Senate Committee on Agriculture, Nutrition and Forestry after Herrell expressed a willingness to work with him on issues affecting New Mexicans, but could not support her on the Senate floor due to how the nominations were bundled together.\n\"As a member of the Senate Agriculture Committee, Senator Luján will work with anyone to deliver for New Mexico farmers, ranchers, producers, and families,\" said Luján spokesperson Seiichiro Nakai. \"At the same time, he will hold the Trump administration accountable for breaking the law, ignoring Congressional communications, and making life more expensive for working families.\"\nIn her new Trump administration job based in Washington, D.C., Herrell will hold a key post in a ",
        "authors": "None",
        "publish_date": "2025-12-20 01:53:35",
        "published_at_raw": "2025-12-20T01:53:35Z",
        "meta_site_name": "Albuquerque Journal",
        "description": "The Senate confirmed former New Mexico congresswoman Yvette Herrell to a key USDA position on a party-line vote, with both NM senators voting against the bundled nomination package that included her appointment.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4e399efddf4785e2f523df53ac3fc807",
        "title": "Avian Flu Outbreak: Wisconsin Dairy Herd Faces New Virus Spillover",
        "doc_url": "https://www.devdiscourse.com/article/health/3736758-avian-flu-outbreak-wisconsin-dairy-herd-faces-new-virus-spillover",
        "all_text": "In a significant development, the United States Department of Agriculture (USDA) confirmed a highly pathogenic avian influenza case in a Wisconsin dairy herd, signaling a novel spillover incident from wildlife to cattle. The virus, identified as the H5N1 strain, was confirmed through whole genome sequencing conducted by the National Veterinary Services Laboratories.\nThis marks a distinct shift from previous outbreaks primarily traced back to an initial spillover in Texas, characterized by the B3.13 strain. Previous isolated incidents in Nevada and Arizona involved the D1.1 variant, but the Wisconsin incident presents a new challenge. The National Milk Testing Strategy detected it, with no subsequent herd infections reported.\nHealth officials assure consumers that there's no threat to public safety or the milk supply, as pasteurization effectively neutralizes the virus. The USDA emphasizes maintaining strict biosecurity measures while Congress urges the Trump administration to expedite bird flu vaccine development for livestock, underscoring the public health priority.\n(With inputs from agencies.)",
        "authors": "None",
        "publish_date": "2025-12-20 01:00:45",
        "published_at_raw": "2025-12-20T01:00:45Z",
        "meta_site_name": "Devdiscourse",
        "description": "The USDA has confirmed a case of highly pathogenic avian influenza in a Wisconsin dairy herd, marking a new spillover event from wildlife to cattle. Identified as the H5N1 strain, this outbreak doesn't pose a threat to consumer health. Milk pasteurization kills the virus, ensuring safety. USDA continues to monitor the situation closely.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3c816ef7269832227c213a9f597308af",
        "title": "USDA confirms bird flu case in Wisconsin dairy herd as new wildlife spillover",
        "doc_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/usda-confirms-bird-flu-case-wisconsin-dairy-herd-new-wildlife-spillover-2025-12-20/",
        "all_text": "Dec 19 (Reuters) - The United States Department of Agriculture on Friday confirmed that a case of highly pathogenic avian influenza in a Wisconsin dairy herd marked a new spillover event from wildlife to cattle, separate from previous outbreaks.\nThe virus, identified as H5N1 clade 2.3.4.4b genotype D1.1., was confirmed through whole genome sequencing by the National Veterinary Services Laboratories on December 17, USDA’s Animal and Plant Health Inspection Service said in a statement.\nSign up here.\nIt said most detections of highly pathogenic avian influenza in U.S. dairy herds have resulted from movements linked to an original spillover event that occurred in Texas in late 2023, involving the B3.13 strain.\nEarlier this year, two isolated spillovers were detected in Nevada and Arizona, involving the D1.1 strain.\nThe Wisconsin case, detected under USDA's National Milk Testing Strategy, has not led to additional herd infections, APHIS said.\nUSDA said the findings do not pose a risk to consumer health or the commercial milk supply, as pasteurization kills the virus and milk from affected animals is diverted or destroyed.\nIt added that the Centers for Disease Control and Prevention continues to consider the risk to the public to be low.\nUSDA urged dairy producers to maintain strict biosecurity and report any livestock showing clinical signs or unusual wildlife deaths.\nA bipartisan group of U.S. senators last week urged the administration of President Donald Trump to finalize a sci",
        "authors": "None",
        "publish_date": "2025-12-20 01:00:09",
        "published_at_raw": "2025-12-20T01:00:09Z",
        "meta_site_name": "Reuters",
        "description": "The United States Department of Agriculture on Friday confirmed that a case of highly pathogenic avian influenza in a Wisconsin dairy herd marked a new spillover event from wildlife to cattle, separate from previous outbreaks.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "91661884061fb22c78e9fe106b4c4633",
        "title": "USDA confirms bird flu case in Wisconsin dairy herd as new wildlife spillover",
        "doc_url": "https://www.marketscreener.com/news/usda-confirms-bird-flu-case-in-wisconsin-dairy-herd-as-new-wildlife-spillover-ce7d50ddd08bf12c",
        "all_text": "Dec 19 (Reuters) - The United States Department of Agriculture on Friday confirmed that a case of highly pathogenic avian influenza in a Wisconsin dairy herd marked a new spillover event from wildlife to cattle, separate from previous outbreaks.\nThe virus, identified as H5N1 clade 2.3.4.4b genotype D1.1., was confirmed through whole genome sequencing by the National Veterinary Services Laboratories on December 17, USDA's Animal and Plant Health Inspection Service said in a statement.\nIt said most detections of highly pathogenic avian influenza in U.S. dairy herds have resulted from movements linked to an original spillover event that occurred in Texas in late 2023, involving the B3.13 strain.\nEarlier this year, two isolated spillovers were detected in Nevada and Arizona, involving the D1.1 strain.\nThe Wisconsin case, detected under USDA's National Milk Testing Strategy, has not led to additional herd infections, APHIS said.\nUSDA said the findings do not pose a risk to consumer health or the commercial milk supply, as pasteurization kills the virus and milk from affected animals is diverted or destroyed.\nIt added that the Centers for Disease Control and Prevention continues to consider the risk to the public to be low.\nUSDA urged dairy producers to maintain strict biosecurity and report any livestock showing clinical signs or unusual wildlife deaths.\nA bipartisan group of U.S. senators last week urged the administration of President Donald Trump to finalize a science-based pla",
        "authors": "None",
        "publish_date": "2025-12-20 00:59:17",
        "published_at_raw": "2025-12-20T00:59:17Z",
        "meta_site_name": "MarketScreener",
        "description": "The United States Department of Agriculture on Friday confirmed that a case of highly pathogenic avian influenza in a Wisconsin dairy herd marked a new spillover event from wildlife to cattle,...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8d8d7c57ee2f3d0024897a8775a309e4",
        "title": "USDA Confirms Bird Flu Case in Wisconsin Dairy Herd as New Wildlife Spillover",
        "doc_url": "https://www.usnews.com/news/us/articles/2025-12-19/usda-confirms-bird-flu-case-in-wisconsin-dairy-herd-as-new-wildlife-spillover",
        "all_text": "Dec 19 (Reuters) - The United States Department ‌of ​Agriculture on Friday confirmed ‌that a case of highly pathogenic avian influenza ​in a Wisconsin dairy herd marked a new spillover event from ‍wildlife to cattle, separate ​from previous outbreaks.\nThe virus, identified as H5N1 clade 2.3.4.4b ​genotype D1.1., ⁠was confirmed through whole genome sequencing by the National Veterinary Services Laboratories on December 17, USDA’s Animal and Plant Health Inspection Service said in a statement.\nIt said most detections of highly pathogenic ‌avian influenza in U.S. dairy herds have resulted from movements linked ​to an ‌original spillover event that ‍occurred ⁠in Texas in late 2023, involving the B3.13 strain.\nEarlier this year, two isolated spillovers were detected in Nevada and Arizona, involving the D1.1 strain.\nThe Wisconsin case, detected under USDA's National Milk Testing Strategy, has not led to additional herd infections, APHIS said.\nUSDA said the findings ​do not pose a risk to consumer health or the commercial milk supply, as pasteurization kills the virus and milk from affected animals is diverted or destroyed.\nIt added that the Centers for Disease Control and Prevention continues to consider the risk to the public to be low.\nUSDA urged dairy producers to maintain strict biosecurity and report any livestock showing clinical signs or unusual wildlife deaths.\nA bipartisan ​group of U.S. senators last week urged the administration of President Donald Trump to finalize a sc",
        "authors": "None",
        "publish_date": "2025-12-20 00:59:00",
        "published_at_raw": "2025-12-20T00:59:00Z",
        "meta_site_name": "U.S. News & World Report",
        "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]