[
    {
        "id": "092d4be45aeb363c73a97344c338f829",
        "title": "Corn Slipping Lower at Monday’s Midday",
        "doc_url": "https://www.barchart.com/story/news/37363716/corn-slipping-lower-at-mondays-midday",
        "all_text": "Corn futures are trading with 2 to 3 1/4 cent losses so far at midday. The CmdtyView national average Cash Corn price is down 2 3/4 cents at $3.91 1/2. Crude oil is down $3.48/barrel, with the US dollar index up $0.586.\nMonday morning’s Export Inspections report showed 1.136 MMT (44.74 mbu) of corn shipped in the week of 1/29. That was 9.88% below the week prior and 26.55% shy of the same week last year. Japan was the largest destination of 444,439 MT, with 260,227 MT shipped to Mexico and 147,478 MT to Colombia. The marketing year total is now 32.611 MMT (1.284 bbu) of corn shipped since September, which is still 49.86% above the same period last year.\nJust prior to midday, President Trump issued a Truth Social post that a call with India’s President Modi went well with the US lowering tariffs on the country from 25% to 18% and India agreeing to buy over $500 billion of US energy, technology, agricultural, coal and other products. India has historically been a top 3 to 4 buyer of US ethanol.\nCommitment of Traders data from CFTC showed managed money speculators in corn futures and options trimming 9,274 contracts from their net short in the week ending on January 27. That mainly came via new longs, as the net short was at 72,050 contracts. Commercials saw some long reduction, with the net short rising 17,381 contracts to 187,342 contracts.\nAgRural estimates the Brazilian first corn crop at 10% harvested, lagging the 14% pace from last year. The second crop is at 13% planted, ",
        "authors": "None",
        "publish_date": "2026-02-02 18:17:30",
        "published_at_raw": "2026-02-02T18:17:30Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with 2 to 3 1/4 cent losses so far at midday. The CmdtyView national average Cash Corn price is down 2 3/4 cents at $3.91 1/2. Crude oil is down $3.48/barrel, with the US dollar index up $0.586. Monday morning’s Export Inspec...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9f617403db1537066dbdd28e1d4f76fa",
        "title": "Soybean Losses to Pushing to Monday",
        "doc_url": "https://www.barchart.com/story/news/37363726/soybean-losses-to-pushing-to-monday",
        "all_text": "Soybeans are showing 5 to 6 cent losses at Monday’s midday. The cmdtyView national average Cash Bean price is 4 1/4 cents lower at $9.93 1/4. Soymeal futures are 30 to 50 cents higher, with Soy Oil futures are down 52 points\nUSDA’s FGIS tallied soybean export shipments at 1.31 MMT (48.15 mbu) during the week ending on January 29. That was 1.9% below the week prior but 14.9% above the same week last year. China was the top destination of 740,004 MT, with 137,596 MT headed to Mexico and 121,059 MT to Egypt. Marketing year exports for 2025/26 are 21.99 MMT (808 mbu) since September 1, which is now 35.7% below the same period last year and has closed the gap since early January by nearly 10 percentage points.\nJust prior to midday, President Trump issued a Truth Social post that a call with India’s President Modi went well with the US lowering tariffs on the country from 25% to 18% and India agreeing to buy over $500 billion of US energy, technology, agricultural, coal and other products. India has historically been a top 5 buyer of US bean oil and was the top buyer in 2025.\nCFTC Commitment of Traders data showed spec funds in soybean futures and options adding 7,261 contracts to their net long soybean futures and options as of January 27. They too that net position to a net long of 17,321 contracts,\nUSDA should release crush data later today, with traders looking for 230.4 mbu of soybeans crushed during December.\nBrazil’s soybean crop is estimated at 10% harvested as of Thursday ",
        "authors": "None",
        "publish_date": "2026-02-02 18:17:30",
        "published_at_raw": "2026-02-02T18:17:30Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are showing 5 to 6 cent losses at Monday’s midday. The cmdtyView national average Cash Bean price is 4 1/4 cents lower at $9.93 1/4. Soymeal futures are 30 to 50 cents higher, with Soy Oil futures are down 52 points USDA’s FGIS tallied soybe...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ffab6ce97b69a06243ac3ddc500345d0",
        "title": "3 Big Things Today, Feb. 2, 2026",
        "doc_url": "https://www.agriculture.com/3-big-things-today-feb-2-2026-11897247",
        "all_text": "1. Grain, Soybean Futures Lower in Overnight Trading\nGrain and soybean futures were lower in overnight trading as the dollar rebounded slightly and on signs of strong demand for U.S. agricultural products.\nThe U.S. dollar index has risen almost 1% since Thursday after previously dropping to the lowest level in four years.\nA weaker dollar makes U.S. supplies more attractive to overseas buyers, so the greenback's reversal to an improvement against a basket of its global counterparts has the opposite effect.\nDemand for corn and wheat since the beginning of the grains' respective marketing year has been robust. Soybean exports have lagged year-earlier levels after a monthslong tariff war between the U.S. and China that came to a halt at the end of October when the countries signed a trade agreement.\nCorn exports since the start of the marketing year on Sept. 1 are now at 32.1 million metric tons, up 53% year over year, according to USDA. Wheat shipments since the start of the grain's season on June 1 were reported at 16.2 million metric tons, a 21% jump.\nSoybean exports, meanwhile, are down 38% year over year to 20.5 million metric tons, the agency said.\nStill, ample global supplies continue to weigh on prices.\nSoybean exports were down 38% year over year to 20.5 million metric tons. Shipments of the oilseeds were down due to the tariff wars between the U.S. and China that ended at the end of October.\nCorn futures for March delivery fell 1 3/4¢ to $4.26 1/2 a bushel overnight on ",
        "authors": "None",
        "publish_date": "2026-02-02 12:31:24",
        "published_at_raw": "2026-02-02T12:31:24Z",
        "meta_site_name": "Successful Farming",
        "description": "3 Big Things Today: Grain and soybean futures were lower overnight. Cattle inventory on Jan. 1 falls slightly to multi-year low. Snow expected today in parts of Iowa and Nebraska.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "111429d2d0debac3da496369fd0e3f3a",
        "title": "How Much Higher Can Wheat Prices Trend Here?",
        "doc_url": "https://www.barchart.com/story/news/37361438/how-much-higher-can-wheat-prices-trend-here",
        "all_text": "May soft red winter wheat (ZWK26) futures present a buying opportunity on fresh price strength.\nSee on the daily bar chart for May soft red winter wheat futures that prices are trending higher. See, too, at the bottom of the chart that the moving average convergence divergence (MACD) indicator is in a bullish posture as the blue MACD line is above the red trigger line and both lines are trending up.\nFundamentally, there are trader concerns over potential wheat-crop winterkill damage from recent cold weather in U.S. and Russia wheat regions. Supply disruptions from shipping in the Black Sea region, due to the Russia-Ukraine war, are also a price-friendly element for the wheat markets.\nA move in May SRW wheat futures above chart resistance at last week’s high of $5.52 3/4 would give the bulls fresh power and it would also become a buying opportunity. The upside price objective would be $6.05, or above. Technical support, for which to place a protective sell stop just below, is located at $5.30.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in nature.\nHere is what the Commodity Futures Trading Commission (CFTC) has said about futures trading (and I agree 100%):\nTrad",
        "authors": "None",
        "publish_date": "2026-02-02 16:16:15",
        "published_at_raw": "2026-02-02T16:16:15Z",
        "meta_site_name": "Barchart",
        "description": "May soft red winter wheat futures present a buying opportunity on fresh price strength.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "56277c88b269e9491eb5b4f21a8ede19",
        "title": "M&S shares new Colin the Caterpillar cake that shoppers have been begging for",
        "doc_url": "https://www.bristolpost.co.uk/whats-on/food-drink/ms-shares-new-colin-caterpillar-10790600",
        "all_text": "The Made Without Wheat cake is now available in M&S stores and on Ocado for £9.50, the same price as the original. It comes after responding to thousands of requests over the years\nIt's been 35 years since M&S first launched its cherished Colin the Caterpillar cake, and it's since become a cornerstone of countless celebrations, from birthday gatherings to wedding festivities - or simply as a midweek treat.\nThroughout this period, numerous alternative Colin variations have emerged, encompassing miniature versions, assorted confectionery, and most recently, an ice cream version called Arctic Colin the Caterpillar, which debuted in August 2025. Nevertheless, customers have persistently pleaded with the retail giant to introduce one particular version that would enhance accessibility for those with dietary restrictions or allergies. Following years of anticipation and persistent requests, this dream has finally come true.\nM&S has announced that responding to thousands of requests over the years, a gluten-free variant of its well-loved Colin the Caterpillar cake has at last become a reality, as it launched in stores nationwide on 28 January.\nSharing the announcement on Instagram, they posted: \"It is by FAR the most requested @official_colinthecaterpillar innovation on our socials, and now, for the first time in Colin's 35 year history... we've made him gluten free!\"\nThe retailer revealed this gluten-free creation had been under development for several years before reaching the hig",
        "authors": "None",
        "publish_date": "2026-02-02 13:06:24",
        "published_at_raw": "2026-02-02T13:06:24Z",
        "meta_site_name": "Bristol Post",
        "description": "The Made Without Wheat cake is now available in M&S stores and on Ocado for £9.50, the same price as the original. It comes after responding to thousands of requests over the years",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c4793007a47b65ecbf7b7744987aa40f",
        "title": "USDA to release flies near US-Mexico border to fight screwworm pest",
        "doc_url": "https://www.straitstimes.com/world/united-states/usda-to-release-flies-near-us-mexico-border-to-fight-screwworm-pest",
        "all_text": "CHICAGO - The US Department of Agriculture (USDA) will disperse glow-in-the dark, sterile flies in Mexico, closer to the US border, and in southern Texas, as officials race to keep flesh-eating New World screwworm pests from spreading in Mexico, the agency said.\nScrewworms are parasitic flies whose females lay eggs in wounds on warm-blooded animals, often livestock.\nOnce the eggs hatch, hundreds of screwworm larvae use their sharp mouths to burrow through living flesh, eventually killing their host if left untreated.\nThe USDA has halted US imports of Mexican livestock to keep out the pest, worsening a cattle shortage that has pushed beef prices to record highs for consumers.\nThe agency also produces 100 million sterile flies per week at a facility in Panama and disperses them in Mexico to prevent wild screwworm flies from reproducing.\nNow, the agency says, it is going to take the same flies further north near the border.\nThe shift came after the USDA has reported 20 screwworm infestations since Dec 26 in animals in the Mexican state of Tamaulipas, which borders southern Texas.\n“Given that we need to protect Texas and the US, I think it’s definitely something that had to be done,” Professor Sonja Swiger, an entomologist at Texas A&M University, said on Feb 2 .\nMore sterile flies needed\nExperts said the USDA needs well more than 100 million sterile flies per week to eradicate the pest in Mexico.\nThe agency announced in 2025 that it intended to build a production facility in Tex",
        "authors": "None",
        "publish_date": "2026-02-02 23:57:00",
        "published_at_raw": "2026-02-02T23:57:00Z",
        "meta_site_name": "The Straits Times",
        "description": "Screwworms are parasitic flies whose females lay eggs in wounds on warm-blooded animals. Read more at straitstimes.com.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2e24a6579abdf480a6796ce2840bae9b",
        "title": "USDA to release flies near US-Mexico border to fight screwworm pest",
        "doc_url": "https://www.marketscreener.com/news/usda-to-release-flies-near-us-mexico-border-to-fight-screwworm-pest-ce7e5bd2da8bf127",
        "all_text": "CHICAGO, Feb 2 (Reuters) - The U.S. Department of Agriculture will disperse glow-in-the dark, sterile flies in Mexico, closer to the U.S. border, and in southern Texas, as officials race to keep flesh-eating New World screwworm pests from spreading in Mexico, the agency said.\nScrewworms are parasitic flies whose females lay eggs in wounds on warm-blooded animals, often livestock. Once the eggs hatch, hundreds of screwworm larvae use their sharp mouths to burrow through living flesh, eventually killing their host if left untreated.\nThe USDA has halted U.S. imports of Mexican livestock to keep out the pest, worsening a cattle shortage that has pushed beef prices to record highs for consumers.\nThe agency also produces 100 million sterile flies per week at a facility in Panama and disperses them in Mexico to prevent wild screwworm flies from reproducing. Now, the agency says, it is going to take the same flies further north near the border.\nThe shift came after the USDA has reported 20 screwworm infestations since December 26 in animals in the Mexican state of Tamaulipas, which borders southern Texas.\n\"Given that we need to protect Texas and the U.S., I think it's definitely something that had to be done,\" Sonja Swiger, an entomologist at Texas A&M University, said on Monday.\nMORE STERILE FLIES NEEDED\nExperts said the USDA needs well more than 100 million sterile flies per week to eradicate the pest in Mexico. The agency announced last year that it intended to build a production ",
        "authors": "None",
        "publish_date": "2026-02-02 22:28:32",
        "published_at_raw": "2026-02-02T22:28:32Z",
        "meta_site_name": "MarketScreener",
        "description": "The U.S. Department of Agriculture will disperse glow-in-the dark, sterile flies in Mexico, closer to the U.S. border, and in southern Texas, as officials race to keep flesh-eating New World screwworm...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5e08afef1fdb75b51d106e2975ba30ef",
        "title": "USDA to release flies near US-Mexico border to fight screwworm pest",
        "doc_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/usda-release-flies-near-us-mexico-border-fight-screwworm-pest-2026-02-02/",
        "all_text": "CHICAGO, Feb 2 (Reuters) - The U.S. Department of Agriculture will disperse glow-in-the dark, sterile flies in Mexico, closer to the U.S. border, and in southern Texas, as officials race to keep flesh-eating New World screwworm pests from spreading in Mexico, the agency said.\nScrewworms are parasitic flies whose females lay eggs in wounds on warm-blooded animals, often livestock. Once the eggs hatch, hundreds of screwworm larvae use their sharp mouths to burrow through living flesh, eventually killing their host if left untreated.\nSign up here.\nThe USDA has halted U.S. imports of Mexican livestock to keep out the pest, worsening a cattle shortage that has pushed beef prices to record highs for consumers.\nThe agency also produces 100 million sterile flies per week at a facility in Panama and disperses them in Mexico to prevent wild screwworm flies from reproducing. Now, the agency says, it is going to take the same flies further north near the border.\nThe shift came after the USDA has reported 20 screwworm infestations since December 26 in animals in the Mexican state of Tamaulipas, which borders southern Texas.\n\"Given that we need to protect Texas and the U.S., I think it's definitely something that had to be done,\" Sonja Swiger, an entomologist at Texas A&M University, said on Monday.\nMORE STERILE FLIES NEEDED\nExperts said the USDA needs well more than 100 million sterile flies per week to eradicate the pest in Mexico. The agency announced last year that it intended to build",
        "authors": "None",
        "publish_date": "2026-02-02 22:27:56",
        "published_at_raw": "2026-02-02T22:27:56Z",
        "meta_site_name": "Reuters",
        "description": "The U.S. Department of Agriculture will disperse glow-in-the dark, sterile flies in Mexico, closer to the U.S. border, and in southern Texas, as officials race to keep flesh-eating New World screwworm pests from spreading in Mexico, the agency said.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3b40f41ce968e66027da350343463a25",
        "title": "USDA's Glow-in-the-Dark Flies Battle Mexican Screwworm Spread",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3791147-usdas-glow-in-the-dark-flies-battle-mexican-screwworm-spread",
        "all_text": "The U.S. Department of Agriculture is taking innovative measures to prevent the spread of New World screwworms by releasing glow-in-the-dark, sterile flies in Mexico and southern Texas. This strategic move aims to combat an increase in infestations that pose significant threats to livestock.\nRecent reports revealed 20 screwworm infestations since late December in Tamaulipas, Mexico, prompting the USDA to establish a 'buffer zone' 50 miles into Texas. The agency plans to significantly increase the production of sterile flies, aiming to contain the pest and reduce its impact on the beef market.\nTo distinguish sterile flies from the harmful wild populations, fluorescent dye will be applied, allowing them to glow under UV light. The USDA's swift actions align with Mexico's technical proposals, as both countries strive to protect their livestock industries from the dreaded screwworm.\n(With inputs from agencies.)",
        "authors": "None",
        "publish_date": "2026-02-02 22:27:56",
        "published_at_raw": "2026-02-02T22:27:56Z",
        "meta_site_name": "Devdiscourse",
        "description": "The USDA is deploying glow-in-the-dark, sterile flies in Mexico and southern Texas to prevent the spread of parasitic screwworms, which threaten livestock. With recent infestations reported in Tamaulipas, the agency plans to create a 'buffer zone' near the U.S. border and boost sterile fly production efforts.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e84801c374d62d50135428d889ee1ad2",
        "title": "USDA to Release Flies Near US-Mexico Border to Fight Screwworm Pest",
        "doc_url": "https://www.usnews.com/news/top-news/articles/2026-02-02/usda-to-release-flies-near-us-mexico-border-to-fight-screwworm-pest",
        "all_text": "By Tom Polansek\nCHICAGO, Feb 2 (Reuters) - The U.S. Department of Agriculture will disperse glow-in-the dark, ‌sterile ​flies in Mexico, closer to the U.S. border, and ‌in southern Texas, as officials race to keep flesh-eating New World screwworm pests from spreading in Mexico, the agency ​said.\nScrewworms are parasitic flies whose females lay eggs in wounds on warm-blooded animals, often livestock. Once the eggs hatch, hundreds of screwworm larvae use their sharp mouths to burrow ‍through living flesh, eventually killing their host if ​left untreated.\nThe USDA has halted U.S. imports of Mexican livestock to keep out the pest, worsening a cattle shortage that has pushed beef prices to record highs for ​consumers.\nThe agency also produces ⁠100 million sterile flies per week at a facility in Panama and disperses them in Mexico to prevent wild screwworm flies from reproducing. Now, the agency says, it is going to take the same flies further north near the border.\nThe shift came after the USDA has reported 20 screwworm infestations since December 26 in animals in the Mexican state of Tamaulipas, which borders southern Texas.\n\"Given that we need to protect Texas and the U.S., I think it's definitely ‌something that had to be done,\" Sonja Swiger, an entomologist at Texas A&M University, said on Monday.\nMORE STERILE FLIES NEEDED\nExperts said the USDA needs well ​more ‌than 100 million sterile flies per ‍week to eradicate the pest in ⁠Mexico. The agency announced last year that it in",
        "authors": "None",
        "publish_date": "2026-02-02 22:27:00",
        "published_at_raw": "2026-02-02T22:27:00Z",
        "meta_site_name": "U.S. News & World Report",
        "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f64e8d7811f7aab7584c47d6d64c8874",
        "title": "Extending the Cattle Cycle With Still Lower Inventories",
        "doc_url": "https://www.agriculture.com/partners-extending-the-cattle-cycle-with-still-lower-inventories-11897766",
        "all_text": "By Jason Franken\nThe USDA’s cattle inventory report places the total number of cattle and calves on Jan. 1 at 86.7 million head, consistent with pre-report expectations that it would be down 0.4% from a year ago, as the industry continues into a seventh consecutive year of contraction within the cattle cycle. Though near trade expectations, the report indicates smaller beef cow and beef replacement heifer inventories, and a smaller calf crop than anticipated, as some analysts contemplated that some herd expansion could initiate a seemingly two-years past-due start of a new cattle cycle. Like last year, the report again confirms anticipated year over year drops across most inventory categories with fewer beef cows than any time since 1960 and the lowest total inventory since 1951.\nAll cows and heifers that have calved total 37.2 million head, just 0.3% below last year, balancing 2% more dairy cows at 9.7 million head with 1% fewer beef cows at 27.6 million head, compared to expectations the latter would be even-to-slightly-higher. Bulls over 500 pounds are up about 0.3%, while same weight steers and heifers not intended for replacements are both down 0.6% and 1.5%, respectively, and calves under 500 pounds are also down 0.1% from a year ago. Beef replacement heifers are up 0.9%, compared to pre-report estimates of 1.7% higher, while dairy replacements are down 0.3% from a year ago. The calf crop, at 32.9 million head, is 1.6% below a year ago, which remains bullish for feeder ",
        "authors": "None",
        "publish_date": "2026-02-02 20:54:53",
        "published_at_raw": "2026-02-02T20:54:53Z",
        "meta_site_name": "Successful Farming",
        "description": "The USDA’s cattle inventory report places the total number of cattle and calves on Jan. 1 at 86.7 million head, consistent with pre-report expectations that it would be down 0.4% from a year ago, as the industry continues into a seventh consecutive year of contraction within the cattle cycle.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "14a1372762f9cb67746aedd834a63d46",
        "title": "A preemptive strike: Texas mobilizes against a looming parasitic threat",
        "doc_url": "https://www.naturalnews.com/2026-02-02-texas-mobilizes-against-a-looming-parasitic-threat.html",
        "all_text": "Texas Governor Greg Abbott has issued a preemptive statewide disaster declaration to combat the potential spread of the New World Screwworm.\nThe parasitic fly, currently moving northward in Mexico, is a flesh-eating pest that infests wounds on livestock, wildlife, and humans.\nA new state response team will coordinate with federal agencies, including the USDA, which is investing heavily in sterile fly production technology.\nThe U.S. eradicated the screwworm in 1966, but a modern outbreak could cause billions in economic damage to the livestock industry.\nThe declaration is a preventative measure; the parasite has not yet been detected within U.S. borders.\nIn an unprecedented move to protect the nation’s food supply and agricultural economy, Texas Governor Greg Abbott has issued a statewide disaster declaration against a pest that is not yet within its borders. The action, announced Thursday, mobilizes state resources to prevent the northward spread of the New World Screwworm, a devastating flesh-eating parasite advancing through Mexico toward the U.S. The declaration empowers a newly formed response team to collaborate with the U.S. Department of Agriculture in a high-stakes campaign to keep the parasite out of American livestock herds, underscoring the severe economic and animal welfare consequences of a potential breach.\nThe Anatomy of a Crisis\nThe New World Screwworm is not a typical insect nuisance. It is a parasitic fly whose larvae feed on the living tissue of warm-bloode",
        "authors": "None",
        "publish_date": "2026-02-02 12:16:06",
        "published_at_raw": "2026-02-02T12:16:06Z",
        "meta_site_name": "Natural News",
        "description": "Texas Governor Greg Abbott has issued a preemptive statewide disaster declaration to combat the potential spread of the New World Screwworm. The parasitic fly, currently moving northward in Mexico, is a flesh-eating pest that infests wounds on livestock, wildlife, and humans. A new state response team will coordinate with federal agencies, including the USDA, which […]",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]