[
    {
        "id": "0ed348a64883e6fb3501f5d91b203f3c",
        "title": "Corn Closes with Tuesday Strength",
        "doc_url": "https://www.barchart.com/story/news/6431/corn-closes-with-tuesday-strength",
        "all_text": "Corn futures were 2 to 3 cents higher at the Tuesday close. The CmdtyView national average Cash Corn price was up 2 1/2 cents at $3.94 1/4.\nEIA data will be released on Wednesday morning, with most expecting to see a reduction in ethanol output for the week ending on January 30.\nNASS released their monthly Grain Crushings report on Monday afternoon, with December corn used for ethanol at 488.26 million bushels. That was a record high for the month and was 5.1% above the same week last month. Marketing year corn used in ethanol production is at 1.863 billion bushels, up 1.1 million bushels from the same period last year.\nA South Korean importer purchased a total of 134,000 MT of corn in a tender overnight.\nMar 26 Corn closed at $4.28 1/2, up 2 3/4 cents,\nNearby Cash was $3.94 1/4, up 2 1/2 cents,\nMay 26 Corn closed at $4.35 3/4, up 2 1/4 cents,\nJul 26 Corn closed at $4.42, up 2 1/4 cents,",
        "authors": "None",
        "publish_date": "2026-02-03 23:16:40",
        "published_at_raw": "2026-02-03T23:16:40Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures were 2 to 3 cents higher at the Tuesday close. The CmdtyView national average Cash Corn price was up 2 1/2 cents at $3.94 1/4. EIA data will be released on Wednesday morning, with most expecting to see a reduction in ethanol output for...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0ef0f44247751b23021ad61bdbcd86d2",
        "title": "Corn Posting Midday Gains on Tuesday",
        "doc_url": "https://www.barchart.com/story/news/1187/corn-posting-midday-gains-on-tuesday",
        "all_text": "Corn futures are trading with 2 to 3 cent gains at midday. The CmdtyView national average Cash Corn price is up 2 1/2 cents at $3.94 1/4.\nNASS released their monthly Grain Crushings report on Monday afternoon, with December corn used for ethanol at 488.26 million bushels. That was a record high for the month and was 5.1% above the same week last month. Marketing year corn used in ethanol production is at 1.863 billion bushels, up 1.1 million bushels from the same period last year.\nA South Korean importer purchased a total of 134,000 MT of corn in a tender overnight.\nMar 26 Corn is at $4.28 1/2, up 2 3/4 cents,\nNearby Cash is at $3.94 1/4, up 2 1/2 cents,\nMay 26 Corn is at $4.36 1/4, up 2 3/4 cents,\nJul 26 Corn is at $4.42 1/4, up 2 1/2 cents,",
        "authors": "None",
        "publish_date": "2026-02-03 18:21:51",
        "published_at_raw": "2026-02-03T18:21:51Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with 2 to 3 cent gains at midday. The CmdtyView national average Cash Corn price is up 2 1/2 cents at $3.94 1/4. NASS released their monthly Grain Crushings report on Monday afternoon, with December corn used for ethanol at...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d23cfbe86b52839e828482f7542963c3",
        "title": "Corn Slightly Higher on Tuesday Morning",
        "doc_url": "https://www.barchart.com/story/news/37380886/corn-slightly-higher-on-tuesday-morning",
        "all_text": "Corn price action is up 1 to 2 cents so far on Tuesday morning. Futures were down 2 to 3 cents in the front months at Monday’s close. Open interest on Monday showed new selling, up 12,836 contracts on the losses. The CmdtyView national average Cash Corn price was down 1 3/4 cents at $3.92 1/2. Crude oil was down $2.56/barrel, with the US dollar index up $0.581.\nNASS released their monthly Grain Crushings report on Monday afternoon, with December corn used for ethanol at 488.26 million bushels. That was a record high for the month and was 5.1% above the same week last month. Marketing year corn used in ethanol production is at 1.863 billion bushels, up 1.1 million bushels from the same period last year.\nMonday morning’s Export Inspections report showed 1.136 MMT (44.74 mbu) of corn shipped in the week of 1/29. That was 9.88% below the week prior and 26.55% shy of the same week last year. Japan was the largest destination of 444,439 MT, with 260,227 MT shipped to Mexico and 147,478 MT to Colombia. The marketing year total is now 32.611 MMT (1.284 bbu) of corn shipped since September, which is still 49.86% above the same period last year.\nOn Monday President Trump issued a Truth Social post that a call with India’s President Modi went well with the US lowering tariffs on the country from 25% to 18% and India agreeing to buy over $500 billion of US energy, technology, agricultural, coal and other products. India has historically been a top 3 to 4 buyer of US ethanol.\nStoneX estim",
        "authors": "None",
        "publish_date": "2026-02-03 13:22:28",
        "published_at_raw": "2026-02-03T13:22:28Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is up 1 to 2 cents so far on Tuesday morning. Futures were down 2 to 3 cents in the front months at Monday’s close. Open interest on Monday showed new selling, up 12,836 contracts on the losses. The CmdtyView national average Cash C...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "313dc4b74f9b65806b7fb2cc9fa3324a",
        "title": "NYC grocers brace for price hikes on Oreos, Wheat Thins and more as distributor retreats from city",
        "doc_url": "https://nypost.com/2026/02/03/business/nyc-grocers-brace-for-price-hikes-on-oreos-wheat-thins-and-more-as-distributor-retreats-from-city/",
        "all_text": "Prices for name-brand snacks including Oreos, Triscuits, Chips Ahoy and Ritz crackers are poised to spike at supermarkets across New York City as the junk-food conglomerate that makes them shrinks distribution, The Post has learned.\nA $5.99 package of Oreos and a $5.99 box of Ritz crackers could rise as much as $1 each by the end of the month, grocery executives said. That’s when Mondelez International — which also makes Clif Bars, Hall’s cough drops and Philadelphia cream cheese — will stop direct deliveries to 1,000 independent grocers across the city.\nIn a Jan. 10 letter from its in-house counsel obtained by The Post, Mondelez told grocers that it will no longer make deliveries directly to their stores as it “moves to a new operating model.”\nChains that will be affected include Foodtown, Key Food, Bravo and C-Town, according to the National Supermarket Association, which represents the stores. Gristedes stores will also see Mondelez deliveries stop, the company confirmed to The Post.\nBodegas won’t be impacted since they already use independent distributors, as does the Morton Williams chain, industry executives said.\nShoppers who are paying $4.99 for a one-pound package of Chips Ahoy this month will likely pay $5.99 starting in March, while a 12.5-ounce box of Triscuits could go up $1 to $5.99, said Nelson Eusebio, the the National Supermarket Association’s government relations head.\n“There is outrage about expensive food and this is going to increase consumers’ costs,” he",
        "authors": "None",
        "publish_date": "2026-02-03 22:26:54",
        "published_at_raw": "2026-02-03T22:26:54Z",
        "meta_site_name": "New York Post",
        "description": "Prices for name-brand snacks including Oreos, Triscuits, Chips Ahoy and Ritz crackers are poised to spike at supermarkets across New York City as the junk-food conglomerate that makes them shrinks distribution, The Post has learned.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6b1c8dc6e79558de41bed04b343a7a54",
        "title": "Hogs Extend Higher on Tuesday",
        "doc_url": "https://www.barchart.com/story/news/6471/hogs-extend-higher-on-tuesday",
        "all_text": "Lean hog futures closed with Monday gains of 80 cents to $1.55 in the front months. USDA’s national base hog price was reported at $86.37 on Tuesday afternoon, up $4.15 from the Monday report. The CME Lean Hog Index was back down 7 cents on Jan 30 at $85.71.\nUSDA’s pork carcass cutout value from Tuesday afternoon report was $1.67 higher to $97.37 per cwt. The rib and belly were the only primals reported higher, with the Rib up $5.06 and belly $15.32 higher. USDA estimated federally inspected hog slaughter on Tuesday was 487,000 head, taking the weekly total to 931,000 head. That was 33,000 head above last week but 32,851 head below the same week last year.\nFeb 26 Hogs closed at $88.550, up $0.800,\nApr 26 Hogs closed at $98.150, up $1.525\nMay 26 Hogs closed at $101.925, up $1.300,",
        "authors": "None",
        "publish_date": "2026-02-03 23:16:40",
        "published_at_raw": "2026-02-03T23:16:40Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed with Monday gains of 80 cents to $1.55 in the front months. USDA’s national base hog price was reported at $86.37 on Tuesday afternoon, up $4.15 from the Monday report. The CME Lean Hog Index was back down 7 cents on Jan 30 at...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d33ac918e4777054d0a0d37198b1820b",
        "title": "Modeling finds old-growth wildfire risk highest where low-severity fires once burned",
        "doc_url": "https://phys.org/news/2026-02-growth-wildfire-highest-severity.html",
        "all_text": "A new analysis shows that the Pacific Northwest's mature and old-growth forests are most at risk of severe wildfire in areas that historically burned frequently at lower severity. The study by scientists at Oregon State University and USDA Forest Service Research & Development is important because those forests are culturally, economically and ecologically significant, supporting biodiversity while storing vast amounts of carbon, and they are under increasing threat of stand-replacing wildfire.\nThe work appears in npj Natural Hazards.\nResearchers used state-of-the-art modeling techniques to gain knowledge that could help guide risk mitigation efforts and return forests to healthier fire regimes.\nLed by Bruno Aparicio and Meg Krawchuk of the OSU College of Forestry, the research highlights the impact of fire exclusion by showing that 75% of the forest areas with the biggest risk of severe wildfire are places that used to see widespread low- and mixed-severity fires.\nThe exclusion of fire from Northwest landscapes began with the disruption of Indigenous fire stewardship, the researchers say. Indigenous peoples were forcibly removed from their lands in the 1850s, and putting out wildfires became federal policy following the Great Fire of 1910, which destroyed several towns and burned an area roughly the size of Connecticut across forests in Idaho, Montana, Washington and British Columbia.\nPrior to fire exclusion, frequent low- and mixed-severity fires had played a key role in ma",
        "authors": "None",
        "publish_date": "2026-02-03 23:00:03",
        "published_at_raw": "2026-02-03T23:00:03Z",
        "meta_site_name": "Phys.org",
        "description": "A new analysis shows that the Pacific Northwest's mature and old-growth forests are most at risk of severe wildfire in areas that historically burned frequently at lower severity. The study by scientists at Oregon State University and USDA Forest Service Research & Development is important because those forests are culturally, economically and ecologically significant, supporting biodiversity while storing vast amounts of carbon, and they are under increasing threat of stand-replacing wildfire.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "37d2bead62f346f5b510c2488d35d2bd",
        "title": "Health Industry Faces Major Shifts Amid New Regulations and Market Dynamics",
        "doc_url": "https://www.devdiscourse.com/article/health/3792629-health-industry-faces-major-shifts-amid-new-regulations-and-market-dynamics",
        "all_text": "The European food safety body has prompted recalls in baby formula products from French producers due to advisories on the maximum level of cereulide toxin. Ingredients from a Chinese supplier, associated with giants like Nestle, have been flagged for containing the nausea-inducing toxin.\nIn another key development, Indian firm Mankind Pharma reported a rise in third-quarter profits, driven by the strong demand for drugs addressing chronic illnesses. The company achieved a net profit increase to 4.09 billion rupees, up from 3.8 billion the previous year.\nMeanwhile, the USDA is taking preventive measures against the spread of screwworm pests by releasing sterile flies near the US-Mexico border, highlighting a critical effort in protecting livestock from these dangerous parasitic insects.",
        "authors": "None",
        "publish_date": "2026-02-03 21:00:29",
        "published_at_raw": "2026-02-03T21:00:29Z",
        "meta_site_name": "Devdiscourse",
        "description": "Current developments in the health industry include EU's advisory on cereulide toxin levels in baby formula leading to product recalls, Mankind Pharma's profit boost, and USDA's efforts to control screwworms. Other highlights include delays in gender surgery recommendations and mixed results for Sanofi's experimental drug. Meanwhile, obesity drug markets face challenges.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "10d7df3dd1f65ad417185a70b5525da3",
        "title": "Corn Futures Rise on Hopes for Strong Exports -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/corn-futures-rise-on-hopes-for-strong-exports-daily-grain-highlights-ce7e5bd3dd80f62d",
        "all_text": "By Kirk Maltais\n--Corn for March delivery rose 0.7% to $4.28 3/4 a bushel on the Chicago Board of Trade Tuesday, turning higher as USDA data shows corn export sales well exceeding last year's pace.\n--Soybeans for March delivery rose 0.6% to $10.66 3/4 a bushel.\n--Wheat for March delivery rose 0.3% to $5.29 1/4 a bushel.\nHIGHLIGHTS\nStrong Showing: Sales of U.S. corn exports have been strong in the 2025/26 marketing year that began in September, said Cory Bratland of AgMarket.net in a note. \"If we continue to see strong export sales and inspections, there is a strong likelihood the USDA could increase the annual export projection on corn,\" said Bratland. Overall grain inspections remain ahead of last year's pace by nearly 50% at 32.6 million metric tons, the USDA said Monday. Corn demand has been a mover for the futures contract in recent months, and the announcement of a trade deal between the U.S. and India may spur even more strength for U.S. corn exports.\nCause and Effect: Futures for soybeans and soybean oil climbed after the Department of Treasury and the IRS published proposed regulations for the 45z tax credit -- a credit for clean fuel production under the One Big Beautiful Bill. The credit is now extended to fuel produced in the U.S. through December 2029, and is limited to fuel produced using feedstock grown in the U.S., Mexico, or Canada. The new proposal garnered applause from the American Soybean Association and the National Oilseed Processors Association, althoug",
        "authors": "None",
        "publish_date": "2026-02-03 20:26:18",
        "published_at_raw": "2026-02-03T20:26:18Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\n--Corn for March delivery rose 0.7% to $4.28 3/4 a bushel on the Chicago Board of Trade Tuesday, turning higher as USDA data shows corn export sales well exceeding last year's...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "da4fb950ed3e9e1a1768363ef5e1b668",
        "title": "Hogs Extending Higher on Tuesday",
        "doc_url": "https://www.barchart.com/story/news/1227/hogs-extending-higher-on-tuesday",
        "all_text": "Lean hog futures are up 80 cents to $1.60 in the front months. USDA’s national base hog price was reported at $86.27 on Tuesday morning, up $4.05 from the Monday afternoon total. The CME Lean Hog Index was back down 7 cents on Jan 30 at $85.71.\nUSDA’s pork carcass cutout value from Tuesday morning report was 35 cents higher to $96.05 per cwt. The loin and butt were the only primals reported lower. USDA estimated federally inspected hog slaughter on Monday was 461,000 head. That was 35,000 head above last Monday but 15,393 head below the same week last year.\nFeb 26 Hogs are at $88.550, up $0.800,\nApr 26 Hogs are at $98.225, up $1.600\nMay 26 Hogs are at $101.975, up $1.350,",
        "authors": "None",
        "publish_date": "2026-02-03 18:21:52",
        "published_at_raw": "2026-02-03T18:21:52Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are up 80 cents to $1.60 in the front months. USDA’s national base hog price was reported at $86.27 on Tuesday morning, up $4.05 from the Monday afternoon total. The CME Lean Hog Index was back down 7 cents on Jan 30 at $85.71. USDA’...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e9e03588db9b7f5ff6c144569ca781c9",
        "title": "US Domestic News Recap: From Screwworms to Super Bowl",
        "doc_url": "https://www.devdiscourse.com/article/politics/3791986-us-domestic-news-recap-from-screwworms-to-super-bowl",
        "all_text": "The USDA is set to unleash a unique method to combat screwworm pests at the US-Mexico border. Glow-in-the-dark, sterile flies will be released in Mexico and southern Texas by the U.S. Department of Agriculture, in an effort to contain the parasitic threat. The female screwworm flies lay eggs on warm-blooded animals, presenting a notable threat to livestock.\nThe U.S. House faces a deadline for restoring government operations, with voting anticipated on upcoming legislation designed to resolve a partial shutdown. Essential services have remained functional, minimizing disruption as debates over immigration enforcement continue to impact legislative progress.\nIn the realm of culture, President Trump has moved to reshape U.S. historical institutions by targeting elements he describes as 'anti-American'. This has sparked controversy and criticism, particularly from civil rights advocates, as actions include the dismantling of slavery exhibits and the restoration of Confederate monuments.",
        "authors": "None",
        "publish_date": "2026-02-03 13:04:30",
        "published_at_raw": "2026-02-03T13:04:30Z",
        "meta_site_name": "Devdiscourse",
        "description": "This summary covers diverse U.S. news, including the USDA's plan to release sterile flies to fight screwworm pests, legislative efforts to restore government funding, President Trump's moves against cultural institutions, and ongoing legal cases, among other topics. Highlights also include updates on immigration and major events such as the Super Bowl.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a2a0b6d0f8df932b106247dab7fc3294",
        "title": "Health Buzz: From Baby Formula Recalls to Genetic Breakthroughs",
        "doc_url": "https://www.devdiscourse.com/article/health/3791981-health-buzz-from-baby-formula-recalls-to-genetic-breakthroughs",
        "all_text": "Recent developments in the health sector cover a wide array of topics from strict regulations, pharmaceutical advances, to public health initiatives.\nIn a significant regulatory move, the European food safety body advised maximum toxin levels in baby formula, prompting several recalls. This affects major manufacturers using ingredients from a Chinese supplier.\nPharmaceuticals also saw advancements with Indian drugmaker Mankind Pharma reporting robust profits due to strong domestic demand. Meanwhile, Sanofi's genetic treatment shows promise, though it didn't meet all its objectives.",
        "authors": "None",
        "publish_date": "2026-02-03 13:01:12",
        "published_at_raw": "2026-02-03T13:01:12Z",
        "meta_site_name": "Devdiscourse",
        "description": "This summary highlights key developments in the health sector, including baby formula recalls due to toxins, pharmaceutical advances, and public health measures. Notable stories include stricter regulations on infant formula, progress in genetic disorder treatments, and the U.S. USDA's innovative approach to combating pests near the border.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "58bc873a3606364836dfdfc4ce80f03b",
        "title": "USDA to Release Flies Near U.S.-Mexico Border to Fight Screwworm Pest",
        "doc_url": "https://www.agriculture.com/partners-usda-to-release-flies-near-u-s-mexico-border-to-fight-screwworm-pest-11898163",
        "all_text": "By Tom Polansek\nCHICAGO, Feb. 2 (Reuters) - The U.S. Department of Agriculture will disperse glow-in-the dark, sterile flies in Mexico, closer to the U.S. border, and in southern Texas, as officials race to keep flesh-eating New World screwworm pests from spreading in Mexico, the agency said.\nScrewworms are parasitic flies whose females lay eggs in wounds on warm-blooded animals, often livestock. Once the eggs hatch, hundreds of screwworm larvae use their sharp mouths to burrow through living flesh, eventually killing their host if left untreated.\nThe USDA has halted U.S. imports of Mexican livestock to keep out the pest, worsening a cattle shortage that has pushed beef prices to record highs for consumers.\nThe agency also produces 100 million sterile flies per week at a facility in Panama and disperses them in Mexico to prevent wild screwworm flies from reproducing. Now, the agency says, it is going to take the same flies further north near the border.\nThe shift came after the USDA has reported 20 screwworm infestations since December 26 in animals in the Mexican state of Tamaulipas, which borders southern Texas.\n\"Given that we need to protect Texas and the U.S., I think it's definitely something that had to be done,\" Sonja Swiger, an entomologist at Texas A&M University, said on Monday.\nMore Sterile Flies Needed\nExperts said the USDA needs well more than 100 million sterile flies per week to eradicate the pest in Mexico. The agency announced last year that it intended to bu",
        "authors": "None",
        "publish_date": "2026-02-03 11:54:39",
        "published_at_raw": "2026-02-03T11:54:39Z",
        "meta_site_name": "Successful Farming",
        "description": "The USDA will disperse glow-in-the dark, sterile flies in Mexico, closer to the U.S. border, and in southern Texas, as officials race to keep flesh-eating New World screwworm pests from spreading in Mexico, the agency said.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "58b89a1e32d7b9dba888ec754e5a5a06",
        "title": "European Toxin Limits, USDA's Fly Strategy, and Global Medical Advances: A Health News Roundup",
        "doc_url": "https://www.devdiscourse.com/article/health/3791285-european-toxin-limits-usdas-fly-strategy-and-global-medical-advances-a-health-news-roundup",
        "all_text": "The European food safety watchdog's recommendation to cap cereulide toxin levels in infant formulas has led several French producers to recall affected batches. The toxin, sourced from a Chinese supplier, poses health risks, prompting major formula makers like Nestle, Danone, and Lactalis to scrutinize their supply chains.\nThe USDA is ramping up efforts to prevent the spread of screwworm pests in southern Texas and along the U.S.-Mexico border by releasing sterile, genetically modified flies. This initiative aims to protect livestock from these flesh-eating parasites, which could devastate agricultural sectors if left unchecked.\nIn medical advancements, a Spanish hospital made headlines with a pioneering face transplant from a donor who opted for assisted dying, while in regulatory news, the FDA rejected Aquestive's allergy treatment due to packaging concerns, impacting its market entry strategy. Meanwhile, pharmaceutical firms such as Sanofi and Novo Nordisk continue to navigate challenges and breakthroughs in drug trials.",
        "authors": "None",
        "publish_date": "2026-02-03 05:04:12",
        "published_at_raw": "2026-02-03T05:04:12Z",
        "meta_site_name": "Devdiscourse",
        "description": "This comprehensive health news overview covers the EU's updated toxin limits for baby formula, the USDA's fly release to combat screwworm pests, and the latest in pharmaceutical trials and regulatory actions. It also highlights a groundbreaking face transplant in Spain and industrial strikes by doctors in England.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]