[
    {
        "id": "21a039b56decf00e9b954ad71b6665e2",
        "title": "Corn Popping Higher at Midday",
        "doc_url": "https://www.barchart.com/story/news/36415286/corn-popping-higher-at-midday",
        "all_text": "Corn futures are up 4 to 5 cents on Tuesday’s midday. There were another 76 deliveries issued against December futures overnight. The CmdtyView national average Cash Corn price is back up 4 ½ cents at $4.04 3/4.\nSupport is coming from threats from Russia threatening to cut off Ukraine from the sea if their attacks on Russian linked vessels continue.\nEIA data for the week ending on November 28 will be out on Wednesday, with traders looking to see if ethanol production held up on the holiday week from the previous near record total in the week prior. Some are looking for a slight pullback in output.\nDec 25 Corn is at $4.37 1/2, up 4 3/4 cents,\nNearby Cash is at $4.04 3/4, up 4 1/2 cents,\nMar 26 Corn is at $4.49 1/4, up 4 1/4 cents,\nMay 26 Corn is at $4.57 1/4, up 4 cents,",
        "authors": "None",
        "publish_date": "2025-12-02 18:28:39",
        "published_at_raw": "2025-12-02T18:28:39Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are up 4 to 5 cents on Tuesday’s midday. There were another 76 deliveries issued against December futures overnight. The CmdtyView national average Cash Corn price is back up 4 ½ cents at $4.04 3/4. Support is coming from threats from R...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a824c520c2d7b8a3c915f9b2c8d5ae07",
        "title": "Corn Showing Steady Trade on Tuesday AM",
        "doc_url": "https://www.barchart.com/story/news/36408159/corn-showing-steady-trade-on-tuesday-am",
        "all_text": "Corn price action is steady to 1 ¼ cents higher on Tuesday. Futures gave back some of last week’s late strength on Monday, with contracts down 2 to 3 cents in the nearbys. Preliminary open interest was down 8,707 contracts on Monday, mostly in the front two contracts. There were another 76 deliveries issued against December futures overnight. The CmdtyView national average Cash Corn price was back down today at $3.99.\nThe Monday morning Export Inspections report showed a total of 1.421 MMT (55.95 mbu) of corn shipped in the week of 11/27. That was 49.79% above the same week last year but a drop of 16.18% from last week’s total. Japan was the largest buyer of 431,700 MT, with 330,150 MT shipped to Mexico and 187,948 MT to Colombia. The marketing year total is now 18.97 MMT (746.7 mbu) of corn shipped, which is now 70.69% above the same period last year.\nExport Sales data for the week ending on 10/23 was out on Monday, with USDA showing sales backing off to 1.8 MMT for that week. That was 36% below the week prior. Another 160,058 MT was reported for the 2026/27 marketing year. Accumulated sales, both shipped and unshipped are now 37% above last year at 35.37 MMT.\nDec 25 Corn closed at $4.32 3/4, down 2 3/4 cents, currently up 1 ¼ cents\nNearby Cash was $3.99, down 12 cents,\nMar 26 Corn closed at $4.45, down 2 3/4 cents, currently unch\nMay 26 Corn closed at $4.53 1/4, down 2 1/2 cents, currently unch",
        "authors": "None",
        "publish_date": "2025-12-02 13:33:24",
        "published_at_raw": "2025-12-02T13:33:24Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is steady to 1 ¼ cents higher on Tuesday. Futures gave back some of last week’s late strength on Monday, with contracts down 2 to 3 cents in the nearbys. Preliminary open interest was down 8,707 contracts on Monday, mostly in the fr...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4a86d8e2da54b6b1bc860e41d89a60b0",
        "title": "How Much Lower Will Soybean Meal Prices Go?",
        "doc_url": "https://www.barchart.com/story/news/36412391/how-much-lower-will-soybean-meal-prices-go",
        "all_text": "March soybean meal (ZMH26) futures present a selling opportunity on more price weakness.\nSee on the daily bar chart for March soybean meal futures that prices have sold off recently, to form a bearish head-and-shoulders top reversal pattern that suggests a near-term market top is in place. See, too, at the bottom of the chart that the moving average convergence divergence (MACD) indicator is in a bearish posture as the blue MACD line is below the red trigger line and both lines are trending lower.\nFundamentally, China, a major soybean importer, has pledged to buy more U.S. soybeans, but that news appears to be factored into current futures markets prices. Traders are also thinking China may not be able to meet its pledge to buy 12 million tons of soybeans by the end of this year, especially as China presently has a large stockpile of soybeans.\nA move in March soybean meal futures below chart support at $318.00 would give the bears more power and it would also become a selling opportunity. The downside price objective would be $295.00, or below. Technical resistance, for which to place a protective buy stop just above, is located at $328.00.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I d",
        "authors": "None",
        "publish_date": "2025-12-02 15:46:25",
        "published_at_raw": "2025-12-02T15:46:25Z",
        "meta_site_name": "Barchart",
        "description": "March soybean meal futures present a selling opportunity on more price weakness.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6523558260c87fa079e818276ea01210",
        "title": "Argentina Wheat Harvest: Protein & Price Outlook",
        "doc_url": "https://www.argusmedia.com/en/news-and-insights/market-opinion-and-analysis-blog/argentina-wheat-harvest-protein-market-impact",
        "all_text": "The world’s wheat exporters are braced for a record harvest in Argentina, but the real market impact will be determined by the crop’s protein content.\nGlobal wheat traders have been leaning towards a middling-protein, high-yield scenario for this year's Argentinian wheat crop in the run-up to the country’s new marketing year, which began in December.\nA consensus has emerged that Argentina's harvest — currently in progress — will yield mostly 11.5pc protein wheat and below this year, rather than the typical 11.5-12.5pc mix of protein grades. Yields are forecast above historical averages and are set to push production to a record high. But high yields are often correlated with lower average protein content.\nSome traders who have already sold on a destination basis to millers and importers in west and east Africa — typically 12.5pc protein markets — have sought to switch their vessel-loading plans from Argentinian ports to other exporters over the past fortnight, market participants said. Instead, various traders are seeking 12.5pc wheat from northern European countries and even from Brazil.\nAmple 11.5pc wheat, close to no 12pc and higher\nA greater share of 11.5pc protein wheat exported from Argentina this year — rather than 12pc and 12.5pc protein wheat — will intensify competition with some exporters more than others.\nArgentinian wheat has already come into direct competition with French exporters offering 11-11.5pc wheat in Morocco, as traders offer on a forward basis for Dec",
        "authors": "None",
        "publish_date": "2025-12-02 00:00:00",
        "published_at_raw": "2025-12-02T00:00:00Z",
        "meta_site_name": "Argus Media",
        "description": "Explore Argentina’s wheat harvest impact on protein quality, wheat futures, and global wheat market prices in this detailed analysis.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "289f2a99feaf26b25f62b13b83574377",
        "title": "Trump Admin Threatens to Starve Citizens By Cutting Food Stamp Funding in Democratic States Over Data Dispute",
        "doc_url": "https://www.ibtimes.com/trump-admin-threatens-starve-citizens-cutting-food-stamp-funding-democratic-states-over-data-3791823",
        "all_text": "The Trump administration has escalated its conflict with Democratic-led states by threatening to withhold federal funding for the Supplemental Nutrition Assistance Programme (SNAP), a move that could destabilise the food security network for millions of Americans.\nAgriculture Secretary Brooke Rollins confirmed that the US Department of Agriculture (USDA) will block administrative funds starting next week for 22 states that have refused to hand over detailed recipient data, including immigration status.\nData Dispute and Privacy Concerns\nThe standoff centres on a federal demand for states to transmit granular personal information regarding SNAP beneficiaries. The data that the agriculture office wants includes immigration status, Social Security numbers, and other personal identifiers.\nWhile the government says the requirement is only meant to prevent fraud, some state officials and advocacy groups contend that this move violates privacy laws and goes beyond federal jurisdiction.\nCrucially, the funding freeze targets the operational budget used to pay state employees and maintain computer systems, rather than the benefits themselves. However, experts warn that without administrative funding, states will be unable to process applications or distribute cards, effectively halting the flow of aid to the 42 million citizens who rely on the programme.\nThe Ultimatum\nSpeaking during a cabinet meeting, Rollins framed the issue as one of fiscal responsibility. 'In February of this year, ",
        "authors": "None",
        "publish_date": "2025-12-02 23:59:38",
        "published_at_raw": "2025-12-02T23:59:38Z",
        "meta_site_name": "International Business Times",
        "description": "USDA is requesting states to submit data on food-stamp recipients, but several have not done so, raising the possibility that SNAP funding could be disrupted.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "90ac81ced7ff44f74c490983bc416ce8",
        "title": "Hogs Close on a Mixed Note on Tuesday",
        "doc_url": "https://www.barchart.com/story/news/36420455/hogs-close-on-a-mixed-note-on-tuesday",
        "all_text": "Lean hog futures closed mixed, with December up 27 cents and other contracts down 12 to 50 cents. USDA’s national base hog price was reported at $71.33 on Tuesday afternoon, down 35 cents from the day prior. The CME Lean Hog Index was down another 25 cents on November 28 at $81.67.\nCFTC data from this afternoon for the week of 10/21 showed specs continuing to liquidate their net long by another 11,697 contracts to 117,231 contracts.\nUSDA’s pork carcass cutout value from the Tuesday afternoon report was down 57 cents to $94.22 per cwt. The loin and belly were the only primals reported lower. USDA estimated federally inspected hog slaughter for Tuesday was 489,000 head, with the week to date total at 971,000 head. That was 16,000 head below last week but 275 head above the week last year.\nDec 25 Hogs closed at $80.500, up $0.275,\nFeb 26 Hogs closed at $80.175, down $0.125\nApr 26 Hogs closed at $83.825, down $0.450,",
        "authors": "None",
        "publish_date": "2025-12-02 23:16:57",
        "published_at_raw": "2025-12-02T23:16:57Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed mixed, with December up 27 cents and other contracts down 12 to 50 cents. USDA’s national base hog price was reported at $71.33 on Tuesday afternoon, down 35 cents from the day prior. The CME Lean Hog Index was down another 25...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "18696dbc2083e4323864cf725042f104",
        "title": "Rollins threatens to halt funding to states withholding SNAP data",
        "doc_url": "https://www.politico.com/news/2025/12/02/rollins-says-she-will-withhold-federal-funding-to-states-that-wont-send-sensitive-snap-data-00673265",
        "all_text": "A spokesperson for USDA confirmed Rollins’ intentions, but did not clarify how the move will affect the lawsuit.\n“We have sent Democrat States yet another request for data, and if they fail to comply, they will be provided with formal warning that USDA will pull their administrative funds,” the spokesperson said in a statement. “USDA established a SNAP integrity team to analyze not only data provided by states, but to scrub all available information to end indiscriminate welfare fraud.”\nRollins’ latest comments come as states are scrambling to implement major changes to SNAP, including stricter work requirements and more limited eligibility for legal immigrants — and on the heels of a weekslong pause in benefits during the government shutdown. Some states are also preparing to implement new restrictions on what SNAP recipients can buy, such as bans on soda, as part of the Trump administration’s Make America Healthy Again agenda. And USDA is writing new regulations to further limit access to the nation’s biggest nutrition assistance program.\nUSDA asked states in May to send sensitive data, including Social Security numbers and the total value of benefits participants have received over time, to the federal government as part of an initiative to go after fraud in SNAP. More than two dozen states so far have done so.\nRollins also recently said that SNAP participants would have to reapply for benefits as part of her anti-fraud push. Participants already must recertify their eligi",
        "authors": "None",
        "publish_date": "2025-12-02 21:32:00",
        "published_at_raw": "2025-12-02T21:32:00Z",
        "meta_site_name": "POLITICO",
        "description": "More than a dozen blue states have sued USDA, arguing that its request for sensitive data on federal food aid participants is unlawful.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "15b4ccdbdca61315d9b33152dc09f6c2",
        "title": "USDA Chief Threatens Cuts Over SNAP Data Dispute",
        "doc_url": "https://www.newsmax.com/politics/brooke-rollins-usda-snap/2025/12/02/id/1236798/",
        "all_text": "Agriculture Secretary Brooke Rollins said Tuesday that the Trump administration will start withholding some federal agriculture funds from Democrat-led states that refuse to turn over detailed data on people receiving food aid.\nRollins, speaking during a Cabinet meeting with President Donald Trump, said the Agriculture Department requested Supplemental Nutrition Assistance Program records from all 50 states in February to root out fraud and protect taxpayers.\nShe said 29 Republican-led states have provided the information, while 21 Democrat-led states \"continue to say no.\"\nRollins said the administration will \"begin to stop moving federal funds into those states\" next week until they comply.\nA USDA statement later said \"28 states and Guam joined us in this fight,\" but said that \"states like California, New York, and Minnesota, among 19 other blue states\" have resisted.\nThe department did not immediately explain the difference between the tallies offered by Rollins and in the statement.\nThe standoff is the latest fight over data-sharing demands tied to SNAP, the nation's largest anti-hunger program. About 1 in 8 Americans receive SNAP benefits each month, according to federal data.\nAdministration officials say they need state data, including personally identifying information, to detect improper payments and ineligible recipients.\nDemocrat officials and privacy advocates have raised concerns about collecting sensitive information, including immigration-related details, and arg",
        "authors": "None",
        "publish_date": "2025-12-02 20:43:06",
        "published_at_raw": "2025-12-02T20:43:06Z",
        "meta_site_name": "Newsmax",
        "description": "Rollins noted that although Republican-led states have largely submitted the required data, the Democrat-led states still holding out will face a cutoff of federal funding beginning next week unless they reverse course.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ca86f54bb7b68a0fa586488391b569b6",
        "title": "grown foods amid program overhaul – NaturalNews.com",
        "doc_url": "https://www.naturalnews.com/2025-12-02-usda-snap-fraud-shift-to-american-grown-foods.html",
        "all_text": "The USDA is cracking down on widespread fraud, including 186,000 deceased individuals still receiving benefits and 356,000 duplicate enrollments across 28 states. Another 22 states and D.C. refused to submit data, raising concerns about further undisclosed abuse.\nAgriculture Secretary Brooke Rollins announced stricter eligibility checks, requiring beneficiaries to reapply to eliminate waste. She vowed to \"right-size\" SNAP, calling it \"out of control\" and pledging to protect taxpayers while ensuring aid reaches those truly in need.\nThe USDA plans to redirect funding toward U.S.-grown produce, proteins and specialty crops, aligning with HHS Secretary RFK Jr.'s \"Make America Healthy Again\" initiative. Critics warn that cuts without affordable, healthy options could harm vulnerable families.\nA pending \"bridge package\" aims to help struggling farmers facing rising debt and volatile markets, with Rollins promising relief by early next year. Farmers need certainty as banks pressure them amid economic strain.\nThe Farm Bill debate centers on balancing fiscal responsibility with food security, as House Republicans push for $20.5 billion in SNAP cuts over a decade. The reforms could impact 42 million Americans, raising concerns about deepening food insecurity while attempting to restore program integrity.\nThe U.S. Department of Agriculture (USDA) is moving to reform the Supplemental Nutrition Assistance Program (SNAP), calling it \"out of control\" due to widespread fraud and inefficienci",
        "authors": "None",
        "publish_date": "2025-12-02 17:15:56",
        "published_at_raw": "2025-12-02T17:15:56Z",
        "meta_site_name": "Natural News",
        "description": "The USDA is cracking down on widespread fraud, including 186,000 deceased individuals still receiving benefits and 356,000 duplicate enrollments across 28 states. Another 22 states and D.C. refused to submit data, raising concerns about further undisclosed abuse. Agriculture Secretary Brooke Rollins announced stricter eligibility checks, requiring beneficiaries to reapply to eliminate waste. She vowed to […]",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "dd62fe9d01f322093031ab9c872d3925",
        "title": "USDA Puts 'ALL' Programs Under Review, Will Ensure Only American Citizens Receive Food Stamps",
        "doc_url": "https://www.thegatewaypundit.com/2025/12/usda-puts-programs-review-will-ensure-american-citizens/",
        "all_text": "Agriculture Secretary Brooke Rollins says the agency will weed out illegal immigrants from programs her department operates, including the Supplemental Nutrition Assistance Program, commonly called food stamps.\n“At @POTUS’ direction we will be reviewing ALL @USDA PROGRAMS to ensure only legal citizens are receiving benefits,” Rollins posted on social media platform X.\n“Earlier this year, USDA put states on notice reminding them illegal immigrants and certain non-citizens CAN NOT receive SNAP benefits. Right now, we are requiring states turn over recipient data to fight waste, fraud, and abuse,” she wrote.\n“Even though 22 blue states have refused to provide the data, we are using every tool to compel their compliance. WHAT are they hiding? WHO are they hiding? Thank you, President Trump, for putting Americans first!” she wrote.\nRollins noted in recent comments on “The Ingraham Angle” that fraud is rampant.\nShe said more than 500,000 people were found to have been taking SNAP benefits twice in a limited response from states that shared data with the USDA.\nWhile focusing on fraud, the USDA is also changing the rules to reduce the number of people on SNAP.\nMonday marked the day a provision of the One Big Beautiful Bill Act took effect, raising from 54 to 64 the age of people required to engage in “qualifying” work or other activities at least 80 hours a month to get their benefits. The new rule kicks in when individuals reapply or apply for SNAP, according to Fox Business.\nThe Co",
        "authors": "None",
        "publish_date": "2025-12-02 15:00:27",
        "published_at_raw": "2025-12-02T15:00:27Z",
        "meta_site_name": "The Gateway Pundit",
        "description": "The USDA is not going to stop with SNAP as it works to ensure that benefits from its programs do not go to illegal immigrants.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "75ab8d59e08b777f5b26149c1597df90",
        "title": "Westby Cooperative Creamery receives $15.5 million loan from USDA Rural Development",
        "doc_url": "https://www.weau.com/2025/12/02/westby-cooperative-creamery-receives-155-million-loan-usda-rural-development/",
        "all_text": "STEVENS POINT, Wis. (WEAU) - U.S. Department of Agriculture Rural Development Wisconsin State Director Andrew C. Iverson is announcing that Westby Cooperative Creamery will expand and modernize its manufacturing facility through a nearly $15.5 million loan from Rural Development Business and Industry Guaranteed Loan program and its partner bank the Security Financial Bank.\nAccording to a press release from the U.S. Department of Agriculture, the primary goal of the project is to modernize aging infrastructure and align production capacity with increasing consumer demand for cottage cheese.\n“From a dairy farm to a grocers’ shelf, this investment will reinforce rural prosperity in Wisconsin,” Iverson said. “The Business and Industry Guaranteed Loan program is one of many Rural Development programs that support Wisconsin cooperatives. We are proud to support cooperatives, Wisconsin farmers, rural jobs, and dairy production.”\nPer the press release, key operational benefits after the expansion include:\nEnclosed systems to automate ingredients, testing, and sanitation\nNew technology that improves product safety with High-Efficiency Particulate Air (HEPA)-filtered air environments\nFaster processing: production time reduced from 16 hours to eight\nIncreased yield: 10% - 15% more cottage cheese from the same amount of milk\nPer the press release, expansion and modernization will include:\nA new food-grade room within the existing facility\nInstallation of four fully enclosed cottage chees",
        "authors": "None",
        "publish_date": "2025-12-02 14:50:02",
        "published_at_raw": "2025-12-02T14:50:02Z",
        "meta_site_name": "WEAU",
        "description": "Westby Cooperative Creamery will expand and modernize its manufacturing facility, according to the USDA.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "408459dded77944d264fdeac817caefd",
        "title": "USDA to Halt Federal Funding to States Not Sharing SNAP Data",
        "doc_url": "https://www.breitbart.com/politics/2025/12/02/brooke-rollins-usda-to-halt-federal-funding-to-states-not-sharing-snap-data/",
        "all_text": "U.S. Agriculture Secretary Brooke Rollins announced that the U.S Department of Agriculture would halt federal funding to states that refuse to share their data on the Supplemental Nutrition Assistance Program (SNAP) to root out fraud.\nDuring a cabinet meeting of the Trump administration, Rollins highlighted the accomplishments of the USDA and spoke about the fraud the agency had discovered within SNAP. Rollins also shared that in February, states were asked to “turn over their data to the federal government to let the USDA partner with them to root out” fraud, and that only 29 states had shared their data.\n“The third thing — we have so much great things to talk about at USDA, but the third thing which became very much a part of the national conversation during the Democrat shutdown was SNAP reform, food stamp reform,” Rollins said. “When all of America saw, which so many of us know, and have been working on — but when you have so much rampant fraud in a program that 42 million Americans participate in.”\nRollins continued to share the good news that since President Donald Trump became president, 800,000 of the 42 million Americans have “moved off of food stamps.” Rollins added that the agency had found 186,000 dead people’s social security numbers “being used,” and 500,000 people getting “benefits more than twice.”\n“In February of this year, we asked for all the states — for the first time, to turn over their data to the federal government to let the USDA partner with them to ",
        "authors": "None",
        "publish_date": "2025-12-02 14:37:49",
        "published_at_raw": "2025-12-02T14:37:49Z",
        "meta_site_name": "Breitbart News Network",
        "description": "U.S. Agriculture Secretary Brooke Rollins announced that the USDA would halt federal funding to states that refuse to share their SNAP data.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "73d12bb648246bfdcbe61f6926dbe54b",
        "title": "Hog Traders Look to Tuesday Trade",
        "doc_url": "https://www.barchart.com/story/news/36408219/hog-traders-look-to-tuesday-trade",
        "all_text": "Lean hog futures were down 37 to 70 cents on Monday. Open interest was down 1,093 contracts. USDA’s national base hog price was reported at $71.68 on Monday afternoon, down 41 cents from the day prior. The CME Lean Hog Index was down another 35 cents on November 26 at $81.92.\nUSDA showed 38,790 MT of pork sold of export in the week of 10/23, a 4-week high. Shipments were an 18-week high at 31,317 MT.\nUSDA’s pork carcass cutout value from the Monday afternoon report was up 57 cents to $94.79 per cwt. The butt and rib were the only primals reported lower. USDA estimated federally inspected hog slaughter for Monday was 492,000 head. That was 3,000 head below last week but 6,241 head above the week last year.\nDec 25 Hogs closed at $80.225, down $0.375,\nFeb 26 Hogs closed at $80.300, down $0.700\nApr 26 Hogs closed at $84.275, down $0.625,",
        "authors": "None",
        "publish_date": "2025-12-02 13:33:25",
        "published_at_raw": "2025-12-02T13:33:25Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were down 37 to 70 cents on Monday. Open interest was down 1,093 contracts. USDA’s national base hog price was reported at $71.68 on Monday afternoon, down 41 cents from the day prior. The CME Lean Hog Index was down another 35 cents...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a5573c2947149be6fb1bf05418ecffb2",
        "title": "Not oranges, these 10 foods have the highest amount of Vitamin C",
        "doc_url": "https://timesofindia.indiatimes.com/life-style/food-news/not-oranges-these-10-foods-have-the-highest-amount-of-vitamin-c/photostory/125711278.cms",
        "all_text": "Vitamin C is a powerful antioxidant that plays a vital role in strengthening the immune system. It is also said to be important for collagen production for healthy skin and helps with absorption of iron. And when it comes to fruits rich in vitamin C, oranges are often mentioned as a potent source and considered as a superfood. According to a data report by the USDA, National Nutrient Database for Standard Reference 1 cup of oranges offer 97.5 mg vitamin C. And did you know that there are many Indian foods that offer more vitamin C than this citrus fruit and can be enjoyed in many ways. Scroll down to find ways.\nIt is mentioned that 1 cup banana offers 102.5 mg vitamin C\nHow to consume: They are best consumed in the form of fruit salad, or one can blend to make smoothies or shakes.\n1 cup of this tropical fruit offers 1644.0 mg vitamin C\nHow to consume: One can consume 1-2 fresh acerola cherries at a time, but because it is very tart, you can blend it into smoothie.\n1 cup of kiwi fruit offers 166.9 mg vitamin C\nHow to consume: The best way to consume kiwi is to eat it fresh and raw, else you can also make a fruit salad or a smoothie and enjoy for breakfast.\n1 cup guava offers 376.7 mg vitamin C\nHow to consume: They are best consumed fresh with a sprinkle of salt and red chilli powder, or one can make smoothies or shakes with them too.\n1 cup of this pepper offers 341.3 mg vitamin C\nHow to consume: One can use blanched or raw ones to make salads, pizzas, or they can be added to c",
        "authors": "None",
        "publish_date": "2025-12-02 06:39:13",
        "published_at_raw": "2025-12-02T06:39:13Z",
        "meta_site_name": "Times of India",
        "description": "Vitamin C is a powerful antioxidant that plays a vital role in strengthening the immune system. It is also said to be important for collagen production for healthy skin and helps with absorption of iron. And when it comes to fruits rich in vitamin C, oranges are often mentioned as a potent source and considered as a superfood. According to a data report by the USDA, National Nutrient Database for Standard Reference 1 cup of oranges offer 97.5 mg vitamin C. And did you know that there are many Indian foods that offer more vitamin C than this citrus fruit and can be enjoyed in many ways. Scroll down to find ways.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]