[
    {
        "id": "b00a472af8e8e5de73f1f833a99335b7",
        "title": "Fertiliser Import Price Surge may Hit India’s Rabi Crop Output",
        "doc_url": "https://www.dailyexcelsior.com/fertiliser-import-price-surge-may-hit-indias-rabi-crop-output/",
        "all_text": "By Nantoo Banerjee\nIt is difficult to grasp the fact that even 78 years after its independence, India, the world’s most populous country, continues to be heavily dependent on imported fertilizer to produce crops to feed its 1.46 billion-plus population. The prospect of a sudden fertiliser price surge ahead of its most important Rabi (winter) crop season, following suspension of exports by China since mid-October, is bound to impact especially the production and price of wheat along with other crops such as gram, peas, mustard and barley. India is the world’s second largest producer of wheat, after China. Rabi crops are sown in autumn (October-November) and harvested in spring (March-April). India continues to be the world’s largest fertiliser importer while China has been the world’s second biggest exporter of fertiliser after Russia.\nChina has suspended the export of fertiliser until further notice. There will be no supplies from China of speciality fertilisers such as TMAP (Technical Monoammonium Phosphate) and urea-solution products like AdBlue as well as conventional soil nutrients, including DAP (Diammonium Phosphate) and urea. India is said to be importing almost 95 percent of speciality fertilisers from China. The country consumes annually some 2,50,000 tonnes of speciality fertilisers, of which nearly 65 percent are used during the Rabi season. Alternative supply sources include South Africa, Chile and Croatia.\nSo deficient is India in chemical fertiliser production t",
        "authors": "None",
        "publish_date": "2025-12-06 22:30:10",
        "published_at_raw": "2025-12-06T22:30:10Z",
        "meta_site_name": "Daily Excelsior",
        "description": "By Nantoo Banerjee It is difficult to grasp the fact that even 78 years after its independence, India, the world’s most populous country, continues to be heavily dependent on imported fertilizer to produce crops to feed its 1.46 billion-plus population. The prospect of a sudden fertiliser price surge ahead of its most important Rabi (winter) crop season, following suspension of exports by China since mid-October, is bound to impact especially the production and price of wheat along with other […]",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "284e0373eeec1fcc2493b66bfafaad91",
        "title": "Farm Aid Package Nears for Farmers Hit by Export Losses and Low Prices",
        "doc_url": "https://www.agriculture.com/partners-farm-aid-package-nears-for-farmers-hit-by-export-losses-and-low-prices-11863443",
        "all_text": "A farm aid package is expected to be announced next week for farmers suffering from export losses and low commodity prices. Agri-Pulse Newsmakers sat down with Deputy Agriculture Secretary Stephen Vaden to discuss the package, which he says “a wide variety of commodity crops” will be eligible for.\nIn this extended year-in-review interview, the Trump administration's efforts to advance many agriculture priorities this year — tackling food inflation, advancing trade deals, and consolidation in the meat sector — were discussed. Vaden, who is leading the USDA reorganization, also shared a timeline for when USDA staff will be relocated to five regional hubs across the U.S.\nWatch the Episode\nWant to receive Newsmakers in your inbox every week? Sign up!\nRead the Transcript\nPlease note: This transcript has not been edited.\nLydia Johnson: Welcome to Agri-Pulse Newsmakers, where we aim to take you to the heart of ag policy. I'm your host, Lydia Johnson. This week, we'll take you into the Department of Agriculture for a conversation on how President Donald Trump's agriculture agenda has been advanced this year. Deputy Ag Secretary Stephen Vaden will join us to discuss the waiting economic assistance package, trade, and beef prices. To begin, farmers finished this growing season with mounting concerns about the farm economy, rising input costs, loss of markets and falling crop prices. We asked Deputy Secretary Stephen Vaden what he's hearing during visits across the U.S. and how he views",
        "authors": "None",
        "publish_date": "2025-12-06 15:00:00",
        "published_at_raw": "2025-12-06T15:00:00Z",
        "meta_site_name": "Successful Farming",
        "description": "Deputy Agriculture Secretary Stephen Vaden previewed a broad USDA farm aid package for farmers hurt by export losses and low prices and explained how new trade deals, beef market changes, and a major USDA reorganization will shape the year ahead.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7970c9d3fd18b7027e3acdfb15aeae48",
        "title": "China slow plays soybean purchases while cattle retrace to key levels",
        "doc_url": "https://www.barchart.com/story/news/36491380/china-slow-plays-soybean-purchases-while-cattle-retrace-to-key-levels",
        "all_text": "Howdy market watchers!\nThe countdown to Christmas is on! While several parts of the country received snow this week, there are plenty of areas on the dryer side void of any winter precipitation, as yet. The US drought monitor is beginning to show those deficiencies as drought expands in parts of the Midwest, Southeast and Southwest.\nHowever, that didn’t prevent cold temperatures and natural gas demand from being abundantly prevalent this week. Such demand for heating was on full display in the natural gas market this week, but especially on Friday. At its peak, front-month January natural gas futures were up over 8 percent during Friday’s session alone, trading to a high of $5.496 while the February contract also briefly traded above $5.00. Now, that’s some movement! Strong LNG exports have also contributed to the overall demand equation. Crude oil futures also strengthened to finish the week above $60.00 per barrel.\nJanuary silver futures traded to new, all-time highs at $59.435 per troy ounces, keeping ahead of gold’s pace. The equity markets have staged a complete turnaround in the last 10 trading sessions from the light correction that ended on November 20th though yet to make new highs. As the 2025 trading year is just three weeks from turning over the calendar, investors are hoping for a Santa Claus rally. Optimism of an interest rate cut at next week’s FOMC meeting has fueled the recent recovery rally. There is now a nearly 90 percent chance of a 25-basis point interes",
        "authors": "None",
        "publish_date": "2025-12-06 13:59:10",
        "published_at_raw": "2025-12-06T13:59:10Z",
        "meta_site_name": "Barchart",
        "description": "USDA WASDE & Crop Production on Tuesday at 11 AM CDT",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c9ab4c91483761db65d5c21033037aa7",
        "title": "China slow plays soybean purchases while cattle retrace to key levels",
        "doc_url": "https://www.barchart.com/story/news/36491381/china-slow-plays-soybean-purchases-while-cattle-retrace-to-key-levels",
        "all_text": "Howdy market watchers!\nThe countdown to Christmas is on! While several parts of the country received snow this week, there are plenty of areas on the dryer side void of any winter precipitation, as yet. The US drought monitor is beginning to show those deficiencies as drought expands in parts of the Midwest, Southeast and Southwest.\nHowever, that didn’t prevent cold temperatures and natural gas demand from being abundantly prevalent this week. Such demand for heating was on full display in the natural gas market this week, but especially on Friday. At its peak, front-month January natural gas futures were up over 8 percent during Friday’s session alone, trading to a high of $5.496 while the February contract also briefly traded above $5.00. Now, that’s some movement! Strong LNG exports have also contributed to the overall demand equation. Crude oil futures also strengthened to finish the week above $60.00 per barrel.\nJanuary silver futures traded to new, all-time highs at $59.435 per troy ounces, keeping ahead of gold’s pace. The equity markets have staged a complete turnaround in the last 10 trading sessions from the light correction that ended on November 20th though yet to make new highs. As the 2025 trading year is just three weeks from turning over the calendar, investors are hoping for a Santa Claus rally. Optimism of an interest rate cut at next week’s FOMC meeting has fueled the recent recovery rally. There is now a nearly 90 percent chance of a 25-basis point interes",
        "authors": "None",
        "publish_date": "2025-12-06 13:59:10",
        "published_at_raw": "2025-12-06T13:59:10Z",
        "meta_site_name": "Barchart",
        "description": "USDA WASDE & Crop Production on Tuesday at 11 AM CDT",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "79a84f5b0253bb6de303e6088616ae49",
        "title": "Vaden: USDA Reorganization to Be Complete in 2026",
        "doc_url": "https://www.agriculture.com/partners-vaden-usda-reorganization-to-be-complete-in-2026-11863469",
        "all_text": "The Agriculture Department will complete a reorganization of more than half the current D.C.-based staff to five regional hubs across the U.S. by the end of 2026, Deputy Agriculture Secretary Stephen Vaden says on Agri-Pulse Newsmakers.\nIn a comprehensive year-in-review interview, Vaden said “when you and I talk at the end of next year … We will have redistributed the majority of our USDA employees to our new hub locations, plus other places where we already have leased office space.”\nThe reorganization, a process led by Vaden, will move more than 2,000 USDA employees to regional hubs in five cities: Raleigh, North Carolina; Kansas City, Missouri; Indianapolis, Indiana; Fort Collins, Colorado, and Salt Lake City, Utah.\nWhen asked if employees will be moved to the regional hubs by the end of 2026, Vaden confirmed “they will be.”\n“As a matter of fact, we're already moving to implement that, and you'll see that in the days and weeks ahead with public announcements,” Vaden told Newsmakers anchor Lydia Johnson.\nThe reorganization is expected to cut the national capital region's 4,600 employees to no more than 2,000, according to the USDA’s original July announcement.\nVaden said USDA is “being very transparent” in the reorganization process and directed those interested to the USDA’s reorganization webpage.\nComments to the reorganization have not yet been publicly posted by USDA, but some farm groups and other stakeholders have raised concerns about the impact of the plan on agenci",
        "authors": "None",
        "publish_date": "2025-12-06 10:00:00",
        "published_at_raw": "2025-12-06T10:00:00Z",
        "meta_site_name": "Successful Farming",
        "description": "The Agriculture Department will complete a reorganization of more than half the current D.C.-based staff to five regional hubs across the U.S. by the end of 2026, Deputy Agriculture Secretary Stephen Vaden says on Agri-Pulse Newsmakers.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "27cf2485547f0495c10bdd14ddc26313",
        "title": "USDA Moves to Bolster Farm Safety Net, Expand Crop Insurance Access",
        "doc_url": "https://www.agriculture.com/partners-usda-moves-to-bolster-farm-safety-net-expand-crop-insurance-access-11863386",
        "all_text": "The Trump administration has unveiled changes to federal crop insurance aimed at easing regulatory burdens for farmers and expanding access to risk safeguards.\nAs part of the One Big Beautiful Bill Act, USDA on Friday published the Expanding Access to Risk Protection (EARP) final rule, and will accept public comment on it through Jan. 27.\nChanges made by USDA’s Federal Crop Insurance Corporation (FCIC) include clarifying harvest price methods, removing barriers to direct marketing and getting rid of buy-up coverage for prevented planting in the program. The amendments take effect in 2026 for crops with a contract change date on or after Nov. 30, 2025. For all other crops, changes to the policies are applicable for the 2027 and succeeding crop years.\nAgriculture Secretary Brooke Rollins said the move to modernize longtime policies responds to feedback from producers and underscores the administration’s pledge to prioritize the needs of American farmers.\n“With this new rule, we are delivering real, meaningful relief by modernizing the system, expanding access to crop insurance, and making it easier, not harder, for farmers and ranchers to protect their operations and keep doing the work that keeps America fueled and fed,” Rollins said in a statement.",
        "authors": "None",
        "publish_date": "2025-12-06 09:00:00",
        "published_at_raw": "2025-12-06T09:00:00Z",
        "meta_site_name": "Successful Farming",
        "description": "The Trump administration has unveiled changes to federal crop insurance aimed at easing regulatory burdens for farmers and expanding access to risk safeguards.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "64cc13ff205f11f4f5a9c01436dfaa1e",
        "title": "USDA expands crop insurance access for farmers, ranchers",
        "doc_url": "https://www.arkansasonline.com/news/2025/dec/06/usda-expands-crop-insurance-access-for-farmers/",
        "all_text": "The USDA on Friday said federal crop insurance access will be expanded via a final rule from the Federal Crop Insurance Corp. to amend its regulations in compliance with the \"One Big Beautiful Bill\" passed in July.\nU.S. Secretary of Agriculture Brooke Rollins said the changes will update federal crop insurance and expand producers' access to risk protection beginning with the 2026 crop year.\nThe Federal Crop Insurance Corp. is working to streamline and clarify federal crop insurance policies, according to the rule filing in the Federal Register.\nSome of the changes aim to \"reduce regulatory burdens,\" according to a U.S. Department of Agriculture news release.\nThe Federal Crop Insurance Corp. amended a provision of the Common Crop Insurance Regulation requiring verification that acreage was insured in the past based on the \"1 in 4\" rule for prevented planting payments. Producers are still required to show their land was planted and harvested, or adjusted for an insurable loss, in one of the prior four years.\nAnother amended provision adds an exception so that policyholders who transfer their policy to a new approved insurance provider for the upcoming year will not be required to provide end-of-year production reporting to their current approved insurance provider if they do not have a claim, a changed aimed at streamlining production reporting, USDA said.\nRegulatory provisions were amended to allow insurance under the Dollar Plan for producers to direct market their fresh mar",
        "authors": "None",
        "publish_date": "2025-12-06 07:45:00",
        "published_at_raw": "2025-12-06T07:45:00Z",
        "meta_site_name": "Arkansas Online",
        "description": "The USDA on Friday said federal crop insurance access will be expanded via a final rule from the Federal Crop Insurance Corp. to amend its regulations in compliance with the \"One Big Beautiful Bill\" passed in July.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]