[
    {
        "id": "5598743cb112200fd4961878c159f178",
        "title": "Corn Pops Higher on Thursday with Continued Export Business",
        "doc_url": "https://www.barchart.com/story/news/36466304/corn-pops-higher-on-thursday-with-continued-export-business",
        "all_text": "Corn futures posted gains on Thursday, with contracts up 3 to 4 cents in most front months, as December was up 6 ¼. The CmdtyView national average Cash Corn price was up 4 cents on the day at $4.02 3/4.\nUSDA reported a private export sale of 100,800 MT of corn to Colombia, with 392,500 MT to Mexico this morning via their daily reporting system.\nExport Sales data for the week of October 30 was out this morning, with a total of 1.99 MMT of corn sold. That was on the higher side of trade ideas looking for 0.8-2.5 MMT in corn sales during that week. That was back above the week prior and the third largest total for the marketing year.\nActual Brazilian trade ministry data for November tallied exports at 5.03 MMT, a 6.48% increase from last year but a 22.58% drop from last month. Corn shipments are estimated at 4.99 MMT for December according to ANEC, which would be above the 3.62 MMT from the same period last year.\nStatistics Canada estimates the 2025 corn production for the country at 14.867 MMT, down 3.1% from the same week last year.\nDec 25 Corn closed at $4.37 3/4, up 6 1/4 cents,\nNearby Cash was $4.02 3/4, up 4 cents,\nMar 26 Corn closed at $4.47 1/4, up 3 3/4 cents,\nMay 26 Corn closed at $4.54 1/2, up 3 3/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-04 23:21:29",
        "published_at_raw": "2025-12-04T23:21:29Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted gains on Thursday, with contracts up 3 to 4 cents in most front months, as December was up 6 ¼. The CmdtyView national average Cash Corn price was up 4 cents on the day at $4.02 3/4. USDA reported a private export sale of 100,800...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c7753f31fa67764c99980c402b7fd32d",
        "title": "Corn Futures Climb as Export Demand Shows Strength -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/corn-futures-climb-as-export-demand-shows-strength-daily-grain-highlights-ce7d51dfd089ff2d",
        "all_text": "By Kirk Maltais\n--Corn for March delivery rose 0.7% to $4.46 3/4 a bushel on the Chicago Board of Trade Thursday, in reaction to continued signs from the USDA that demand for U.S. corn exports is coming in stronger from overseas than previously expected.\n--Soybeans for January delivery rose 0.4% to $11.20 a bushel.\n--Wheat for March delivery rose 0.3% to $5.40 1/2 a bushel.\nHIGHLIGHTS\nKey Data Point: Next week's WASDE report from the USDA isn't expected to make many supply-side changes to U.S. row crops, said Matt Zeller of StoneX in a note. \"Wild discrepancies in the current corn and soybean export paces will be the key focus of the trade for Tuesday's 2025 edition,\" he explained, adding that the stories for corn and soybean demand is different. \"Will the government further cut their soybean export estimate with China slow to buy thus far, and/or further increase already-aggressive corn exports with that campaign off to a record hot start?\" said Zeller.\nNo Mention: The USDA announces new flash sales of U.S. grain exports to Mexico and Colombia, with no mention of China. For the 2025/26 marketing year, the government reports 100,800 metric tons of corn for delivery to Colombia and 392,500 metric tons of corn for delivery to Mexico. Traders hoped that the USDA would announce more sales of soybeans to China. Still, news that shipments of purchases already made by China are being shipped is encouraging, said ADM Investor Services in a note.\nINSIGHT\nMeeting Expectations: The USDA",
        "authors": "None",
        "publish_date": "2025-12-04 20:07:25",
        "published_at_raw": "2025-12-04T20:07:25Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\n--Corn for March delivery rose 0.7% to $4.46 3/4 a bushel on the Chicago Board of Trade Thursday, in reaction to continued signs from the USDA that demand for U.S. corn exports is...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5709d9c93d2b5abb8895cb65b10bb6a6",
        "title": "Corn Bulls Pushing Back Higher on Thursday as Export Business Picks Up",
        "doc_url": "https://www.barchart.com/story/news/36460706/corn-bulls-pushing-back-higher-on-thursday-as-export-business-picks-up",
        "all_text": "Corn futures are trading with Thursday gains of 3 to 6 ¼ cents at midday. The CmdtyView national average Cash Corn price is up 4 cents at $4.02 3/4.\nUSDA reported a private export sale of 100,800 MT of corn to Colombia, with 392,500 MT to Mexico this morning via their daily reporting system.\nExport Sales for the week of October 30 was out this morning, with a total of 1.99 MMT of corn sold. That was on the higher side of trade ideas looking for 0.8-2.5 MMT in corn sales during that week. That was back above the week prior and the third largest total for the marketing year.\nBrazil corn exports are estimated at 4.99 MMT for December according to ANEC, which would be above the 3.62 MMT from the same period last year.\nStatistics Canada estimates the 2025 corn production for the country at 14.867 MMT, down 3.1% from the same week last year.\nDec 25 Corn is at $4.37 3/4, up 6 1/4 cents,\nNearby Cash is at $4.02 3/4, up 4 cents,\nMar 26 Corn is at $4.47 1/4, up 3 3/4 cents,\nMay 26 Corn is at $4.54, up 3 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-04 18:13:00",
        "published_at_raw": "2025-12-04T18:13:00Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with Thursday gains of 3 to 6 ¼ cents at midday. The CmdtyView national average Cash Corn price is up 4 cents at $4.02 3/4. USDA reported a private export sale of 100,800 MT of corn to Colombia, with 392,500 MT to Mexico thi...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e1b154d4198a34323b245a6e59265dce",
        "title": "Corn Bulls Taking Some Gains Back on Thursday AM Trade",
        "doc_url": "https://www.barchart.com/story/news/36454232/corn-bulls-taking-some-gains-back-on-thursday-am-trade",
        "all_text": "Corn price action is showing steady to 2 cent higher trade on Thursday morning. Futures posted Wednesday losses of 5 to 7 cents across most contracts at the close. Open interest was down 10,627 contracts on the midweek session, suggesting some longs taking profits. The CmdtyView national average Cash Corn price was down 6 1/2 cents at $3.98 3/4.\nWeekly EIA data from Wednesday morning showed a record ethanol production total in the week ending on November 28, totaling 1.126 million barrels per day, a 13,000 bpd increase wk/wk. Stocks of ethanol rose 543,000 barrels to 22.511 million. That came as the 48,000 bpd increase to exports (170,000 bpd) wasn’t enough to offset the increased output and 28,000 bpd drop in refiner inputs of ethanol (at 857,000 bpd).\nExport Sales for the week of October 30 will be released this morning, with traders looking for 0.8-2.5 MMT in corn sales during that week.\nDec 25 Corn closed at $4.31 1/2, down 6 1/2 cents, currently up 2 cents\nNearby Cash was $3.98 3/4, down 6 1/2 cents,\nMar 26 Corn closed at $4.43 1/2, down 6 1/2 cents, currently up 1 cents\nMay 26 Corn closed at $4.50 3/4, down 6 3/4 cents, currently up 3/4 cent",
        "authors": "None",
        "publish_date": "2025-12-04 13:34:56",
        "published_at_raw": "2025-12-04T13:34:56Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is showing steady to 2 cent higher trade on Thursday morning. Futures posted Wednesday losses of 5 to 7 cents across most contracts at the close. Open interest was down 10,627 contracts on the midweek session, suggesting some longs...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9ba70de52901152247ff055d0c944849",
        "title": "Grain Market Update: Where are Corn and Soybean Prices Headed?",
        "doc_url": "https://www.barchart.com/story/news/36443754/grain-market-update-where-are-corn-and-soybean-prices-headed",
        "all_text": "I joined Michelle Rook on AgWeb's Markets Now this morning to offer my analysis of the agricultural markets, with a detailed focus on corn, soybeans, silver, interest rates, and the stock market. Watch the full interview here.\nMichelle Rook: Welcome to Markets Now. I'm Michelle Rook with Darin Newsom, senior market analyst with Barchart. Seeing quite a bit of red on the board in the ag sector this morning, with the exception of hogs, but the green's all in negative territory. Darin, let's start out there because corn and wheat got a little pop yesterday on what looked to be a little geopolitical risk premium. Back down this morning, so probably just some profit-taking?\nDarin Newsom: Yes. Either that or just the realization that geopolitics haven't changed, and the fundamentals haven't changed in the markets. To me, there is still some concern about US supplies as we look out towards next planting season for the 2026 US crop. Vendors are going to stay tight. There's not going to be a lot of bushels moving to town. If we can somehow keep solid demand underneath the market, we can see that in the May, July spread. I think it's covering something like 24%, 25% calculated full commercial carry at yesterday's close.\nThat's a bullish level. There is some concern out there. Not that the US is going to run out of corn anytime soon, but available supplies might tighten up during the next planting season. I don't think the politics have changed. It certainly doesn't look like the fundam",
        "authors": "None",
        "publish_date": "2025-12-04 00:38:07",
        "published_at_raw": "2025-12-04T00:38:07Z",
        "meta_site_name": "Barchart",
        "description": "Despite early pressure, the agricultural and commodity markets remain fundamentally constrained, with corn supplies ample yet supported by strong demand, soybeans awaiting confirmed Chinese export business, and the broader commodity complex influence...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5de2c283e7385b98fc2d591c18349913",
        "title": "Brazil soy exports jump 64% in November ahead of Chinese shift to US",
        "doc_url": "https://www.reuters.com/world/china/brazil-soy-exports-jump-64-november-ahead-chinese-shift-us-2025-12-04/",
        "all_text": "SAO PAULO, Dec 4 (Reuters) - Brazil's soybean exports jumped 64% in November from a year ago to 4.2 million metric tons, the government said on Thursday, with good local supply allowing elevated shipments before the world's largest importer China shifts to United States' beans.\nBrazil soy exports normally fall towards the end of the year as the country approaches the new harvest late on January or early February, but a record crop in 2025 means there are still enough supplies to keep foreign sales going, grain exports lobby Anec said on Thursday.\nSign up here.\nAnec projects December shipments to also increase sharply, around 90%, to 2.8 million tons. The industry group sees total Brazilian soy exports at 110 million tons in 2025 from 97.3 million tons in 2024.\nChina bought several vessels of soybeans from the U.S. recently, with loadings expected already in December. The Chinese buying is part of its trade deal with the U.S.\nCORN EXPORTS\nBrazilian corn exports, however, are expected to fall short of expectations, Anec said.\nThe group reduced its corn shipment projection by 1 million tons for 2025, to 41 million tons, citing increasingly higher domestic demand.\nBrazil's booming corn ethanol and meat industries are boosting internal demand for the cereal, according to Anec.\nOn Wednesday, an association representing pork and chicken processors, which uses corn as feed, projected a rise in output and exports for both meat types, indicating strong demand for the cereal.\nDespite th",
        "authors": "None",
        "publish_date": "2025-12-04 22:21:52",
        "published_at_raw": "2025-12-04T22:21:52Z",
        "meta_site_name": "Reuters",
        "description": "Brazil's soybean exports jumped 64% in November from a year ago to 4.2 million metric tons, the government said on Thursday, with good local supply allowing elevated shipments before the world's largest importer China shifts to United States' beans.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "122a0bfcd00787dfade04859df6c84da",
        "title": "Oil Tanker Rates Skyrocket by 467% Amid Shipping Chaos",
        "doc_url": "https://oilprice.com/Latest-Energy-News/World-News/Oil-Tanker-Rates-Skyrocket-by-467-Amid-Shipping-Chaos.html",
        "all_text": "The daily rates for chartering a vessel to transport commodities have surged this year, with oil tanker rates skyrocketing by 467%, as shippers of a growing commodity supply are grappling with a series of route disruptions and sanctions.\nDespite the typically weaker commodity demand period toward the end of each year, the last weeks of 2025 don’t show any weakness in the vessel rates for transporting crude oil, LNG, iron ore, or wheat.\nThe unusual strength at the end of the year has seen oil tanker rates on the key shipping routes surge by 467% year to date, according to Bloomberg’s estimates based on data from the Baltic Exchange and commodity markets data provider Spark Commodities.\nLNG tanker rates have soared fourfold, while the daily rates for vessels shipping iron ore have more than doubled year to date, the data showed on Thursday.\nAt the end of November, supertanker rates on the route between the Middle East and China hit their highest in five years as traders sought alternatives to Russian crude after the U.S. sanctioned Russia’s biggest oil producers and exporters, Rosneft and Lukoil. Rates for smaller tankers have also shot up as traders turn to all available vessels to transport crude.\nTanker rates have been climbing for over a month amid sanction-related disruptions that led to a surge in oil in transit.\nIn the LNG freight market, spot charter rates to hire an LNG tanker on the U.S. to Europe route have jumped to their highest level in two years as soaring Americ",
        "authors": "None",
        "publish_date": "2025-12-04 16:30:00",
        "published_at_raw": "2025-12-04T16:30:00Z",
        "meta_site_name": "OilPrice",
        "description": "Daily rates for chartering vessels to transport crude oil, LNG, iron ore, and wheat have surged dramatically in 2025 due to route disruptions, sanctions, and tight supply, with oil tanker rates skyrocketing by 467%.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5ef61489dcb6d6780df18a5cc741559a",
        "title": "Wheat Prices Are Falling on Supply Concerns Amid Russia-Ukraine Peace Talks. Make This 1 Trade Now.",
        "doc_url": "https://www.barchart.com/story/news/36456576/wheat-prices-are-falling-on-supply-concerns-amid-russia-ukraine-peace-talks-make-this-1-trade-now",
        "all_text": "March soft red winter wheat (ZWH26) futures present a selling opportunity on more price weakness.\nSee on the daily bar chart for March soft red winter wheat futures that prices are trending lower and this week hit a four-week low. See, too, at the bottom of the chart that the moving average convergence divergence (MACD) indicator is in a bearish posture as the blue MACD line is below the red trigger line and both lines are trending down.\nFundamentally, the global supply and demand balance sheet is not bullish for wheat. Also not price-friendly for wheat is the possibility of a Russia-Ukraine peace deal that would suggest more grains being shipped out of the Black Sea. It also appears the bullish aspect of the U.S.-China trade truce has now been factored into grain futures prices.\nA move in March SRW wheat futures below chart support at $5.34 would give the bears more power and it would also become a selling opportunity. The downside price objective would be $5.00, or below. Technical resistance, for which to place a protective buy stop just above, is located at $5.50.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in nature.\nHere is what the Commodity Futures Trad",
        "authors": "None",
        "publish_date": "2025-12-04 14:59:29",
        "published_at_raw": "2025-12-04T14:59:29Z",
        "meta_site_name": "Barchart",
        "description": "March soft red winter wheat futures present a selling opportunity on more price weakness.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "dcaf450d6d4ebb21515b0adf146db4e0",
        "title": "Tiffany warns Wisconsin could face Minnesota-style welfare scandal",
        "doc_url": "https://www.foxnews.com/politics/wisconsin-refusing-learn-lesson-minnesota-after-fraud-scandal-gop-gov-hopeful-warns",
        "all_text": "NEWYou can now listen to Fox News articles!\nEXCLUSIVE: Minnesota’s Democrat-led neighbor could be missing a chance to prevent a Feeding Our Future–style crisis, Rep. Tom Tiffany, R-Wis., warned Thursday.\nMinnesota Gov. Tim Walz has faced widening scrutiny over a fraud scheme in which members of the Twin Cities’ Somali community allegedly diverted taxpayer-funded meal money overseas, including to terror group Al-Shabaab.\nTiffany, who is running to be Wisconsin’s governor in 2026, slammed retiring incumbent Democratic Gov. Tony Evers for prominently rebuking the Trump administration’s efforts to conduct audits of SNAP – or food stamps – programs in the 50 states.\nOn Thursday, Tiffany’s office shared a letter with Fox News Digital that he planned to send to Evers later in the day.\nTRUMP 'TOOK NOTES FROM THE GRINCH': STATES SUE OVER SNAP PROGRAM CHANGES\n\"Like many Wisconsin residents, I was disappointed by your recent public statements ruling out cooperation with the federal government to detect fraud in the food stamp program,\" Tiffany wrote. \"We should all be able to agree that fraud and abuse in vital safety net programs is unacceptable, which is why I hope you will reconsider your position.\"\nHe added: \"Your position on this matter is even more shocking given recent developments in our neighboring state of Minnesota. There, the governor’s mismanagement and lack of transparency in food security programs have led to multiple investigations of a taxpayer-funded fraud scheme total",
        "authors": "None",
        "publish_date": "2025-12-04 22:41:06",
        "published_at_raw": "2025-12-04T22:41:06Z",
        "meta_site_name": "Fox News",
        "description": "Wisconsin governor refuses USDA request to audit SNAP program for fraud while neighboring Minnesota faces $1 billion food assistance scandal investigation.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "edb7c2ac8f86ff32b30da2ab531aa0cc",
        "title": "USDA Allocates $3.6M for Rural Iowa Businesses and Emergency Services",
        "doc_url": "https://www.agriculture.com/partners-usda-allocates-usd3-6m-for-rural-iowa-businesses-and-emergency-services-11862566",
        "all_text": "By Cami Koons\nThe U.S. Department of Agriculture Rural Development has awarded more than $3.6 million in “pass through” loans and grants to local utilities to benefit community businesses and emergency services.\nIowa’s Rural Development Deputy State Director Henry Kummerer announced the grants Thursday, which will impact Butler, Carroll, Decatur, and Webster counties.\nThe funding comes from USDA’s Rural Economic Development Loan and Grant program, which helps local utilities establish revolving loan funds to support projects that will create or retain jobs in their communities. According to USDA, the loans to the local utilities are interest-free.\nUSDA awarded $1 million each to Raccoon Valley Electric Cooperative and Corn Belt Power Cooperative to establish pass through loans to Iowa Corn Processors for the purpose of updating equipment and a packaging line at a milling facility in Glidden.\nAccording to the news release from USDA, the pass through loans to Iowa Corn Processors will create five new jobs and spur economic development in Carroll County.\nUSDA awarded a $1 million loan to Central Iowa Power Cooperative to pass through to Industrial Hardfacing Inc., a Lamoni-based manufacturer that makes custom parts for rendering, meatpacking, oil seed and pet food production. The pass through loan is expected to create six jobs, fund a building expansion and equipment purchases.\nTwo pass through grants, each for $300,000 will help establish a dental practice in Fort Dodge. One g",
        "authors": "None",
        "publish_date": "2025-12-04 22:28:07",
        "published_at_raw": "2025-12-04T22:28:07Z",
        "meta_site_name": "Successful Farming",
        "description": "The U.S. Department of Agriculture Rural Development has awarded more than $3.6 million in “pass through” loans and grants to local utilities to benefit community businesses and emergency services.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "99bd0411176be59ed78c1d63d2be40d8",
        "title": "Michigan farmland prices outpace the national average, data shows",
        "doc_url": "https://www.cbsnews.com/detroit/news/michigan-farmland-prices-outpace-the-national-average/",
        "all_text": "The price for farmland in Michigan is outpacing the national average, according to data from the U.S. Department of Agriculture.\nAccording to the USDA, the price of farmland across the U.S. increased by about 4%, while the price in Michigan rose by about 8% from 2024 to 2025.\n\"There could be many factors that contribute to that,\" said Bryan Combs, who works as chief of the environment, economic, and demographic branch of the USDA.\nCombs said one of the reasons why the price might be going up is simple supply and demand.\n\"We're actually seeing the number of farms decrease-- the amount of land within farms is also decreasing,\" said Combs.\nThere are fewer farms as land is bought up or as farmland is consolidated, which in turn brings prices up. Combs said the farming population is aging.\n\"Some of those farms are likely retiring or getting out of the farming business and passing that on to a next generation or to some other operator,\" he said.\nIn Michigan, demand for land is only increasing-- tax breaks passed by the Michigan Legislature last year have encouraged an influx of major data center projects across the state.\nThose are projects looking for hundreds or even thousands of acres of land-- from Howell Township to Saline over to Genesee County, these projects are popping up and looking for space.",
        "authors": "None",
        "publish_date": "2025-12-04 21:50:19",
        "published_at_raw": "2025-12-04T21:50:19Z",
        "meta_site_name": "CBS News",
        "description": "According to the USDA, the price of farmland across the U.S. increased by about 4%, while the price in Michigan rose by about 8% from 2024 to 2025.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2e2d81c441aa6f10ab3cab8c28b85b6e",
        "title": "USDA Will Withhold SNAP Funds From 21 States That Refused To Provide Data",
        "doc_url": "https://www.zerohedge.com/political/usda-will-withhold-snap-funds-21-states-refused-provide-data",
        "all_text": "Via American Greatness,\nU.S. Secretary of Agriculture Brooke Rollins says she will be moving to stop federal funding to 21 non-compliant states that have refused to provide data from the Supplemental Nutrition Assistance Program (SNAP).\nIn February, the Trump administration had asked all states to provide their SNAP data to the federal government as part of the administration’s efforts to root out waste and fraud in the welfare program.\n29 mostly Republican-led states provided the data and revealed 500,000 cases of duplicate benefits as well as 186,000 deceased individuals’ Social Security numbers in use.\nBut 21 mostly Democrat-led states, including California, Minnesota and New York, have dug in their heels and refused to provide the information, citing concerns over privacy.\nSecretary Rollins told reporters that if a state refuses to share data on criminal use of SNAP benefits, “it won’t get a dollar of federal SNAP administrative funding.”\nRollins said that cooperation is needed from all states in order to root out fraud in the SNAP program and that action is impending for those states that refuse to provide names and immigration status of aid recipients.\nSpeaking at a Cabinet meeting Tuesday, Rollins said, “We asked for all the states for the first time to turn over their data to the federal government to let the USDA partner with them to root out this fraud, to make sure that those who really need food stamps are getting them, but also to ensure that the American taxpaye",
        "authors": "None",
        "publish_date": "2025-12-04 16:45:00",
        "published_at_raw": "2025-12-04T16:45:00Z",
        "meta_site_name": "ZeroHedge",
        "description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a731cfeed2e885ee38e3908b432722ad",
        "title": "Grains Mixed Shortly After Day Trade Opens | Thursday, Dec. 4, 2025",
        "doc_url": "https://www.agriculture.com/grains-mixed-shortly-after-day-trade-opens-or-thursday-dec-4-2025-11861898",
        "all_text": "Shortly past 8:30 a.m. CT, March corn was unchanged at $4.43½ per bushel.\nJanuary soybeans were up 2½¢ at $11.18¼ per bushel.\nMarch CBOT wheat was down 5¼¢ at $5.33 per bushel. March KC wheat was down 4¾¢ at $5.24¾ per bushel. March Minneapolis wheat was down 3¼¢ at $5.73.\nThis morning USDA announced new export sales:\nColombia is buying 100,800 metric tons of corn for the 2025/2026 marketing year\nMexico is buying 392,500 metric tons of corn for the 2025/2026 marketing year.\nShortly past 8:30 a.m. CT, January feeder cattle were up $3.55 at $335.40 per hundredweight (cwt). February live cattle were up $2 at $223.90 per cwt. February lean hogs were up 80¢ at $81.80 per cwt.\nJanuary crude oil was up 6¢ at $59.01 per barrel.\nThe U.S. Dollar Index December contract was down to 98.80.\nThe S&P 500 Index was up 12.47 points, and the Dow Jones Industrial Average was up 119.15 points.\nPublished: 9:06 a.m. CT",
        "authors": "None",
        "publish_date": "2025-12-04 15:06:24",
        "published_at_raw": "2025-12-04T15:06:24Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA announced new export sales this morning.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c4419123a1b254dc3415c634446e8fda",
        "title": "Conservation Advocates Look to Fast-Track Crop Insurance Products",
        "doc_url": "https://www.agriculture.com/partners-conservation-advocates-look-to-fast-track-crop-insurance-products-11861597",
        "all_text": "Advocates of conservation practices and cover crops are looking to speed up the development of new crop insurance products by going around USDA to start testing coverage for growers who want to produce rye as a cover crop and cash crop.\nThe AGree Coalition is raising money from private investors and going through state insurance regulators to get the product into the field as a pilot project.\nThe idea, says AGree Senior Adviser Todd Barker, is to develop the data needed to accelerate the process of getting the coverage approved under the federal crop insurance system.\nThe product would likely just be offered in a handful of states. Kansas, Nebraska and South Dakota are possibilities as well as areas of the southern Corn Belt.\n“The goal would be to get the private product into one of these two regions, build the data set, [and] build the kind of market data that shows that there’s interest from farmers, that we’ve established some of the market demand … and addressed some of the infrastructure issues,” Barker told Agri-Pulse.\nThe insurance coverage would be for hybrid rye, which can be used for livestock feed as well as distilling and other purposes, as opposed to cereal rye, which is popular as a cover crop. Barker notes that federal insurance already is available for cereal rye in a few areas.\nA longstanding challenge to getting farmers to try new crops is the lack of crop insurance to manage their risk.\nAGree has tried to fill the gap by working through USDA to get approval",
        "authors": "None",
        "publish_date": "2025-12-04 12:48:45",
        "published_at_raw": "2025-12-04T12:48:45Z",
        "meta_site_name": "Successful Farming",
        "description": "Advocates of conservation practices and cover crops are looking to speed up the development of new crop insurance products by going around USDA to start testing coverage for growers who want to produce rye as a cover crop and cash crop.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e5d14240a516a0bf4cad8bdf35730d63",
        "title": "Healey blasts Trump on threat to withhold SNAP funding, won't provide data",
        "doc_url": "https://www.bostonherald.com/2025/12/03/healey-blasts-trump-on-threat-to-withhold-snap-funding-wont-provide-data/",
        "all_text": "Gov. Maura Healey is condemning President Donald Trump for threatening to withhold funding for SNAP from 21 blue states, which the White House says refuse to comply with USDA anti-fraud data requirements.\nFollowing an event at the Department of Public Health headquarters in Boston on Wednesday, Healey called the Trump administration’s move “outrageous” and “cruel.”\n“It’s outrageous, it’s cruel, it’s appalling. President Trump has already been ordered to provide SNAP benefits. I thought it was kind of unbelievable when I saw it,” said Healey. “What President Trump needs to do immediately is order Secretary Rollins to release SNAP funding and ensure that Americans don’t go hungry.”\nThe Trump administration says it will withhold SNAP food aid from recipients in most Democratic-controlled states starting next week, citing those states’ refusal to provide USDA FNS (Food and Nutrition Service) required information on recipients – including their immigration status.\nAgriculture Secretary Brooke Rollins made the announcement during Trump’s cabinet meeting Tuesday, saying the funding cuts will begin next week.\n“In February of this year we asked for all of the states for the first time to turn over their data to the federal government, to let the USDA partner with them to root out this fraud to make sure that those who really need food stamps are getting them, but to also ensure the American taxpayer is protected,” Rollins said.\n“Twenty-nine states said yes, not surprisingly the red st",
        "authors": "None",
        "publish_date": "2025-12-04 01:44:55",
        "published_at_raw": "2025-12-04T01:44:55Z",
        "meta_site_name": "The Boston Herald",
        "description": "Governor Maura Healey is condemning President Donald Trump for threatening to withhold federal SNAP funding from 21 blue states, which the White House says refuse to comply with USDA anti-fraud data requirements.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:19",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]