[
    {
        "id": "8c55bc068c262c35a1eb99a7ae1fcbbe",
        "title": "The breaking point: American farms are in crisis",
        "doc_url": "https://www.naturalnews.com/2026-01-10-the-breaking-point-american-farms-in-crisis.html",
        "all_text": "A prominent Georgia farmer has cut 45% of his leased acreage due to unsustainable input costs and low commodity prices.\nEconomists warn of a severe cost-price squeeze, with projected negative profits per acre for major crops like corn and soybeans.\nInput costs for items like fertilizer, seed and machinery remain near record highs while crop revenues have fallen sharply.\nThe financial strain is leading to increased farm exits, bankruptcies and warnings of unplanted cropland in 2026.\nPolicy safety net improvements are not set to take effect until late 2026, leaving farmers to navigate a deepening crisis.\nIn the heart of Georgia's prime agricultural belt, a generational grower's drastic decision to abandon nearly half his farmland has become a stark symbol of a deepening national crisis. Interviewed by Farm Journal, Alex Harrell, a record-setting soybean producer, shared how just a few months ago, he notified a dozen landlords that he was dropping his lease on their acreage—3,000 acres of his 6,000-acre operation. This move, driven by a brutal combination of skyrocketing production expenses and collapsing commodity prices, signals an alarming inflection point for American agriculture. As farmers from the Southeast to the Mid-Atlantic grapple with the same economic vise, warnings grow of significant unplanted acreage in the coming year, threatening the stability of the nation's food production system.\nThe unbearable math of modern farming\nHarrell’s choice was not impulsive but th",
        "authors": "None",
        "publish_date": "2026-01-10 05:25:15",
        "published_at_raw": "2026-01-10T05:25:15Z",
        "meta_site_name": "Natural News",
        "description": "A prominent Georgia farmer has cut 45% of his leased acreage due to unsustainable input costs and low commodity prices. Economists warn of a severe cost-price squeeze, with projected negative profits per acre for major crops like corn and soybeans. Input costs for items like fertilizer, seed and machinery remain near record highs while crop […]",
        "key_word": "soybean OR soybeans OR soybean futures OR soybean prices OR soybean export OR soybean import OR soybean yield OR soybean harvest OR soybean acreage",
        "collected_at": "2026-02-04 15:33:31",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f6a0137fdb10f9441762e5f8b3b484b3",
        "title": "Impact of Estimated Farmer Bridge Assistance on 2025 Farmer Return Projections",
        "doc_url": "https://www.agriculture.com/partners-impact-of-estimated-farmer-bridge-assistance-on-2025-farmer-return-projections-11870951",
        "all_text": "By Nick Paulson, Gary Schnitkey, and Carl Zulauf\nLast week the USDA officially announced $12 billion in bridge assistance for US farmers to offset economic losses associated with low prices, high production costs, and trade disputes for the 2025 crop year. We provide estimates of what the bridge assistance payment rates could be for the larger acreage row crops, and incorporate the payment estimates for corn and soybeans into updated average farmer return estimates for regions of Illinois. Updated return estimates improve to slightly above breakeven levels for cash rent situations in northern and central Illinois, while return projections for southern Illinois in 2025 remain negative. We emphasize that the FBA payment levels used in these updates are estimates and that final payment levels, planned for release during the week of Dec. 22, will likely differ. Further note that 2025 farmer return projections are increased by government payments — both from ARC/PLC and Farmer Bridge payments — which will be received in 2026.\nFarmer Bridge Assistance Payment Estimates\nOn Dec. 8, 2025 the USDA announced a new round of ad hoc economic assistance for U.S. farmers. The Farmer Bridge Assistance (FBA) program will provide $12 billion in support payments. The stated reason for FBA is to offset losses associated with unfair trade practices. $11 billion of the total will be used for payments to eligible row crop producers while the remaining $1 billion will go towards specialty crops. Spec",
        "authors": "None",
        "publish_date": "2025-12-17 12:16:25",
        "published_at_raw": "2025-12-17T12:16:25Z",
        "meta_site_name": "Successful Farming",
        "description": "This article provides estimates of what the Farmer Bridge Assistance payment rates could be for the larger acreage row crops and incorporates the payment estimates for corn and soybeans into updated average farmer return estimates for regions of Illinois. Importantly, the payment levels used in these updates are estimates. Final payment levels, planned for release during the week of Dec. 22, will likely differ.",
        "key_word": "\"United States Department of Agriculture\" OR USDA OR crop report OR WASDE OR grain stocks OR acreage report",
        "collected_at": "2026-02-04 15:33:31",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cd488a2ea13f3822af5c8750765c78f9",
        "title": "Brazilian soybeans output may reach 177 million tonnes: Report",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/brazilian-soybeans-output-may-reach-177-million-tonnes-report/article70508173.ece",
        "all_text": "Brazilian soybean acreage is expected to record a 2 per cent increase for the 2025-26 cycle, according to ‘Brazil agribusiness outlook 2026’ by RaboResearch.\nIf current yield trends persist, production is projected to reach a new record of 177 million tonnes (mt). Planting conditions and operational progress remain above the five-year average, reinforcing positive expectations for the upcoming crop, it said.\n“For the 2025-26 cycle, despite high interest rates continuing to pressure farmers’ cash flow - many still highly leveraged - RaboResearch projects a 2 per cent increase in soybean acreage. While this represents growth, it is below the 15-year average expansion rate of roughly 4 per cent per year,” it said.\nCompetitive to US\nLooking ahead to trade performance, Brazilian exports are expected to maintain the record volumes of 2025, estimated at 111 mt. “Despite the recent US-China trade agreement, Brazilian soybeans remain competitive compared to US supplies. Moreover, any volumes agreed between the US and China could fall short of expectations, potentially favouring Brazilian exports once again,” it said.\nUpon processing, RaboResearch projects a 2 mt increase in crushing, totalling 60 mt in 2025-26. This growth is driven by the anticipated rise in the mandatory biodiesel blend to 16 per cent, as outlined in the ‘Fuel of the Future’ law. However, uncertainties remain regarding implementation in March 2026, which could limit the pace of processing growth, it said.\nExcluding ",
        "authors": "None",
        "publish_date": "2026-01-14 05:27:02",
        "published_at_raw": "2026-01-14T05:27:02Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "Brazilian soybean acreage is expected to record a 2 per cent increase for the 2025-26 cycle, according to ‘Brazil agribusiness outlook 2026’ by RaboResearch.",
        "key_word": "soybean OR soybeans OR soybean futures OR soybean prices OR soybean export OR soybean import OR soybean yield OR soybean harvest OR soybean acreage",
        "collected_at": "2026-02-04 15:33:34",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0c5e7ff4b67c9b488be6c16f11774d2f",
        "title": "Wheat production hinges on MP, Rajasthan as area dips in UP & Punjab",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/wheat-production-hinges-on-mp-rajasthan-as-area-dips-in-up-punjab/article70543180.ece",
        "all_text": "A marginal drop in wheat area this year in Uttar Pradesh, Punjab and Bihar has been compensated by a significant rise of over 8 lakh hectares (lh) in Madhya Pradesh and about 4 lh in Rajasthan. The increase in acreage in MP and Rajasthan took the pan-India coverage to a record high.\nHowever, the overall production of wheat will depend on the yield in M.P., Rajasthan and Gujarat where the crop matures a little earlier and the temperature in February, the grain-filling period, plays a crucial role in yield. Total wheat acreage stood at an all time high 334.17 lh in 2025-26, compared with 328.04 lh last year, up by 2 per cent.\nAmong the top six major states that account for nearly 90 per cent of the national coverage under wheat, the acreage in UP was 2 per cent lower at 94.13 lh, Punjab 1 per cent down at 34.89 lh and Bihar 13 per cent lower at 19.92 lh. But, the acreage has increased 11 per cent to 85.73 lh in Madhya Pradesh, 12 per cent to 35.49 lh in Rajasthan and 3 per cent to 24.48 lh in Haryana.\nGujarat too up\nFarmers in Gujarat too have raised the wheat area by 3.3 per cent to 13.24 lh, but in Maharashtra they have cut acreage by 3.3 per cent to 11.49 lh.\n“Last year, the government had relaxed minimum quality norms of wheat in all districts of Rajasthan and four districts of Madhya Pradesh to help enable farmers sell their produce at the minimum support price (MSP) to notified agencies during procurement. These two states and Gujarat are more at risk from any temperature",
        "authors": "None",
        "publish_date": "2026-01-23 16:08:40",
        "published_at_raw": "2026-01-23T16:08:40Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "Wheat production is shifting to M.P. and Rajasthan, with February temperatures critical for yield amid declining acreage in UP and Punjab.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7eb553e4da188456c42bd041153760e2",
        "title": "Strong wheat acreage points to plentiful output",
        "doc_url": "https://www.hindustantimes.com/india-news/strong-wheat-acreage-points-to-plentiful-output-101768849043762.html",
        "all_text": "Acreage under total rabi or winter-sown crops, at 65.2 million hectares, is up 2.3% than the five-year benchmark, according to the official data. The total area sown is however slightly less than the previous year’s acreage, when it was 65.9 million hectares. Most winter crops are nearing the harvesting stage, which usually begins at the end of February.\nThe winter-sown season accounts for nearly half of India’s annual food supply and robust harvests help to keep a lid on inflation, aside from driving up rural demand. “Wheat sowing has remained strong and may set a new record,” an official said, requesting anonymity. In recent years, early summers have strained the country’s wheat crop in the world’s second largest grower.\nThe area under total winter pulses, a clutch of key commodities that tend to stoke prices because India still relies on imports, stood at 13.7 million hectares, down 3% from the average of 14 million hectares. The acreage under pulses is, however, marginally higher than last year’s 13.4 million hectares.\nFarmers have planted gram in 9.5 million hectares compared to a five-year average of 10 million hectares. Lentils, another key crop, have been sown on 1.8 million hectares against an average acreage of 1.5 million hectares, the data showed.\nIndia, the world’s biggest producer and consumer of pulses, depends on imports to meet domestic demand for pulses, a source of protein for a large section of Indians. Last year, the Modi government launched a mission to ",
        "authors": "None",
        "publish_date": "2026-01-19 23:42:12",
        "published_at_raw": "2026-01-19T23:42:12Z",
        "meta_site_name": "Hindustan Times",
        "description": "Farmers have planted wheat, the winter staple, on 33.4 million hectares aided by favourable weather conditions, which is 7% higher than the five-year average| India News",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c3e90e03aeeb46fbaa111524dae3f700",
        "title": "India wheat sowing touches record 33.41 million hectares in 2025-26 rabi season",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/indias-wheat-sowing-hits-record-3341-million-hectares-in-2025-26-rabi-season/article70525741.ece",
        "all_text": "Areas sown to wheat have touched a record 33.41 million hectares in the 2025-26 rabi season, buoyed by good weather, the agriculture ministry data showed.\nTotal area under wheat rose 0.61 million hectares from 32.80 million hectares in the previous year same season.\nSowing details\nSowing of wheat and other rabi or winter crops has been completed. The crop will be harvested from March onwards.\nPulses expansion\nAs per the ministry data, area sown to pulses rose marginally to 13.7 million hectares in the 2025-26 rabi season, compared with 13.3 million hectares in the year-ago.\nGram leads pulses\nAmong pulses, the gram area rose to 9.58 million hectares from 9.12 million hectares.\nCoarse cereals rise\nCoarse cereals acreage rose to 5.87 million hectares from 5.59 million hectares. Out of which maize comprised 2.75 million hectares.\nOilseeds growth\nOilseeds area rose to 9.68 million hectares during the 2025-26 rabi season from 9.33 million hectares in the year-ago season.\nOverall Rabi acreage\nTotal rabi crops were sown in 65.23 million hectares, up 3.31 per cent from 63.14 million hectares in the previous year.\nPublished on January 19, 2026",
        "authors": "None",
        "publish_date": "2026-01-19 13:36:57",
        "published_at_raw": "2026-01-19T13:36:57Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "India’s wheat sowing hits a record 33.41 million hectares in 2025-26 rabi season, while pulses, oilseeds and total rabi acreage also rise.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "395309ee50f0fab2a34b7211e0e5d4a9",
        "title": "Wheat output likely to exceed last year's record 117.94 mn tonne: Agri Min",
        "doc_url": "https://www.dailyexcelsior.com/wheat-output-likely-to-exceed-last-years-record-117-94-mn-tonne-agri-min/",
        "all_text": "NEW DELHI, Jan 14: The country’s wheat production is expected to surpass last year’s record of 117.94 million tonne due to higher acreage and favourable crop conditions, Agriculture Minister Shivraj Singh Chouhan said on Wednesday.\n“Currently, wheat crop is in good condition. There is no damage. By and large, production will be better than last year,” Chouhan told PTI on the sidelines of an Indian Council of Agriculture Research (ICAR) event.\nM L Jat, Director General of ICAR, said wheat acreage has crossed 32 million hectares and crop conditions remain strong.\n“As of now the crop condition is very good. If everything goes well, we will touch 120 million tonnes,” Jat said, attributing the positive outlook to timely and early sowing.\nWheat has been sown in a record area of 33.41 million hectares as of January 2 in the 2025-26 rabi season, compared with 32.80 million hectares a year earlier, the agriculture ministry data showed.\nMore than 73 per cent of the sown area has been planted with climate-resilient and bio-fortified seed varieties designed to withstand weather variations, the data showed.\nWheat is the main rabi or winter crop. Sowing has been completed and harvesting will begin in March. India is the world’s second largest wheat- producing nation after China. (PTI)",
        "authors": "None",
        "publish_date": "2026-01-14 22:58:49",
        "published_at_raw": "2026-01-14T22:58:49Z",
        "meta_site_name": "Daily Excelsior",
        "description": "NEW DELHI, Jan 14: The country’s wheat production is expected to surpass last year’s record of 117.94 million tonne due to higher acreage and favourable crop conditions, Agriculture Minister Shivraj Singh Chouhan said on Wednesday. “Currently, wheat crop is in good condition. There is no damage. By and large, production will be better than last year,” Chouhan told PTI on the sidelines of an Indian Council of Agriculture Research (ICAR) event. M L Jat, Director General of ICAR, said wheat […]",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b03c11a7ed4c63704d653c3a4795dc88",
        "title": "Wheat output likely to exceed last year's record 117.94 mn tonne: Agriculture Minister",
        "doc_url": "https://economictimes.indiatimes.com/news/economy/agriculture/wheat-output-likely-to-exceed-last-years-record-117-94-mn-tonne-agri-min/articleshow/126522936.cms",
        "all_text": "Synopsis\nIndia's wheat output is poised to break last year's record, with Agriculture Minister Shivraj Singh Chouhan anticipating a bumper harvest. Higher acreage and favorable weather conditions are credited for the positive outlook. Director General of ICAR, M L Jat, highlighted strong crop conditions and timely sowing, projecting production to potentially reach 120 million tonnes.\nThe country's wheat production is expected to surpass last year's record of 117.94 million tonne due to higher acreage and favourable crop conditions, Agriculture Minister Shivraj Singh Chouhan said on Wednesday.\n\"Currently, wheat crop is in good condition. There is no damage. By and large, production will be better than last year,\" Chouhan told PTI on the sidelines of an Indian Council of Agriculture Research (ICAR) event.\nM L Jat, Director General of ICAR, said wheat acreage has crossed 32 million hectares and crop conditions remain strong.\n\"As of now the crop condition is very good. If everything goes well, we will touch 120 million tonnes,\" Jat said, attributing the positive outlook to timely and early sowing.\nWheat has been sown in a record area of 33.41 million hectares as of January 2 in the 2025-26 rabi season, compared with 32.80 million hectares a year earlier, the agriculture ministry data showed.\nLive Events\nMore than 73 per cent of the sown area has been planted with climate-resilient and bio-fortified seed varieties designed to withstand weather variations, the data showed.\nWheat is",
        "authors": "None",
        "publish_date": "2026-01-14 09:19:00",
        "published_at_raw": "2026-01-14T09:19:00Z",
        "meta_site_name": "The Economic Times",
        "description": "India's wheat output is poised to break last year's record, with Agriculture Minister Shivraj Singh Chouhan anticipating a bumper harvest. Higher acreage and favorable weather conditions are credited for the positive outlook. Director General of ICAR, M L Jat, highlighted strong crop conditions and timely sowing, projecting production to potentially reach 120 million tonnes.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "aa0a14badb6b0caf324dbf16674b6523",
        "title": "India's Wheat Outlook Promising: Record Harvest on the Horizon",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3769046-indias-wheat-outlook-promising-record-harvest-on-the-horizon",
        "all_text": "India is on track to achieve a record-breaking wheat harvest, with production set to exceed last year's 117.94 million tonnes. Agriculture Minister Shivraj Singh Chouhan credits the success to increased acreage and favourable growing conditions.\nM L Jat, Director General of the Indian Council of Agriculture Research (ICAR), reported that wheat has been sown over 32 million hectares with robust crop progress. Jat is optimistic, anticipating a yield approaching 120 million tonnes.\nThe surge in production is attributed to the adoption of climate-resilient, bio-fortified seed varieties across 73% of the sown area. With India being the second-highest wheat producer worldwide, the harvesting phase will commence in March.\n(With inputs from agencies.)",
        "authors": "None",
        "publish_date": "2026-01-14 08:59:08",
        "published_at_raw": "2026-01-14T08:59:08Z",
        "meta_site_name": "Devdiscourse",
        "description": "India's wheat production is set to exceed the previous year's record, driven by increased acreage and favorable climate conditions. Agriculture authorities project a harvest surpassing 120 million tonnes due to the use of climate-resilient seeds and beneficial weather patterns.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "84ab878a77b9a2065c7c4e431c5f21d5",
        "title": "Wheat sowing up 2 pc to 334.17 lakh hectares till Jan 9 of current rabi season: Govt",
        "doc_url": "https://economictimes.indiatimes.com/news/economy/agriculture/wheat-sowing-up-2-pc-to-334-17-lakh-hectares-till-jan-9-of-current-rabi-season-govt/articleshow/126487258.cms",
        "all_text": "Synopsis\nWheat sowing has increased by 2 percent to 334.17 lakh hectares as of January 9. This rise in acreage for the rabi season is attributed to better monsoon rains and higher minimum support prices. Other rabi crops like paddy, pulses, Shri Anna, coarse cereals, and oilseeds have also seen increased sowing areas. Overall rabi crop coverage has reached 644.\nArea under coverage for wheat rose 2 per cent to 334.17 lakh hectares till January 9 of the ongoing rabi (winter-sown) season, according to the government data.\nWheat acreage stood at 328.04 lakh hectares in the same period of the preceding rabi season.\nSowing of wheat, a major rabi crop, generally starts from October. Better monsoon rains and increase in the minimum support price (MSP) by the government have encouraged farmers to increase sowing area.\nIn an official statement on Monday, the Union agriculture ministry released the progress of area coverage under rabi crops as on January 9, 2026.\nAs per the data, the area under coverage of paddy grew to 21.71 lakh hectares from 19.49 lakh hectares.\nLive Events\nPulses sowing area rose to 136.36 lakh hectares from 132.61 lakh hectares, while the area under coverage for Shri Anna and coarse cereals increased to 55.20 lakh hectares from 53.17 lakh hectares.\nThe acreage of oilseeds rose to 96.86 lakh hectares from 93.33 lakh hectares.\n\"Overall Rabi crop coverage reaches 644.29 Lakh Hectare reflecting steady progress of the season,\" the statement said.\nThe total area under co",
        "authors": "None",
        "publish_date": "2026-01-12 15:09:00",
        "published_at_raw": "2026-01-12T15:09:00Z",
        "meta_site_name": "The Economic Times",
        "description": "Wheat sowing has increased by 2 percent to 334.17 lakh hectares as of January 9. This rise in acreage for the rabi season is attributed to better monsoon rains and higher minimum support prices. Other rabi crops like paddy, pulses, Shri Anna, coarse cereals, and oilseeds have also seen increased sowing areas. Overall rabi crop coverage has reached 644.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f993301717c4edbcb9e51f6c12247897",
        "title": "India’s wheat acreage rises to a record high as farmers flock see it as most remunerative",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/indias-wheat-acreage-rises-to-a-record-high-as-farmers-flock-see-it-as-most-remunerative/article70474633.ece",
        "all_text": "Wheat acreage has increased to a record high during the current rabi season, exceeding last year’s final area of 328 lakh hectare (lh). Farmers have preferred the key winter cereal in view of a bearish price trend in most other crops. If the current conducive weathe continues for another two-three months, India is well poised to harvest another record crop, potentially help lift a four-year-long ban on export.\nLatest data released by the Agriculture Ministry show that wheat acreage reached 334.17 lh as of January 2, which is 2 per cent higher than 328.04 lh a year ago. As some late sowing is still going on and reports are also reaching late, the total acreage at the end of the season may reach around 335-336 lh this year, officials said.\nbusinessline last week reported a possibility of India having another year of record acreage in 2025-26.\nIIWBR advisory\nIn its fortnightly advisory valid until January 15, the Karnal-based Indian Institute of Wheat and Barley Research (IIWBR) has said favourable weather conditions are supporting vegetative growth and tillering of wheat.\n“Keeping in view the (current) favourable weather for stripe rust development,” the institute has advised wheat farmers to visit their crop regularly for observing stripe rust incidence. “Farmers are advised to inform or consult the wheat scientists/experts/extension workers for confirmation of yellow rust disease symptoms as sometimes yellowing of leaves may be due to other factors than disease,” it said and ",
        "authors": "None",
        "publish_date": "2026-01-05 14:39:43",
        "published_at_raw": "2026-01-05T14:39:43Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "India's wheat acreage hits a record high, boosted by favorable weather and farmers' preference amid declining prices of other crops.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "77c92a16ea49024f4ff2b7408db4300b",
        "title": "Sowing of India’s rabi crops almost complete",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/sowing-of-indias-rabi-crops-almost-complete/article70450064.ece",
        "all_text": "The total area under all rabi crops as of December 26 increased to 614.30 lakh hectares (lh) against 607.43 lh a year ago, according to the latest weekly update released by the Agriculture Ministry on Monday, with about 33 lh covered in the past week, the current coverage is over 96 per cent of the season’s normal area (last five years’ average) of 637.81lh.\nThe rabi acreage, which was 1.4 per cent higher as of December 19, has shrunk its lead further over the year ago period to 1.1 per cent. However, as the production last year was a record high in many winter crops, including wheat, this year, too, may witness similar level of harvests due to conducive weather conditions, so far.\nThe overall acreage was 10 per cent higher until November 14 from the year-ago period. Foodgrains production was a record high of 169.17 million tonnes (mt), and that of oilseeds was 13.64 mt out of an area of 659.39 lakh hectare (lh) in the 2024-25 rabi season.\nRecord high wheat acreage?\nThe area under winter’s key cereal wheat was 322.68 lh against 322.49 lh a year ago. The normal area of wheat is 312.35 lh and last year, the planting reached an all time high of 328.04 lh. Scientists expect this year’s wheat acreage to set another record.\nIn pulses, which reached 133.44 lh against 129.79 lh a year ago (up 3 per cent), the area under chana (gram) was 95.88 lh against 91.22 lh, up by 5.1 per cent and masur (lentil) acreage was 17.06 lh against 16.85 lh.\nOilseeds acreage was 94.29 lh as of December ",
        "authors": "None",
        "publish_date": "2025-12-29 15:01:06",
        "published_at_raw": "2025-12-29T15:01:06Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "India's rabi crop sowing nears completion, with record wheat and growing maize acreage amid favorable weather conditions.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8157f1e5981e38d6cfc048cfc5c920a1",
        "title": "Rabi sowing over in 91% normal area, acreage 1.43% higher, shows data",
        "doc_url": "https://www.business-standard.com/industry/agriculture/rabi-sowing-over-in-91-normal-area-acreage-1-43-higher-shows-data-125122200827_1.html",
        "all_text": "The sowing of rabi crops was complete in 91 per cent of the normal area during the week ended December 19, and overall acreage was marginally above than the corresponding period last year. According to data, rabi crops have been sown in around 58.07 million hectares till December 19, a 1.43 per cent increase over last year.\nThis area is also around 9 per cent lower than the normal acreage of rabi crops, which is 64 million hectares — this gap is expected to be bridged in the coming days. The area covered under wheat, mustard and pulses were all",
        "authors": "None",
        "publish_date": "2025-12-22 18:47:00",
        "published_at_raw": "2025-12-22T18:47:00Z",
        "meta_site_name": "Business Standard",
        "description": "Rabi sowing has covered 91% of the normal area so far, with total acreage 1.4% higher than last year, led by gains in wheat, mustard and pulses, official data shows",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b90cfd80311d13c61b884d6a123124f0",
        "title": "Gujarat’s Rabi sowing lags 3-yr avg by 18.5%; wheat, gram acreage declines",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/gujarats-rabi-sowing-lags-3-yr-avg-by-185-wheat-gram-acreage-declines/article70415768.ece",
        "all_text": "Reeling from losses caused by unseasonal rains during the Kharif season, farmers in Gujarat have made a slow start to the ongoing Rabi sowing. As of December 15, Rabi sowing in the state is 18.5 per cent lower than the three-year average, reflecting lingering stress among cultivators despite government relief measures\nAccording to data released by the Gujarat government, farmers have sown Rabi crops across 37.51 lakh hectares, marginally higher than the 37.14 lakh hectares recorded during the same period last year. However, the current sowing area remains significantly below the three-year average of 46.06 lakh hectares. Wheat accounts for the largest share of Rabi sowing, covering 10.83 lakh hectares, which is 14 percent lower than the average wheat sowing area of 12.64 lakh hectares. Gram has been sown across 7.09 lakh hectares, marking a decline of nearly 15 percent compared to the three-year average.\nSowing of major cash crops has also seen a notable drop. Cumin cultivation stands at 3.24 lakh hectares, reflecting a 15 percent decline, while mustard sowing has reached 2.65 lakh hectares, down 14 percent from the average levels.\nDespite the shortfall against historical trends, the state government sought to highlight the year-on-year improvement. Gujarat agriculture and farmers’ welfare minister Jitu Vaghani said that Rabi sowing has surpassed last year’s levels following the announcement of relief packages. “When the government announced ₹11,000 crore worth of relief for ",
        "authors": "None",
        "publish_date": "2025-12-19 14:32:06",
        "published_at_raw": "2025-12-19T14:32:06Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "Gujarat's Rabi sowing is 18.5% below the three-year average, with declines in wheat and gram acreage amid climate challenges.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6db84c9eebd859bdcd93c77da2ffb208",
        "title": "With India’s rabi sowing gaining 4.5%, nearly 85% of coverage complete",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/with-indias-rabi-sowing-gaining-45-nearly-85-of-coverage-complete/article70399736.ece",
        "all_text": "Nearly 85 per cent of the normal area (last 10 years) under rabi crops in India has been completed, with the coverage rising 4.5 per cent year-on-year, data from the Ministry of Agriculture and Farmers’ Welfare showed.\nAs of December 12, the total acreage was 536.76 lakh hectares (lh) compared with 512.76 a year ago. The normal coverage of all rabi crops is 637.81 lh.\nWheat sowing led the rise, with its area increasing by 6.5 per cent to 275.66 lh against 258.48 lh a year ago. The normal coverage is 312.25 lh.\nProgressing well\nThe ICAR-Institute of Wheat and Barley Research said in a statement that wheat sowing is progressing well, with overall acreage showing an increase. “Post-monsoon moisture has supported good field conditions, although some areas in Punjab and Haryana faced delays due to late paddy harvest and excess rainfall,” it said.\nOverall, farmers are completing sowing within the recommended window, and the trend remains positive for the 2025-26 crop season, it said\nOn the other hand, the Centre’s decision to increase the minimum support price of wheat by ₹160 to ₹2,585 a quintal has helped.\nSurplus post-monsoon rainfall has been another positive factor for rabi sowing. For the week-ended December 10, the post-monsoon rainfall was 20 per cent surplus, with all regions getting excess precipitation. The north-west and central parts, however, have received 62 per cent and 39 per cent more precipitation.\nChana up 4%\nSowing in rice increased by 16 per cent, though it is",
        "authors": "None",
        "publish_date": "2025-12-15 14:30:02",
        "published_at_raw": "2025-12-15T14:30:02Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "India's rabi sowing reaches 85% completion, with significant increases in wheat, rice, and mustard acreage this season.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d7fbbeab0041dee8a9552cffa7bda629",
        "title": "Indian Farmers Poised for Record Winter Crop Planting Amid Favorable Conditions",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3724936-indian-farmers-poised-for-record-winter-crop-planting-amid-favorable-conditions",
        "all_text": "Indian farmers are intensifying their efforts in planting winter crops such as wheat, rapeseed, and chickpea, setting the stage for a landmark acreage record. Enhanced soil moisture levels, thanks to a bountiful monsoon, are facilitating cultivation in regions usually left fallow.\nAs the world's second-largest wheat producer, India is poised to augment its output, stabilize domestic prices, and possibly enable New Delhi to allow limited exports of wheat flour. The surge in rapeseed production could also decrease India's reliance on imported vegetable oils. Harish Galipelli from ILA Commodities suggested that boosted reservoir levels are allowing farmers to expand their winter crop areas.\nData from the farm ministry reveals that since October 1, Indian farmers have planted winter-sown crops over 47.9 million hectares, a 6.1% increase compared to last year. Particularly in northern regions, excess rainfall has contributed to this growth, with wheat and rapeseed leading the sowing expansion.\n(With inputs from agencies.)",
        "authors": "None",
        "publish_date": "2025-12-09 13:54:24",
        "published_at_raw": "2025-12-09T13:54:24Z",
        "meta_site_name": "Devdiscourse",
        "description": "Indian farmers are set to achieve record crop acreage for winter with increased planting of wheat, rapeseed, and chickpea. Favorable monsoon rains have enhanced soil moisture, aiding in cultivation even in traditionally rainfed areas. This growth could boost output, stabilize prices, and reduce import dependency.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d33a180582ca0e1cf1b50324b98645ff",
        "title": "Wheat sowing up 11%, mustard 5% higher as farmers cover Rabi season’s 75% area",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/wheat-sowing-up-11-mustard-5-higher-as-farmers-cover-rabi-seasons-75-area/article70372842.ece",
        "all_text": "Farmers in India have completed planting of winter crops in over 75 per cent of the normal area 637.81 lakh hectares (lh) this year as per latest data of the agriculture ministry. While mustard, the key oilseed crop of the Rabi season, and barley have exceeded their normal area, wheat, chana (gram), masur (lentil), maize and paddy are likely to reach the season’s average in next few weeks.\nThe total area under all agriculture crops was 6.2 per cent higher at 479.02 lh as of December 5, as against 451.12 lh year-ago, the agriculture ministry said in a statement. The sown area under wheat was 241.40 lh as against 217.81 lh year-ago. The normal area (average of last five years) of wheat is 312.35 lh.\nThe sowing area under Rabi season’s paddy was 11.4 per cent higher at 10.98 lh from 9.86 lh and maize 3.3 per cent more at 11.41 lh from 11.05 lh. Barley acreage was at 5.95 lh from 5.68 lh year-ago whereas its normal area is 5.63 lh.\nJowar acreage reached at 18.08 lh, marginally lower from 18.56 lh, taking the total acreage under nutri/coarse cereals to 36.286 lh, up 0.9 per cent from 35.94 lh.\nIn pulses, which reached 106.21 lh against 105.78 lh year-ago, the area under chana was 77.84 lh against 75.16 lh, up by 3.6 per cent and masur acreage was 7.3 per cent lower at 12.98 lh from 14 lh.\nThe oilseeds acreage was 84.14 lh as of December 5, up by 2.9 per cent from 81.75 lh and it included coverage of 79.88 lh under mustard, which was 4.5 per cent higher from 76.43 lh year-ago, the ",
        "authors": "None",
        "publish_date": "2025-12-08 14:19:41",
        "published_at_raw": "2025-12-08T14:19:41Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "Wheat and mustard sowing increase as farmers cover 75% of Rabi season area, boosting total crop acreage by 6.2%.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0d104aa4a2c6e35b5fd071e96d552c1f",
        "title": "Competition from wheat, mustard keeps chana acreage in check",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/competition-from-wheat-mustard-keeps-chana-acreage-in-check/article70331377.ece",
        "all_text": "The area under chana during the ongoing 2025-26 rabi season is likely to be steady with a slight increase over last year, as higher planting in Gujarat and Rajasthan is expected to offset a potential decline in Madhya Pradesh. In the central Indian State, wheat has emerged as the main competitor to the season’s key pulses crop.\nHigher residual moisture and the talk of a bonus over minimum support price for wheat are seen influencing the sowing pattern in Madhya Pradesh.\n“The prevailing prices are not encouraging for the farmers to go with chana. Another concern is that the forward that we are getting from Australia is also about 10 per cent lower than the MSP,” said Satish Upadhyay, Secretary, India Pulses & Grains Association.\nNot much returns\nFarmers in Madhya Pradesh, the largest producing State, are not keen on seeding chana as they are getting more returns from wheat and maize, he said.\n“We felt that the acreage should increase this year considering the favourable weather conditions and soil moisture is good. Considering that chana does not require much spraying, farmers should have gone for it. However, it is not visible on the field. Area will be at part with last year levels, hopefully or see a marginal increase. The overall chana area will be at par with last year or may be 5-10 per cent more,” Upadhyay said.\nChana was planted on 98.55 lakh hectares (lh) during 2024-25 rabi season.\nThe anticipated decline in acreage in M.P. is likely to be offset by increasing trend ",
        "authors": "None",
        "publish_date": "2025-11-27 15:01:54",
        "published_at_raw": "2025-11-27T15:01:54Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "Chana acreage for the 2025-26 season is expected to remain steady, with increases in Gujarat and Rajasthan offsetting declines in Madhya Pradesh.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3e11672469b90ec3f5e730bc71016d94",
        "title": "India’s wheat sowing up 19% as overall rabi crops acreage gains 12%",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/indias-wheat-sowing-up-19-as-overall-rabi-crops-acreage-gains-12/article70318340.ece",
        "all_text": "India’s overall rabi crops acreage was up 12 per cent in the week ended November 21, with the area under wheat leading the show with a 19 per cent increase.\nData from the Ministry of Agriculture and Farmers’ Welfare showed that the overall acreage was up at 306.31 lakh hectares (lh) compared with 272.78 lh a year ago. The normal coverage of rabi crops is 637.81 lh. By this weekend, at least 50 per cent of this normal coverage is expected to be completed.\nThere are two reasons for the higher rabi coverage. One is the good soil moisture with rain under the South-West monsoon continuing in October and the North-East monsoon bringing surplus rainfall until a hiatus in the first fortnight of November.\nIMD rainfall data\nIndia Meteorological Department data showed that as of November 19, post-monsoon rainfall from October 1 was 27 per cent higher than normal. Rain in the north-western part was more than double to the normal, while in the central part it was 52 per cent higher.\nThe second reason is that major reservoirs in the country are filled to nearly 90 per cent of their capacity. In addition, higher minimum support prices (MSP) for key crops have helped farmers to plant more early and, besides the early harvest of kharif crops.\nThe area under wheat was up at 128.37 lh (107.79 lh a year ago). Over a third of the normal acreage of 312.35 lh has been brought under the main rabi cereal crop so far. Rice coverage was up marginally by 0.67 lh at 8.26 lh.\nPulses acreage up 8%\nThe acre",
        "authors": "None",
        "publish_date": "2025-11-24 14:39:18",
        "published_at_raw": "2025-11-24T14:39:18Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "India's wheat sowing rises 19%, driving a 12% increase in overall rabi crops acreage, aided by favorable rainfall and support prices.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "81b63c7e12ab58bdfdf5ac963060e8ed",
        "title": "Rabi Crop Sowing Surges Ahead of Last Year",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3707949-rabi-crop-sowing-surges-ahead-of-last-year",
        "all_text": "This year's rabi crop sowing is set to exceed the previous year's achievement, with expectations to go beyond 655.88 lakh hectares, according to Agriculture Secretary Devesh Chaturvedi.\nAddressing the media at a recent event, Chaturvedi noted that rabi sowing is progressing faster than at the same point last year, although some areas have faced delays due to extended harvests and heavy rainfall.\nLatest data reveals that significant gains have been observed in wheat, pulses, and oilseeds planting, highlighting an overall increase in rabi crop coverage to 208.19 lakh hectares by November 17, compared to 188.73 lakh hectares last year.",
        "authors": "None",
        "publish_date": "2025-11-24 11:24:36",
        "published_at_raw": "2025-11-24T11:24:36Z",
        "meta_site_name": "Devdiscourse",
        "description": "This year's rabi crops sowing area is on track to surpass last year's 655.88 lakh hectares, according to Agriculture Secretary Devesh Chaturvedi. Despite delayed harvests in some regions due to rainfall, wheat planting has increased significantly, with total rabi acreage reaching 208.19 lakh hectares as of November 17.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4c0c821c03d6d17d16f16b839a6872f9",
        "title": "India set for record wheat planting as soil moisture and prices rise",
        "doc_url": "https://www.reuters.com/world/china/india-set-record-wheat-planting-soil-moisture-prices-rise-2025-11-18/",
        "all_text": "MUMBAI, Nov 18 (Reuters) - Indian farmers are set to expand wheat acreage by about 5% to a record high, aided by higher returns and October's untimely rains, which improved soil moisture and encouraged a shift from rainfed crops to the cereal, industry officials told Reuters.\nThe higher planting is expected to help the world's second-largest wheat producer boost output, ease local prices, and potentially enable New Delhi to permit limited exports of wheat flour.\nSign up here.\n\"Given the higher soil moisture at this time due to increased rainfall, wheat sowing and production are expected to surpass all previous record highs,\" Nitin Gupta, senior vice president at Olam Agri India, an agicultural commodity trader, told Reuters.\nIndia's key wheat-growing north-western region was inundated with 161% more rainfall than average in October, contributing to the country's overall 49% surplus in the month.\nWheat was planted across 6.62 million hectares as of Nov. 14, up 17% from a year earlier, according to data from the Ministry of Agriculture & Farmers’ Welfare.\nPlanting for the 2025/26 season is expected to rise about 5% from last year's record 34.16 million hectares, based on an average estimate from eleven industry officials.\nWheat acreage in the key northern states of Haryana and Punjab, which benefit from reliable irrigation, is expected to remain steady, while farmers in Uttar Pradesh, Madhya Pradesh, and Rajasthan are likely to shift from less-thirsty crops such as chickpea to ",
        "authors": "None",
        "publish_date": "2025-11-18 10:47:02",
        "published_at_raw": "2025-11-18T10:47:02Z",
        "meta_site_name": "Reuters",
        "description": "Indian farmers are set to expand wheat acreage by about 5% to a record high, aided by higher returns and October's untimely rains, which improved soil moisture and encouraged a shift from rainfed crops to the cereal, industry officials told Reuters.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bf93d8a8b7cdc3ed7053ac6a6a381c47",
        "title": "India’s rabi crops acreage up 10% with wheat area rising 17%",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/indias-rabi-crops-acreage-up-10-with-wheat-area-rising-17/article70291167.ece",
        "all_text": "Early sowing is helping India to continue witnessing a higher coverage in rabi crops compared with the year-ago period. Now, with an early onset of winter with cold wave gripping many parts of the northern India, farmers are expecting the yield to improve this year, helping the government to achieve its production target.\nThe total area under all agriculture crops was 10.3 per cent higher at 208.19 lakh hectare (lh) as of November 14 against 188.73 lh a year ago. The area under barley is up by 50 per cent. The total area was 27 per cent higher as of November 7.\nLast year, the total area under all rabi crops was 663.04 lh and the foodgrains production was a record high of 167.22 million tonnes (mt) and that of oilseeds 13.57 mt.\nThis year’s target\nThe government has fixed a target of 171.14 million tonnes (mt) of foodgrains which include 119 mt of wheat, 15.86 mt of rice, 16.57 mt of pulses, 3.17 mt of nutri cereals, 14.5 mt of maize and 2.05 mt of barley, as well as 15.07 mt of oilseeds (including 13.9 mt of mustard).\nAccording to latest data compiled by the Agriculture Ministry, the area under wheat as of November 14 was 66.23 lh (up 17%) against 56.55 lh a year ago.\nKarnal-based Indian Institute of Wheat and Barley Research (IIWBR) has advised farmers to complete sowing by November 20 if they intend to do it this month and select high-yielding varieties suited to timely sowing conditions.\nIt also has asked farmers who have sown wheat in October to ensure timely weed control",
        "authors": "None",
        "publish_date": "2025-11-17 14:25:17",
        "published_at_raw": "2025-11-17T14:25:17Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "India's rabi crop acreage rises 10%, with wheat sowing up 17%, as early planting boosts yields and expectations.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c2328360a396bf37db59076d28151f36",
        "title": "Wheat sowing till Nov 11 of current rabi season up 17 pc to 66.23 lakh hectare",
        "doc_url": "https://economictimes.indiatimes.com/news/economy/agriculture/wheat-sowing-till-nov-11-of-current-rabi-season-up-17-pc-to-66-23-lakh-hectare/articleshow/125387934.cms",
        "all_text": "Synopsis\nWheat acreage for the ongoing rabi season has surged by 17% to 66.23 lakh hectares by November 11, driven by a better monsoon and increased minimum support price. Pulses, paddy, and coarse cereals also saw higher sowing, contributing to a total rabi crop coverage of 208.19 lakh hectares, up from 188.73 lakh hectares last year.\nNew Delhi: Area under coverage for wheat till November 11 of the ongoing rabi (winter-sown) season rose 17 per cent to 66.23 lakh hectares on better monsoon and an increase in minimum support price, according to the government data.\nThe wheat acreage stood at 56.55 lakh hectares in the year-ago period.\nRabi sowing season starts from October. Harvesting of rabi crops begins from March-end.\nAs on November 11, pulses sowing increased to 52.82 lakh hectare from 48.93 lakh hectare, while the area under coverage for paddy grew to 7.44 lakh hectares from 6.82 lakh hectares, according to an official statement on Monday.\nShri anna and coarse cereals acreage, too, increased to 15.53 lakh hectares from 13.50 lakh hectares.\nLive Events\nIn the non-food grain category, the area under coverage for oilseeds stood at 66.17 lakh hectares till November 11 of the current rabi season as against 62.93 lakh hectares in the year-ago period.\nThe total rabi crop sowing so far has increased to 208.19 lakh hectares from 188.73 lakh hectares.\nLast month, the government announced a 6.59 per cent increase in the minimum support price (MSP) for wheat to Rs 2,585 per quintal f",
        "authors": "None",
        "publish_date": "2025-11-17 14:25:00",
        "published_at_raw": "2025-11-17T14:25:00Z",
        "meta_site_name": "The Economic Times",
        "description": "Wheat acreage for the ongoing rabi season has surged by 17% to 66.23 lakh hectares by November 11, driven by a better monsoon and increased minimum support price. Pulses, paddy, and coarse cereals also saw higher sowing, contributing to a total rabi crop coverage of 208.19 lakh hectares, up from 188.73 lakh hectares last year.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8247f554bd41a113d3f4f0d88f029a74",
        "title": "Rabi Season Sees Significant Increase in Wheat Acreage",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3700863-rabi-season-sees-significant-increase-in-wheat-acreage",
        "all_text": "According to recent government data, the area dedicated to wheat cultivation for the ongoing rabi season has expanded by 17%, now covering 66.23 lakh hectares. This growth is attributed to better monsoon conditions and an increased minimum support price.\nComparatively, last year's wheat acreage was recorded at 56.55 lakh hectares. The rabi sowing period commences in October, with harvesting slated to begin by the end of March.\nThe latest figures also indicate an increase in the sowing of pulses, paddy, and oilseeds. Specifically, the sowing area for pulses and paddy rose, and oilseeds saw their coverage grow from 62.93 lakh to 66.17 lakh hectares.\n(With inputs from agencies.)",
        "authors": "None",
        "publish_date": "2025-11-17 13:59:55",
        "published_at_raw": "2025-11-17T13:59:55Z",
        "meta_site_name": "Devdiscourse",
        "description": "Wheat acreage for the rabi season as of November 11 increased by 17% to 66.23 lakh hectares, thanks to a favorable monsoon and a rise in minimum support price, as per government data. Pulses, paddy, and oilseed sowing also showed an upward trend in the ongoing season.",
        "key_word": "wheat OR wheat futures OR wheat prices OR wheat export OR wheat import OR wheat yield OR wheat harvest OR wheat acreage",
        "collected_at": "2026-02-04 15:33:36",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]