[
    {
        "id": "b8765a5778ff7e9cb495c78b11df1388",
        "title": "Corn Posts Weakness on Monday",
        "doc_url": "https://www.barchart.com/story/news/37237794/corn-posts-weakness-on-monday",
        "all_text": "Corn futures posted losses of 1 to 2 ¼ cents on Monday, fading back from the Friday gains. The CmdtyView national average Cash Corn price was down 2 1/4 cents at $3.91 1/4.\nUSDA’s FGIS tallied corn export shipments at 1.51 MMT (59.45 mbu) during the week ending on January 22. That was 1.63% larger than the week prior and 20.74% above the same week last year. Mexico was the top destination of 402,936 MT, with 265,122 MT headed to Japan and 210,763 MT to Spain. Marketing year exports for 2025/26 are 31.437 MMT (1.24 bbu) since September 1, which is now 53.35% larger than the same period last year.\nExport Sales data updated last Friday has corn export commitments at 56.045 MMT, which is 34% ahead of last year. That is 69% of the record USDA export estimate and ahead of the 65% average pace.\nAgRural estimates the first corn crop in the center south regions of Brazil at 5% harvested, ahead of the 2.2% pace last year. The second crop is pegged at 4.7% planted as of last Thursday, behind the 8.6% early pace in 2024/25. They raised their estimate for the country’s corn crop by 0.6 MMT to 136.6 MMT.\nMar 26 Corn closed at $4.28 1/4, down 2 1/4 cents,\nNearby Cash was $3.91 1/4, down 2 1/4 cents,\nMay 26 Corn closed at $4.36, down 2 cents,\nJul 26 Corn closed at $4.42, down 1 3/4 cents,",
        "authors": "None",
        "publish_date": "2026-01-26 23:03:29",
        "published_at_raw": "2026-01-26T23:03:29Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted losses of 1 to 2 ¼ cents on Monday, fading back from the Friday gains. The CmdtyView national average Cash Corn price was down 2 1/4 cents at $3.91 1/4. USDA’s FGIS tallied corn export shipments at 1.51 MMT (59.45 mbu) during the...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2cdcd68b1274a3041cf07b0ce1253de0",
        "title": "Corn Trading with Midday Losses on Monday",
        "doc_url": "https://www.barchart.com/story/news/37233481/corn-trading-with-midday-losses-on-monday",
        "all_text": "Corn futures are showing 1 to 2 cent losses on Monday’s midday. The CmdtyView national average Cash Corn price is down 1 3/4 cents at $3.92 3/4.\nUSDA’s FGIS tallied corn export shipments at 1.51 MMT (59.45 mbu) during the week ending on January 22. That was 1.63% larger than the week prior and 20.74% above the same week last year. Mexico was the top destination of 402,936 MT, with 265,122 MT headed to Japan and 210,763 MT to Spain. Marketing year exports for 2025/26 are 31.437 MMT (1.24 bbu) since September 1, which is now 53.35% larger than the same period last year.\nExport Sales data updated last Friday has corn export commitments at 56.045 MMT, which is 34% ahead of last year. That is 69% of the record USDA export estimate and ahead of the 65% average pace.\nManaged money trimmed their net short position in corn futures and options by just 450 contracts in the week that ended on January 20. That net short was 81,324 contracts according to Commitment of Traders data on Friday.\nAgRural estimates the first corn crop in the center south regions of Brazil at 5% harvested, ahead of the 2.2% pace last year. The second crop is pegged at 4.7% planted as of last Thursday, behind the 8.6% early pace in 2024/25. They raised their estimate for the country’s corn crop by 0.6 MMT to 136.6 MMT.\nMar 26 Corn is at $4.28 3/4, down 1 3/4 cents,\nNearby Cash is at $3.92 3/4, down 1 3/4 cents,\nMay 26 Corn is at $4.36 1/2, down 1 1/2 cents,\nJul 26 Corn is at $4.42 1/2, down 1 1/4 cents,",
        "authors": "None",
        "publish_date": "2026-01-26 18:21:01",
        "published_at_raw": "2026-01-26T18:21:01Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are showing 1 to 2 cent losses on Monday’s midday. The CmdtyView national average Cash Corn price is down 1 3/4 cents at $3.92 3/4. USDA’s FGIS tallied corn export shipments at 1.51 MMT (59.45 mbu) during the week ending on January 22....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cd0905f139341317a0008def730f4c04",
        "title": "Minnesota corn farmers blindsided by USDA report showing bigger",
        "doc_url": "https://www.austindailyherald.com/news/minnesota-corn-farmers-blindsided-by-usda-report-showing-bigger-than-expected-corn-glut-fecb3da8",
        "all_text": "By Tadeo Ruiz Sandoval\nThe USDA released new data showing corn production was much higher than previously expected. The news sent already depressed corn prices tumbling.\nThe January World Agricultural Supply and Demand Estimates report provides forecasts of corn production from the previous harvest season, making it a newsmaker because it often sets the tone for markets.\nBefore the report was released, ag analysts expected yields to hover somewhere around 16.5 billion bushels. But the USDA report projects that farmers produced more than that, pulling in 17 billion bushels\nMegan Roberts, an agricultural economist for Farm Credit Cooperative, Compeer Financial, said that is a new record in U.S. corn production.\n“It's really hard to wrap your head around how big 17 billion bushels is,” Roberts said. “That was shocking to the market, because it is now the record corn production ever in the U.S.”\nThe higher production level was driven by increased harvested acreage and higher yields.\nRoberts added that, after accounting for expected corn exports and commercial use, there will still be over 2 billion bushels left to deal with.\n“It is a challenge right now for our supplies of corn in the U.S. to have enough equivalent demand to use it up,” Roberts said.\nThe report dealt a blow to many farmers, including Rob Tate of Cannon Falls.\n“It's discouraging,” Tate said. “I was surprised and discouraged at the same time that, OK, this is what we have to deal with.”\nHe had already sold a fair a",
        "authors": "None",
        "publish_date": "2026-01-26 14:39:47",
        "published_at_raw": "2026-01-26T14:39:47Z",
        "meta_site_name": "Austin Daily Herald",
        "description": "USDA report revealing record 17 billion-bushel U.S. corn crop deepens a supply glut, driving prices lower and leaving Minnesota farmers bracing for potential losses.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "79c3d1373c1eb6b856bb00ee0a216cf1",
        "title": "Corn Slipping Back Lower Early on Monday",
        "doc_url": "https://www.barchart.com/story/news/37228136/corn-slipping-back-lower-early-on-monday",
        "all_text": "Corn price action is down 1 to 2 ½ cents on Monday morning. Futures posted 5 to 6 ½ cent gains across most contracts on Friday, as the late week strength took the weekly gain to 5 ¾ cents. Preliminary open interest was up 18,732 contracts on Friday, showing new buying interest. The CmdtyView national averageCash Corn price was up 6 3/4 cents at $3.93 1/2.\nUSDA’s Export Sales report from Friday morning showed international buyers taking advantage of the previous week’s price break. Corn bookings were the largest since March 2021 at 4.01 MMT in the week of January 15. Excluding China purchases and bunched week sales from previous government shutdowns, that was the largest week of sales since 1991. Sales were more than double the same week last year. The largest buyer was unknown destinations at 1.242 MMT, with 836,700 MT to Japan, 751,500 MT to South Korea, and 422,600 MT to Mexico. Sorghum sales totaled 526,800 MT.\nManaged money trimmed their net short position in corn futures and options by just 450 contracts in the week that ended on January 20. That net short was 81,324 contracts according to Commitment of Traders data on Friday.\nAgRural estimates the first corn crop in the center south regions of Brazil at 5% harvested, ahead of the 2.2% pace last year. The second crop is pegged at 4.7% planted as of last Thursday, behind the 8.6% early pace in 2024/25. They raised their estimate for the country’s corn crop by 0.6 MMT to 136.6 MMT.\nMar 26 Corn closed at $4.30 1/2, up 6 1/2",
        "authors": "None",
        "publish_date": "2026-01-26 13:32:10",
        "published_at_raw": "2026-01-26T13:32:10Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is down 1 to 2 ½ cents on Monday morning. Futures posted 5 to 6 ½ cent gains across most contracts on Friday, as the late week strength took the weekly gain to 5 ¾ cents. Preliminary open interest was up 18,732 contracts on Friday,...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cacbc8495890b72f60eda37c04f680cb",
        "title": "Cotton Collapses Lower on Monday",
        "doc_url": "https://www.barchart.com/story/news/37237844/cotton-collapses-lower-on-monday",
        "all_text": "Cotton futures fell back 67 to 85 points across most contracts on Monday. Crude oil futures are down 24 cents per barrel at $60.83. The US dollar index was down another $0.539 to $96.865.\nUSDA Export Sales data showed 7.35 million RB of cotton commitments as of Jan 15, 13% below last year. That was also 64% of the USDA projection and well behind the 81% average pace.\nThe Friday online auction from The Seam showed sales of 57.99 cents/lb on 5,645 bales. The Cotlook A Index was down 50 points on January 23 at 74.05 cents. ICE certified cotton stocks were down 510 bales on 1/23 with the certified stocks level at 9,912 bales. The Adjusted World Price was updated to 50.99 cents/lb on last week, down 18 points from the week prior.\nMar 26 Cotton closed at 62.97, down 84 points,\nMay 26 Cotton closed at 64.68, down 80 points,\nJul 26 Cotton closed at 66.3, down 67 points",
        "authors": "None",
        "publish_date": "2026-01-26 23:03:29",
        "published_at_raw": "2026-01-26T23:03:29Z",
        "meta_site_name": "Barchart",
        "description": "Cotton futures fell back 67 to 85 points across most contracts on Monday. Crude oil futures are down 24 cents per barrel at $60.83. The US dollar index was down another $0.539 to $96.865. USDA Export Sales data showed 7.35 million RB of cotton commit...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cb282bd1290b4453edc5ccec30249d2a",
        "title": "Hogs Close with Monday Gains",
        "doc_url": "https://www.barchart.com/story/news/37237834/hogs-close-with-monday-gains",
        "all_text": "Lean hog futures closed Monday Trade with contracts 55 to 70 cents lower, as February was down a nickel. USDA’s national base hog price was reported at $83.25 on Monday afternoon, down 31 cents. The CME Lean Hog Index was up another 55 cents on Jan 22 at $83.62.\nUSDA’s pork carcass cutout value from the Monday PM report was $1.51 higher at $97.26 per cwt. The butt and ham primals were reported lower, with the rib up $5.97. USDA estimated federally inspected hog slaughter for Monday at 426,000 head. That is 5,000 head above last week but 5,345 head below the same week last year.\nFeb 26 Hogs closed at $88.300, down $0.050,\nApr 26 Hogs closed at $96.725, up $0.550\nMay 26 Hogs closed at $100.225, up $0.675,",
        "authors": "None",
        "publish_date": "2026-01-26 23:03:29",
        "published_at_raw": "2026-01-26T23:03:29Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed Monday Trade with contracts 55 to 70 cents lower, as February was down a nickel. USDA’s national base hog price was reported at $83.25 on Monday afternoon, down 31 cents. The CME Lean Hog Index was up another 55 cents on Jan 2...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3ca391736ea486dae1e768eaf1ca2821",
        "title": "Live and Feeder Cattle Rally on USDA COF Report; Lean Hogs Are Technically Strong",
        "doc_url": "https://www.barchart.com/story/news/37234831/live-and-feeder-cattle-rally-on-usda-cof-report-lean-hogs-are-technically-strong",
        "all_text": "February live cattle (LEG26) on Friday rose $2.525 to $234.90 and for the week were up $2.75. March feeders (GFH26) gained $0.90 to $360.175 and for the week rose $3.725. Friday’s technically bullish weekly high closes in February live cattle and March feeders set the table for some follow-through chart-based buying early this week.\nIt appears cattle traders were expecting Friday afternoon’s monthly USDA cattle-on-feed (COF) report to lean price-friendly, which it did.\nThe agency reported that cattle and calves on feed in feedlots with capacity of 1,000 or more head totaled 11.5 million head on Jan. 1. The inventory was 3% below Jan. 1, 2025. The inventory included 7.02 million steers and steer calves, down 3% from the previous year. This group accounted for 61% of the total inventory. Heifers and heifer calves accounted for 4.44 million head, down 3% from 2025. Placements in feedlots during December totaled 1.55 million head, 5% below 2024. Net placements were 1.50 million head.\nPlacements of cattle and calves weighing less than 600 pounds were 365,000 head\n600-699 pounds were 360,000 head\n700-799 pounds were 355,000 head\n800-899 pounds were 274,000 head\n900-999 pounds were 115,000 head\n1,000 pounds and greater were 85,000 head\nMarketings of fed cattle during December totaled 1.77 million head, 2% above 2024. Other disappearance totaled 58,000 head during December, 2% below 2024.\nCash Cattle Prices Remain Resilient Amid Still-Solid Consumer Demand for Beef\nStill-very-quiet c",
        "authors": "None",
        "publish_date": "2026-01-26 20:00:02",
        "published_at_raw": "2026-01-26T20:00:02Z",
        "meta_site_name": "Barchart",
        "description": "Coming off a collapse in cattle prices on new world screwworm fears, cattle prices closed at technically bullish levels on Friday. Here’s what to watch in the week ahead.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0a5caaf223dbfd0aa897d74a3317cd1f",
        "title": "Hogs Mostly Higher on Monday",
        "doc_url": "https://www.barchart.com/story/news/37233521/hogs-mostly-higher-on-monday",
        "all_text": "Lean hog futures are trading with 50 to 70 cent gains on Monday, with nearby Feb up 7 cents. USDA’s national base hog price was not reported this morning on no volume. The CME Lean Hog Index was up another 55 cents on Jan 22 at $83.62.\nMonthly Cold Storage data showed pork stocks on December 31 at 390.55 million lbs, which was down 1.5% from last year and the lowest December since 1997\nCommitment of Traders data showed managed money in lean hog futures and options increasing their net long by 14,794 contracts as of 1/20. That net long was the largest since October at 97,418 contracts on Tuesday.\nUSDA’s pork carcass cutout value from the Monday AM report was $1.62 higher at $97.37 per cwt. All primals were reported higher, with the rib up $6.52. USDA estimated federally inspected hog slaughter for last week at 2.484 million head. That is 139,000 head below last week but 10,192 head above the same week last year.\nFeb 26 Hogs are at $88.275, down $0.075,\nApr 26 Hogs are at $96.850, up $0.675\nMay 26 Hogs are at $100.150, up $0.600,",
        "authors": "None",
        "publish_date": "2026-01-26 18:21:01",
        "published_at_raw": "2026-01-26T18:21:01Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are trading with 50 to 70 cent gains on Monday, with nearby Feb up 7 cents. USDA’s national base hog price was not reported this morning on no volume. The CME Lean Hog Index was up another 55 cents on Jan 22 at $83.62. Monthly Cold S...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "817f0ac7b6ad7cc76aae7d98bd6b9c21",
        "title": "Farmers Would Lose Prevented Planting Buy-Up Coverage Under USDA Rule",
        "doc_url": "https://www.agriculture.com/farmers-would-lose-prevented-planting-buy-up-coverage-under-usda-rule-11892589",
        "all_text": "Senate Ag Committee leaders last week led a letter to Secretary of Agriculture Brooke Rollins insisting USDA restore a type of prevented planting coverage removed by a recent federal rule.\nThe Expanding Access to Risk Protection (EARP) rule from USDA’s Federal Crop Insurance Corporation (FCIC) was published near the end of last year with the goal of “modernizing the system, expanding access to crop insurance, and making it easier, not harder, for farmers and ranchers to protect their operations and keep doing the work that keeps America fueled and fed,” according to a statement by Rollins in December.\nAlthough “many provisions” of the rule were welcomed by Senators John Boozman, R-Ark., and Amy Klobuchar, D-Minn., along with 17 others, in their Jan. 22 letter to Rollins, they expressed concern over Section VI of the rule — “Removal of Buy-Up Coverage on Prevented Planting.”\n“Eliminating the option for producers to purchase additional buy-up coverage for prevented planting is troubling,” the senators wrote, “especially at a time when our farmers need access to all risk management tools available to them.”\nHere’s the language of Section VI:\nThe senators said the change impacts more than 67 million acres across all 50 states and all covered commodities in 2025 alone, and argued that ad hoc assistance, which Congress has provided in the past, is not something farmers can rely on.\nThey asked that the department reverse the decision and “allow producers access to the additional pre",
        "authors": "None",
        "publish_date": "2026-01-26 18:10:51",
        "published_at_raw": "2026-01-26T18:10:51Z",
        "meta_site_name": "Successful Farming",
        "description": "Senate Agriculture Committee leaders are urging USDA to reverse a crop insurance rule that removes buy-up prevented planting coverage starting in 2026. Comments on the rule are due Tuesday.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "30d0c5d4bb737c2d7ee8a47436b470c3",
        "title": "U.S. Corn Export Inspections Rise, Wheat Slips",
        "doc_url": "https://www.marketscreener.com/news/u-s-corn-export-inspections-rise-wheat-slips-ce7e5bdbdc80ff21",
        "all_text": "By Kirk Maltais\nExport inspections of corn in the U.S. rose in the past week, according to data released by the Department of Agriculture.\nIn its latest report published Monday, the USDA said that corn inspections totaled 1.51 million metric tons for the past week. That's up from 1.49 million tons last week and 1.25 million tons at this time last year. For wheat, the situation was more difficult - with daily inspections totaling 351,001 tons, down from 397,774 tons at this time last week and 484,544 tons at this time last year.\nSoybean inspections totaled 1.32 million tons for the week, which is down slightly from the prior week's total of 1.35 million tons, but up from 738,028 tons at this time last year.\nChina was overwhelmingly the leading destination for U.S. soybeans shipped during the week. South Korea was the top destination for U.S. wheat, and Mexico was the leading destination for corn.\nCBOT grain futures have turned lower in trading Monday, this as the U.S. dollar slides. The U.S. dollar index is down 0.7%, while corn falls 0.5%, soybeans fall 0.5%, and wheat drops 1.4%. A lower U.S. dollar is often a catalyst for higher grain futures, as a weaker dollar makes U.S. grain exports more competitive on the world stage - so today's fall is atypical for grains.\nWrite to Kirk Maltais at kirk.maltais@wsj.com\n(END) Dow Jones Newswires\n01-26-26 1149ET",
        "authors": "None",
        "publish_date": "2026-01-26 16:51:19",
        "published_at_raw": "2026-01-26T16:51:19Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\nExport inspections of corn in the U.S. rose in the past week, according to data released by the Department of Agriculture.\nIn its latest report published Monday, the USDA said...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e8194d2281479796ba5d10ea78ac999c",
        "title": "Hogs Look to New Week as Pork Stocks Remain Tight",
        "doc_url": "https://www.barchart.com/story/news/37228183/hogs-look-to-new-week-as-pork-stocks-remain-tight",
        "all_text": "Lean hog futures closed the Friday trade with contracts a dime to 25 cents lower in the nearbys. February was up just 7 cents last week, as April was 97 cents higher. Preliminary open interest was up 4,079 contracts on Friday. USDA’s national base hog price was reported at $83.56 on Friday afternoon, up 47 cents from the day prior. The CME Lean Hog Index was up another 67 cents on Jan 21 at $83.07.\nExport Sales data showed 33,249 MT of pork sold in the week ending on January 15. Shipments were at 39,223 MT during that week.\nMonthly Cold Storage data showed pork stocks on December 31 at 390.55 million lbs, which was down 1.5% from last year and the lowest December since 1997\nCommitment of Traders data showed managed money in lean hog futures and options increasing their net long by 14,794 contracts as of 1/20. That net long was the largest since October at 97,418 contracts on Tuesday.\nUSDA’s pork carcass cutout value from the Friday PM report was $1.13 higher at $95.75 per cwt. The rib primal was the only reported lower. USDA estimated federally inspected hog slaughter for last week at 2.484 million head. That is 139,000 head below last week but 10,192 head above the same week last year.\nFeb 26 Hogs closed at $88.350, down $0.125,\nApr 26 Hogs closed at $96.175, down $0.175\nMay 26 Hogs closed at $99.550, down $0.225,",
        "authors": "None",
        "publish_date": "2026-01-26 13:32:10",
        "published_at_raw": "2026-01-26T13:32:10Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed the Friday trade with contracts a dime to 25 cents lower in the nearbys. February was up just 7 cents last week, as April was 97 cents higher. Preliminary open interest was up 4,079 contracts on Friday. USDA’s national base ho...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "293b0a5a23c6c332ff9e366c02c69231",
        "title": "USDA’s Vaden Accuses Nutrien, Mosaic of Fertilizer Price Collusion",
        "doc_url": "https://www.agriculture.com/partners-usda-s-vaden-accuses-nutrien-mosaic-of-fertilizer-price-collusion-11892276",
        "all_text": "By Ryan Hanrahan\nAgri-Pulse’s Oliver Ward reported that “Deputy Agriculture Secretary Stephen Vaden (last week) accused Nutrien and Mosaic of working to ‘collude’ to limit U.S. fertilizer supply and control prices, suggesting that the administration could take future action to inject more competition into markets, if necessary.”\n“‘This administration is going to do everything it can to ensure that farmers have the fertilizer [they] need, at a price that they can pay,’ Vaden said during a webinar hosted by the National Agricultural Law Center,” according to Ward’s reporting. “‘We’re not going to allow these two companies to do anything to undermine this.'”\n“Canada’s Nutrien and Florida-based Mosaic were responsible for more than 90% of North American phosphate fertilizer and potash production in 2024, according to Farm Action — an ag industry accountability group. On the distribution side, Farm Action notes that just seven companies control 70% of crop input sales, including Nutrien Ag Solutions, the retail business of Nutrien,” Ward reported. “During the webinar on Wednesday, Vaden described Nutrien’s and Mosaic’s grip on the market as a ‘duopoly’ that is constraining ‘fertilizer supply in this country’ and driving ‘up the cost that farmers are paying.'”\n“The deputy secretary said on Wednesday that he is closely watching a project to open a new fertilizer mine in Saskatchewan, Canada, that will eventually export to the U.S. and could ‘break up that duopoly’s control,'” Ward r",
        "authors": "None",
        "publish_date": "2026-01-26 13:18:04",
        "published_at_raw": "2026-01-26T13:18:04Z",
        "meta_site_name": "Successful Farming",
        "description": "The Deputy Ag Secretary accused Nutrien and Mosaic of colluding to limit fertilizer supply and raise prices, signaling potential antitrust action to protect U.S. farmers.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "84cc52f4f2ed4202fc2890460831a3fd",
        "title": "How to save food if power goes out during winter storm",
        "doc_url": "https://eu.greenvilleonline.com/story/weather/2026/01/26/how-to-save-food-if-power-goes-out-during-winter-storm/88321286007/",
        "all_text": "The USDA advises that refrigerated food is safe for up to four hours during a power outage if the door remains closed.\nA full freezer can keep food safe for up to 48 hours, while a half-full freezer can keep it safe for 24 hours.\nFood safety cannot be determined by taste; items should be evaluated individually after a power outage.\nAppliance thermometers are recommended to ensure refrigerators stay at or below 40°F and freezers at or below 0°F.\nA massive weekend winter storm that had grocery shoppers emptying store shelves in preparation continued to cause havoc.\nPower outages from the storm that covered the Upstate in freezing rain, sleet and snow affected more than 30,000 utility customers on Sunday, Jan. 25. The National Weather Service at Greenville Spartanburg Airport warned that iced-over power lines and tree limbs along with wind overnight could cause more power disruptions. An ice storm warning remains in effect until 1 p.m., Jan. 26.\nAnyone with a stocked refrigerator who loses power should consider these food safety tips from the United States Department of Agriculture (USDA) to avoid food borne illness.\nHow can I monitor food temperatures?\nAn appliance thermometer should be kept inside the refrigerator and freezer to monitor temperatures, according to the USDA. The refrigerator must maintain a temperature at 40 degrees Fahrenheit or below, and the freezer at 0 degrees Fahrenheit or below, for food to remain safe for consumption.\nHow long is food safe for during a p",
        "authors": "None",
        "publish_date": "2026-01-26 10:09:43",
        "published_at_raw": "2026-01-26T10:09:43Z",
        "meta_site_name": "Greenville News",
        "description": "Upstate residents who lose power will want to practice these food safety tips guidelines from the USDA to avoid food borne illness.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8f761747168910dc3a825e51780d553a",
        "title": "Suzanna’s Kitchen recalls almost 14,000 pounds of grilled chicken over LISTERIA risk",
        "doc_url": "https://www.naturalnews.com/2026-01-26-suzannas-kitchen-recalls-grilled-chicken-listeria-risk.html",
        "all_text": "Suzanna's Kitchen is recalling about 13,720 pounds of ready-to-eat grilled chicken after testing indicated possible contamination with Listeria monocytogenes, according to the U.S. Department of Agriculture's (USDA) Food Safety and Inspection Service (FSIS).\nThe recall affects 10-pound cases of fully cooked grilled chicken breast fillets produced Oct. 14 and distributed to foodservice centers in seven states.\nFSIS classified the recall as Class I, its most serious level, meaning the product could cause severe illness or death, although no confirmed illnesses have been reported.\nListeria causes listeriosis, a potentially deadly infection that particularly threatens pregnant women, newborns, older adults and people with weakened immune systems.\nThe CDC and recent studies warn that listeria remains a major U.S. food safety threat, with recurring outbreaks highlighting the need for stronger food safety practices and public awareness.\nThe U.S. Department of Agriculture's (USDA) Food Safety and Inspection Service (FSIS) announced on Jan. 16 that Georgia-based food manufacturer Suzanna's Kitchen is recalling approximately 13,720 pounds of ready-to-eat grilled chicken products due to possible contamination with Listeria monocytogenes.\nThe recall affects 10-pound cases containing two five-pound bags of fully cooked grilled chicken breast fillets with rib meat. The products bear the lot code 60104 P1382 287 5 J14 on both the case and individual packages. The chicken was produced on Oct",
        "authors": "None",
        "publish_date": "2026-01-26 04:30:27",
        "published_at_raw": "2026-01-26T04:30:27Z",
        "meta_site_name": "Natural News",
        "description": "Suzanna’s Kitchen is recalling about 13,720 pounds of ready-to-eat grilled chicken after testing indicated possible contamination with Listeria monocytogenes, according to the U.S. Department of Agriculture’s (USDA) Food Safety and Inspection Service (FSIS). The recall affects 10-pound cases of fully cooked grilled chicken breast fillets produced Oct. 14 and distributed to foodservice centers in seven states. […]",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]