[
    {
        "id": "1eb5d80da0a8ac8fa333a71c245ddcac",
        "title": "Corn Posts Slight Friday Losses",
        "doc_url": "https://www.barchart.com/story/news/36798646/corn-posts-slight-friday-losses",
        "all_text": "Corn futures closed the Friday session with contracts fractionally to a penny lower in the nearbys. March corn was up 6 ¼ cents on the short. The CmdtyView national average Cash Corn price was down a penny to $4.06 3/4.\nFutures got some spillover weakness from crude oil losses of $1.45/barrel. Thin trade for the shorter session after Christmas likely also had an impact.\nReports from the government were pushed back due to the holiday declared for today. EIA will be released on Monday, with the next Export Sales release for the week ending on 12/18 out on Wednesday.\nMar 26 Corn closed at $4.50, down 1 cent,\nNearby Cash was $4.06 3/4, down 1 cent,\nMay 26 Corn closed at $4.58 1/4, down 3/4 cent,\nJul 26 Corn closed at $4.64 1/4, down 1/4 cent,",
        "authors": "None",
        "publish_date": "2025-12-26 23:04:23",
        "published_at_raw": "2025-12-26T23:04:23Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Friday session with contracts fractionally to a penny lower in the nearbys. March corn was up 6 ¼ cents on the short. The CmdtyView national average Cash Corn price was down a penny to $4.06 3/4. Futures got some spillover we...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d498c38a257323faf040ca581350dd5d",
        "title": "CME : Mixed price action stalled Corn and Wheat futures.",
        "doc_url": "https://www.marketscreener.com/news/cme-mixed-price-action-stalled-corn-and-wheat-futures-ce7e59dad08df020",
        "all_text": "Trader\nThis super rating is the result of a weighted average of the rankings based on the following ratings: Global Valuation (Composite), EPS Revisions (4 months), and Visibility (Composite). We recommend that you carefully review the associated descriptions.\nInvestor\nThis super composite rating is the result of a weighted average of the rankings based on the following ratings: Fundamentals (Composite), Global Valuation (Composite), EPS Revisions (1 year), and Visibility (Composite). We recommend that you carefully review the associated descriptions.\nGlobal\nThis composite rating is the result of an average of the rankings based on the following ratings: Fundamentals (Composite), Valuation (Composite), Financial Estimates Revisions (Composite), Consensus (Composite), and Visibility (Composite). The company must be covered by at least 4 of these 5 ratings for the calculation to be performed. We recommend that you carefully review the associated descriptions.\nQuality\nThis composite rating is the result of an average of the rankings based on the following ratings: Capital Efficiency (Composite), Quality of Financial Reporting (Composite), and Financial Health (Composite). The company must be covered by at least 2 of these 3 ratings for the calculation to be performed. We recommend that you carefully review the associated descriptions.",
        "authors": "None",
        "publish_date": "2025-12-26 21:00:08",
        "published_at_raw": "2025-12-26T21:00:08Z",
        "meta_site_name": "MarketScreener",
        "description": "Grain markets saw early strength that faded as the trading day progressed. March Corn futures settled slightly lower at 449.75, though they remained up for the week. March Soybean futures rose to...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f7872c80899e353c7f07d0dc32906cd5",
        "title": "Corn Giving Some Strength Back on Friday",
        "doc_url": "https://www.barchart.com/story/news/36796841/corn-giving-some-strength-back-on-friday",
        "all_text": "Corn futures are showing midday losses of 1 to 2 1/4 cents so far on Friday. The CmdtyView national average Cash Corn price is down 2 1/4 cent to $4.04 1/4. Futures may be getting spillover weakness from crude oil losses of $1.13/barrel.\nReports from the government are pushed back due to the holiday declared for today. EIA will be released on Monday, with the next Export Sales release for the week ending on 12/18 out on Wednesday.\nExport Sales data has total corn export commitments at 47.579 MMT as of December 11, which is 31% above a year ago. That is also 59% of USDA’s record projection, in line with the 57% average sales pace. Actual shipments are 28% of that projection, ahead of the 19% 5-year average.\nMar 26 Corn is at $4.48 3/4, down 2 1/4 cents,\nNearby Cash is at $4.04 1/4, down 2 1/4 cents,\nMay 26 Corn is at $4.57 1/4, down 1 3/4 cents,\nJul 26 Corn is at $4.63 1/4, down 1 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-26 18:18:13",
        "published_at_raw": "2025-12-26T18:18:13Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are showing midday losses of 1 to 2 1/4 cents so far on Friday. The CmdtyView national average Cash Corn price is down 2 1/4 cent to $4.04 1/4. Futures may be getting spillover weakness from crude oil losses of $1.13/barrel. Reports fro...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1c0ebaf13cad1c7febbbef4adb8e2b5b",
        "title": "Soybeans Slip Lower on Friday’s Thin Trade",
        "doc_url": "https://www.barchart.com/story/news/36798656/soybeans-slip-lower-on-fridays-thin-trade",
        "all_text": "Soybean futures slipped back on Friday with front months 3 to 4 ½ cents lower, as January was 9 ½ cents higher. The cmdtyView national average Cash Bean price was 4 cents higher at $9.88 1/2. Soymeal futures were down 50 cents to $1/ton, as January held onto a $6.10 gain this week. Soy Oil futures were down 30 to 35 points, with January up 82 points on the week.\nLittle news was from the government as they pushed back reports due to the holiday declared for today. The next Export Sales release for the week ending on 12/18 will be out next Wednesday. Thinner trade also limited movement to close the week.\nJan 26 Soybeans closed at $10.58 3/4, down 4 1/2 cents,\nNearby Cash was $9.88 1/2, down 4 cents,\nMar 26 Soybeans closed at $10.72 1/2, down 4 cents,\nMay 26 Soybeans closed at $10.84 1/4, down 3 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-26 23:04:23",
        "published_at_raw": "2025-12-26T23:04:23Z",
        "meta_site_name": "Barchart",
        "description": "Soybean futures slipped back on Friday with front months 3 to 4 ½ cents lower, as January was 9 ½ cents higher. The cmdtyView national average Cash Bean price was 4 cents higher at $9.88 1/2. Soymeal futures were down 50 cents to $1/ton, as January h...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "11630b1b3cb68a9481cbadadb336323d",
        "title": "Soybeans Coming out of Christmas with Weaker Trade",
        "doc_url": "https://www.barchart.com/story/news/36796851/soybeans-coming-out-of-christmas-with-weaker-trade",
        "all_text": "Soybean futures are coming out of the Christmas holiday, with contracts down 4 to 6 cents at midday. The cmdtyView national average Cash Bean price is 5 3/4 cents higher at $9.86. Soymeal futures are steady, with most contracts 50 cents within unchanged, as Soy Oil futures are down 37 points.\nReports from the government are pushed back due to the holiday declared for today. The next Export Sales release for the week ending on 12/18 will be out next Wednesday.\nUSDA has export sale commitments for soybeans at 25.778 MMT, which is down 33% from the same period last year as of 12/11. That is 58% of USDA’s export projection and lagging the 79% average pace.\nJan 26 Soybeans are at $10.57 1/2, down 5 3/4 cents,\nNearby Cash is at $9.86, down 5 3/4 cents,\nMar 26 Soybeans are at $10.71, down 5 1/2 cents,\nMay 26 Soybeans are at $10.82 3/4, down 4 3/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-26 18:18:13",
        "published_at_raw": "2025-12-26T18:18:13Z",
        "meta_site_name": "Barchart",
        "description": "Soybean futures are coming out of the Christmas holiday, with contracts down 4 to 6 cents at midday. The cmdtyView national average Cash Bean price is 5 3/4 cents higher at $9.86. Soymeal futures are steady, with most contracts 50 cents within unchan...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4ee235f7b3c44f69cfecb65b0159a3c5",
        "title": "Khapli atta returns as urban Indians turn health-conscious, priced nearly five times higher than regular flour",
        "doc_url": "https://economictimes.indiatimes.com/industry/cons-products/food/khapli-atta-returns-as-urban-indians-turn-health-conscious-at-nearly-five-times-the-price/articleshow/126194866.cms",
        "all_text": "Synopsis\nAncient Khapli wheat is seeing a big revival, with urban consumers embracing it for its health benefits. This heirloom grain, richer in fiber and protein with a lower glycemic index, is now a sought-after functional food. Brands are entering the market, and sales are surging, though its premium price remains a factor.\nKhapli wheat, an ancient grain once on the brink of extinction, is staging a spectacular comeback, selling at up to five times the price of regular atta, as urban consumers turn to functional food to manage lifestyle diseases.\nOver the past two years, more than a dozen brands, including ITC, Urban Platter, Anveshan, GirOrganic, Satvyk, Conscious Food, Amala Earth and regional millers, have entered the heirloom flour segment.\nCompared to modern wheat, khapli — also known as emmer wheat — is richer in fibre and protein, and has a lower glycaemic index, helping a steady release of glucose into the bloodstream, critical for managing diabetes.\n“Customers are highly aware of their health and want to invest in good food to prevent diseases. Another category includes those who have already suffered a health scare, had a wake-up call, and returned to eating good food,” said Satyajit Hange, cofounder of Two Brothers Organic Farms, a Pune-based organic food products firm.\nHe said the company’s sales of khapli atta have increased seven to eight-fold over the past two years.\nLive Events\nThis revival comes at a time when consumers are experimenting with their food ha",
        "authors": "None",
        "publish_date": "2025-12-26 22:30:00",
        "published_at_raw": "2025-12-26T22:30:00Z",
        "meta_site_name": "The Economic Times",
        "description": "Ancient Khapli wheat is seeing a big revival, with urban consumers embracing it for its health benefits. This heirloom grain, richer in fiber and protein with a lower glycemic index, is now a sought-after functional food. Brands are entering the market, and sales are surging, though its premium price remains a factor.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cdb5acc281f0be81228c42ec92022e0b",
        "title": "Hogs Fall to Weakness on Friday",
        "doc_url": "https://www.barchart.com/story/news/36798686/hogs-fall-to-weakness-on-friday",
        "all_text": "Lean hog futures extended the pullback from Wednesday with losses of 20 to 55 cents across the front months, with February up just a tick this week. USDA’s national base hog price was reported at $67.19 on Friday afternoon. The CME Lean Hog Index was back down a penny on December 23 at $83.71.\nUSDA’s pork carcass cutout value from the Friday PM report was back up $4.05 at $97.71 per cwt. The loin, butt, and picnic were the primals reported lower, with belly back up $23.44. USDA estimated federally inspected hog slaughter for this week awas tallied at 1.978 million head. That was well below last week and down 85,628 head from the same week last year.\nFeb 26 Hogs closed at $84.525, down $0.525,\nApr 26 Hogs closed at $89.475, down $0.325\nMay 26 Hogs closed at $93.425, down $0.225,",
        "authors": "None",
        "publish_date": "2025-12-26 23:04:23",
        "published_at_raw": "2025-12-26T23:04:23Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures extended the pullback from Wednesday with losses of 20 to 55 cents across the front months, with February up just a tick this week. USDA’s national base hog price was reported at $67.19 on Friday afternoon. The CME Lean Hog Index was...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4150b08314cb8256837ca761dd1bae54",
        "title": "Hogs Trading Weaker on Friday",
        "doc_url": "https://www.barchart.com/story/news/36796881/hogs-trading-weaker-on-friday",
        "all_text": "Lean hog futures are showing losses of a tick to 65 cents at midday. USDA’s national base hog price was not reported on Friday morning due to no volume so far. The CME Lean Hog Index was back down a penny on December 23 at $83.71.\nUSDA’s pork carcass cutout value from the Friday AM report was back up $6.10 at $99.76 per cwt. The loin was the only primal reported lower, with belly back up $25.87. USDA estimated federally inspected hog slaughter for Wednesday at 170,000 head, with the weekly total at 1.153 million head. That was 309,000 head below last week but still above the same week last year.\nFeb 26 Hogs are at $84.400, down $0.650,\nApr 26 Hogs are at $89.325, down $0.475\nMay 26 Hogs is at $93.625, down $0.025,",
        "authors": "None",
        "publish_date": "2025-12-26 18:18:13",
        "published_at_raw": "2025-12-26T18:18:13Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are showing losses of a tick to 65 cents at midday. USDA’s national base hog price was not reported on Friday morning due to no volume so far. The CME Lean Hog Index was back down a penny on December 23 at $83.71. USDA’s pork carcas...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3f73f937b2d619f3c8b835b37a4a3d10",
        "title": "Hogs Look to Friday Following Wednesday Losses",
        "doc_url": "https://www.barchart.com/story/news/36794868/hogs-look-to-friday-following-wednesday-losses",
        "all_text": "Lean hog futures were down 20 to 92 cents across the front months on Wednesday, as contracts faced losses heading into the Holiday break. Open interest was up 1,368 contracts on Wednesday. USDA’s national base hog price was not reported on Wednesday due to thin trade. The CME Lean Hog Index was up a penny on December 22 at $83.72. The CME will open back up this morning following the Christmas holiday.\nUSDA’s pork carcass cutout value from the Wednesday PM report was $3.03 lower at $93.66 per cwt. The loin, picnic, ham, and belly were the primals reported lower, with the latter down $14.37. USDA estimated federally inspected hog slaughter for Wednesday at 170,000 head, with the weekly total at 1.153 million head. That was 309,000 head below last week but still above the same week last year.\nFeb 26 Hogs closed at $85.050, down $0.925,\nApr 26 Hogs closed at $89.800, down $0.475\nMay 26 Hogs closed at $93.650, down $0.200,",
        "authors": "None",
        "publish_date": "2025-12-26 13:41:48",
        "published_at_raw": "2025-12-26T13:41:48Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were down 20 to 92 cents across the front months on Wednesday, as contracts faced losses heading into the Holiday break. Open interest was up 1,368 contracts on Wednesday. USDA’s national base hog price was not reported on Wednesday...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f2a825614e9a2fddbee43d68b0592328",
        "title": "USDA lost about 20% of staff in first five months of Trump administration, inspector general report says",
        "doc_url": "https://www.wltx.com/article/news/nation-world/usda-staffing-downsize-inspector-general-report/507-439711ed-103f-44cd-aa5c-776d94b03e01",
        "all_text": "WASHINGTON — More than 20,000 employees left the U.S. Department of Agriculture in the first five months of President Donald Trump's second term, according to a new report from the agency's inspector general.\nThe inspector general's report found that between Jan. 12, 2025, and June 14, 2025, the USDA lost nearly a fifth of its overall staffing. Almost 75% of those employees left the farm agency as part of the Deferred Resignation Program, a financial program offered by the Trump administration in an effort to downsize the federal workforce, according to the report.\nThe rest of the employees left through termination, resignation, retirement, external transfer or other means.\nAt the start of the year, the USDA had more than 110,300 employees.\nThe impact of the staff cuts varied by sub-agency, with the National Institute of Food and Agriculture losing as many as 35% of its employees. The National Agricultural Statistics Service and the Farm Production and Conservation Business Center also saw more than 30% in employee attrition.\n“The U.S. Department of Agriculture is the front door for America’s farmers and ranchers, who are facing more uncertainty than ever. Rural Americans need a Department that is ready and capable of serving them,\" a Minnesota Democrat and ranking member of the Senate Agriculture, Nutrition and Forestry Committee, said in a press release. \"Losing nearly twenty percent of all USDA staff weakens the Department’s ability to respond to challenges facing our farm",
        "authors": "None",
        "publish_date": "2025-12-26 10:45:00",
        "published_at_raw": "2025-12-26T10:45:00Z",
        "meta_site_name": "WLTX.com",
        "description": "About a fifth of the staff at the farm agency left in the first five months of Trump's second term, according to a new report.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4556704abb41ecb58d009661e9ed5b08",
        "title": "USDA Projects $37 Billion Ag Trade Deficit in FY26",
        "doc_url": "https://www.agriculture.com/partners-usda-projects-usd37-billion-ag-trade-deficit-in-fy26-11876263",
        "all_text": "by Ryan Hanrahan\nAgri-Pulse’s Oliver Ward reported that “the Agriculture Department is projecting that the ag trade deficit will shrink in FY2026 even more than previously anticipated. USDA expects the trade deficit to fall from $43.7 billion in FY2025 to $37 billion in FY2026, according to its quarterly trade forecast published Tuesday. In its previous report issued in August, USDA had projected a trade deficit of $41.5 billion this fiscal year.”\n“The U.S. recorded trade deficits of around $32 billion in FY2024 and $17 billion in FY2023, respectively,” Ward reported. “The quarterly trade forecast, published by the Economic Research Service, had been scheduled for publication last month, but was delayed due to the government shutdown.”\n“Driving the adjusted outlook are larger-than-expected exports. USDA now expects $173 billion in ag exports for FY2026, up from the $169 projected in August. But even with the revision, exports are still set to contract year-over-year, after the U.S. recorded $175.6 billion in exports in FY2025,” Ward reported. “Ag imports are also set to fall from $219.4 billion during the last fiscal year to $210 billion in FY2026.”\n“A significant portion of the better outlook can be attributed to improvements in the Chinese market. USDA revised U.S. ag export prospects to China upwards by $3 billion from the August to December releases,” Ward reported. “Exports to South Korea, Japan, Mexico and Southeast Asia also all posted small increases from August’s for",
        "authors": "None",
        "publish_date": "2025-12-26 04:36:35",
        "published_at_raw": "2025-12-26T04:36:35Z",
        "meta_site_name": "Successful Farming",
        "description": "One outlet reported “the Agriculture Department is projecting that the ag trade deficit will shrink in FY2026 even more than previously anticipated.”",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]