[
    {
        "id": "578efdbe5914890617fde8db2dafc592",
        "title": "Corn Faces Weakness to Start 2026",
        "doc_url": "https://www.barchart.com/story/news/36866330/corn-faces-weakness-to-start-2026",
        "all_text": "Corn futures closed out the first session of 2026 with losses of 2 to 3 cents. March was back down 12 ½ cents on the holiday week. The CmdtyView national average Cash Corn price was up 2 ½ cents at $3.98 1/4.\nUSDA reported a private export sale of 132,000 MT of corn to South Korea this morning. Export Sales data will be officially caught up on Monday, as traders are looking for between 0.7-1.5 MMT in corn bookings during the week of 12/25.\nA monthly Grains Crushing report from USDA was released this afternoon, showing a total of 471.87 mbu of corn used in ethanol during November. That was slightly above last year and 0.7% below last month. Corn grind in the first quarter was down just 0.2 mbu from 2024/25.\nOn Wednesday afternoon, USDA released the payment details for the Farm Bridge Assistance program, with the corn payment listed at $44.36/acre. Sorghum was tallied at $48.11.\nMar 26 Corn closed at $4.37 1/2, down 2 3/4 cents,\nNearby Cash was $3.98 1/4, up 2 1/2 cents,\nMay 26 Corn closed at $4.45 1/2, down 2 3/4 cents,\nJul 26 Corn closed at $4.52, down 2 1/2 cents,",
        "authors": "None",
        "publish_date": "2026-01-02 22:50:38",
        "published_at_raw": "2026-01-02T22:50:38Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed out the first session of 2026 with losses of 2 to 3 cents. March was back down 12 ½ cents on the holiday week. The CmdtyView national average Cash Corn price was up 2 ½ cents at $3.98 1/4. USDA reported a private export sale of 1...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4cb1c64ed80b82b99d622d85a3e48327",
        "title": "Grains Futures Fall Amid Worries of Excessive Supply -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/grains-futures-fall-amid-worries-of-excessive-supply-daily-grain-highlights-ce7e59d9dc81f523",
        "all_text": "By Paulo Trevisani\n--Corn for March delivery fell 0.7%, to $4.37 1/2 a bushel, on the Chicago Board of Trade on Friday, as a new trading year started with the prospect of excessive global supply.\n--Soybeans for March delivery fell 0.1%, to $10.45 3/4 a bushel.\n--Wheat for March delivery fell 0.1%, to $5.06 1/2 a bushel.\nHIGHLIGHTS\nLosing Start: Grain futures weakened in the first trading day of 2026, amid concerns of abundant supply. The USDA reported flash export sales of 132,000 metric tons of corn for delivery to South Korea during the current marketing year. RCM's Doug Berman wrote that low corn prices are likely to slow selling interest \"and some buying interest is expected to emerge\" ahead of the Jan. 12 WASDE report.\nBountiful Harvest: Soybean futures remained under pressure as weather forecasts support a bountiful South American harvest. AgResource expects Brazil to produce more than 180 million metric tons of beans this year, noting in a report that weather conditions over the next three to four weeks will help determine the crop's size. \"A record large South American corn and soybean crop is in the making,\" AgResource said. It added that Chinese purchase of U.S. soybeans remained uncertain. \"Unfortunately, it will require a supply shock through weather to sustain a bullish price trend.\"\nINSIGHT\nTariff Certainty?: Reduced tariff volatility could benefit commodities this year, following a rough 2025 for grains, StoneX's Arlan Suderman wrote. \"Tariff volatility should ",
        "authors": "None",
        "publish_date": "2026-01-02 19:42:16",
        "published_at_raw": "2026-01-02T19:42:16Z",
        "meta_site_name": "MarketScreener",
        "description": "By Paulo Trevisani\n--Corn for March delivery fell 0.7%, to $4.37 1/2 a bushel, on the Chicago Board of Trade on Friday, as a new trading year started with the prospect of excessive global supply....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "65983da95f6bf3910a98a84021c61b99",
        "title": "Hogs Pullback to Kick off the New Year",
        "doc_url": "https://www.barchart.com/story/news/36866370/hogs-pullback-to-kick-off-the-new-year",
        "all_text": "Lean hog futures posted losses of 60 cents to $1 across the nearbys on Friday, with February slipping 42 cents this week. USDA’s national base hog price was not reported on Friday afternoon due to thin volume. The CME Lean Hog Index was back up a penny on December 30 at $82.26.\nUSDA’s pork carcass cutout value from the Friday PM report was 83 cents higher at $94.57 per cwt. The butt and belly primals were the only reported lower. USDA estimated federal inspected hog slaughter for this week at 2.228 million head. That is 250,000 head above a week ago, but down 41,794 head from the same week last year.\nFeb 26 Hogs closed at $84.100, down $1.000,\nApr 26 Hogs closed at $89.100, down $0.800\nMay 26 Hogs closed at $93.375, down $0.625,",
        "authors": "None",
        "publish_date": "2026-01-02 22:50:38",
        "published_at_raw": "2026-01-02T22:50:38Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted losses of 60 cents to $1 across the nearbys on Friday, with February slipping 42 cents this week. USDA’s national base hog price was not reported on Friday afternoon due to thin volume. The CME Lean Hog Index was back up a pen...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "dda985607c727ab011299e185382b4eb",
        "title": "USDA Farmer Bridge Assistance Rates Favor Rice, Cotton",
        "doc_url": "https://www.agriculture.com/partners-usda-farmer-bridge-assistance-rates-favor-rice-cotton-11878566",
        "all_text": "By Ryan Hanrahan\nReuters’ P.J. Huffstutter and Julie Ingwersen reported that “the U.S. Department of Agriculture released details on Wednesday about how much row crop farmers will receive next year from a $12 billion aid program, but soybean growers say such payments fall short of helping those hurt by low crop prices and trade disputes.”\n“The Farmer Bridge Assistance program is expected to distribute $11 billion in one-time payments to farmers, who will be paid on a per-acre rate if they planted one of the 19 commodity crops identified as being eligible for the program, USDA said in a statement on Wednesday,” Huffstutter and Ingwersen reported. “…While the aid is expected to help farmers prepare for the next planting season, growers and agricultural economists say the payments are a fraction of farm losses and will not rescue the sagging U.S. farm economy.”\n“The highest per-acre payments will be paid to rice farmers, who could receive $132.89 an acre; cotton farmers, at $117.35 an acre; and oat farmers, at $81.75 an acre,” Huffstutter and Ingwersen reported. “Meanwhile, farmers are eligible for a payment of $44.36 per corn acre, $30.88 per soybean acre and $39.35 per wheat acre. The payments are calculated using 2025 planted acres, cost-of-production data, and market conditions, USDA said.”\nProgressive Farmer’s Chris Clayton reported that “the payment limit will be $155,000 per entity or individual. Unlike other aid programs, USDA will not require ‘linkage’ for crop insuranc",
        "authors": "None",
        "publish_date": "2026-01-02 20:38:35",
        "published_at_raw": "2026-01-02T20:38:35Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA’s Farmer Bridge Assistance program sets higher per-acre rates for rice and cotton, drawing attention to uneven support across commodities.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b37ea21bee13e05522cae864fb451659",
        "title": "Hogs Slipping to Kick off the New Year",
        "doc_url": "https://www.barchart.com/story/news/36863297/hogs-slipping-to-kick-off-the-new-year",
        "all_text": "Lean hog futures are down 50 to 85 cents so far on Friday. USDA’s national base hog price was not reported on Friday morning due to thin volume. The CME Lean Hog Index was back up a penny on December 30 at $82.26.\nCFTC data showed managed money in lean hog futures and options adding 10,489 contracts to their net long in the week of 12/23 to a net long position of 75,325 contracts.\nUSDA’s pork carcass cutout value from the Friday AM report was $1.97 higher at $95.71 per cwt. The loin was the only primal reported lower, with the belly up $5.32 and leading the charge. USDA estimated federal inspected hog slaughter for Wednesday at 418,000 head, with the weekly total at 1.36 million head.\nFeb 26 Hogs are at $84.275, down $0.825,\nApr 26 Hogs are at $89.150, down $0.750\nMay 26 Hogs are at $93.425, down $0.575,",
        "authors": "None",
        "publish_date": "2026-01-02 18:11:50",
        "published_at_raw": "2026-01-02T18:11:50Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are down 50 to 85 cents so far on Friday. USDA’s national base hog price was not reported on Friday morning due to thin volume. The CME Lean Hog Index was back up a penny on December 30 at $82.26. CFTC data showed managed money in l...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0d94d255eeca974f586aa2b7995b4ea2",
        "title": "Cotton Falling at Friday’s Midday",
        "doc_url": "https://www.barchart.com/story/news/36863307/cotton-falling-at-fridays-midday",
        "all_text": "Cotton futures are trading with 25 to 45 point losses so far on Friday. Crude oil futures are down 41 cents per barrel at $57.01. The US dollar index is up $0.058 at $98.105.\nOn Wednesday afternoon, USDA released the payment details for the Farm Bridge Assistance program, with the cotton payment listed at $117.35/acre.\nCFTC released an updated Commitment of Traders report on Wednesday afternoon, showing managed money trimming 4,387 contracts from their net short as of 12/23 to 50,446 contracts.\nThe Seam’s online auction showed sales of 17,479 bales on December 31 at an average price of 65.40 cents/lb. The Cotlook A Index was back unchanged on Wednesday at 74.30 cents. ICE certified cotton stocks steady on 12/31 with the certified stocks level at 11,510 bales. The Adjusted World Price was updated to 50.76 cents/lb on Friday morning, up 74 points from the week prior. The LDP rate is now 1.24 cents.\nMar 26 Cotton is at 63.82, down 45 points,\nMay 26 Cotton is at 65.25, down 35 points,\nJul 26 Cotton is at 66.57, down 26 points",
        "authors": "None",
        "publish_date": "2026-01-02 18:11:50",
        "published_at_raw": "2026-01-02T18:11:50Z",
        "meta_site_name": "Barchart",
        "description": "Cotton futures are trading with 25 to 45 point losses so far on Friday. Crude oil futures are down 41 cents per barrel at $57.01. The US dollar index is up $0.058 at $98.105. On Wednesday afternoon, USDA released the payment details for the Farm Bri...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3e1948187602244862f746e11e2533e7",
        "title": "This popular grass-fed ground beef brand has been recalled in six states",
        "doc_url": "https://www.al.com/news/2026/01/this-popular-grass-fed-ground-beef-brand-has-been-recalled-in-six-states.html",
        "all_text": "Nearly 3,000 pounds of ground beef products have been recalled due to E. coli contamination.\nHeyburn, Idaho-based Mountain West Food Group LLC issued a Dec. 16, recall on “Forward Farms Grass-Fed Ground Beef” in 16 oz vacuum-sealed packages, the U.S. Department of Agriculture announced.\nThe agency determined the presence of E. coli O26 in the raw ground beef product following routine testing and sampling.\nE. coli O26 is a strain of bacteria that can cause serious foodborne illness with symptoms such as severe stomach cramps, diarrhea and vomiting, according to a statement by the agency.\nThe federal agency said there have been no reports of illness related to the product. However, consumers who believe they may have consumed the product and are experiencing symptoms should contact their health care provider.\nThe recall affects 2,855 pounds of the raw ground beef product. Consumers can identify the recalled product by:\n16-oz. vacuum-sealed packages of “FORWARD FARMS GRASS-FED GROUND BEEF” with the label “USE OR FREEZE BY 01/13/26 EST 2083” printed on the side of the packaging.\nThe item was shipped to distributors in California, Colorado, Idaho, Montana, Pennsylvania and Washington for further distribution for retail sales.\nThe Department of Agriculture recommends consumers check their refrigerators and freezers for the recalled ground beef. Consumers are urged to throw away or return the product to the place of purchase.",
        "authors": "None",
        "publish_date": "2026-01-02 15:56:19",
        "published_at_raw": "2026-01-02T15:56:19Z",
        "meta_site_name": "AL.com",
        "description": "Forward Farms products containing dangerous E. coli bacteria could be lurking in your freezer right now, according to a USDA announcement.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f6a50f3f4155f631ded4dc7a9d1d636c",
        "title": "Hogs Look to Friday Trade Following Weaker End to 2025",
        "doc_url": "https://www.barchart.com/story/news/36859925/hogs-look-to-friday-trade-following-weaker-end-to-2025",
        "all_text": "Lean hog futures posted losses of a nickel to 35 cents on Wednesday. USDA’s national base hog price was reported at $70.19 on Wednesday afternoon, down 19 cents from the day prior. The CME Lean Hog Index was back down 19 on December 29 at $82.25.\nCFTC data showed managed money in lean hog futures and options adding 10,489 contracts to their net long in the week of 12/23 to a net long position of 75,325 contracts.\nThe delayed Export Sales report from USDA showed a total of 18,978 MT of pork sold for 2025 in the week of December 18, with 25,998 MT for 2026 shipment. Exports were tallied at 34,850 MT for that week.\nUSDA’s pork carcass cutout value from the Wednesday PM report was 39 cents lower at $93.74 per cwt. The picnic and ham were the only primals reported higher. USDA estimated federally inspected hog slaughter for Wednesday at 418,000 head, with the weekly total at 1.36 million head.\nFeb 26 Hogs closed at $85.100, down $0.350,\nApr 26 Hogs closed at $89.900, down $0.275\nMay 26 Hogs closed at $94.000, down $0.050,",
        "authors": "None",
        "publish_date": "2026-01-02 13:19:56",
        "published_at_raw": "2026-01-02T13:19:56Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted losses of a nickel to 35 cents on Wednesday. USDA’s national base hog price was reported at $70.19 on Wednesday afternoon, down 19 cents from the day prior. The CME Lean Hog Index was back down 19 on December 29 at $82.25. CF...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]