[
    {
        "id": "7560fa31b914b532b8d243bfc31b8627",
        "title": "Corn Falls Back on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/36218166/corn-falls-back-on-wednesday",
        "all_text": "Corn futures closed the Wednesday session under pressure, as contracts were down 7 to 8 cents across most months. The CmdtyView national average Cash Corn price was down 6 3/4 cents at $3.91 1/4. Outside markets added pressure, with crude oil down $1.15 and the dollar index up $0.606.\nEIA data from this morning showed a rebound of 16,000 barrels per day to 1.091 million bpd in the week ending on November 14. Stocks of ethanol were up 88,000 barrels to 22.307 million barrels. Exports slipped by 12,000 bpd to 145,000 bpd, with refiner inputs of ethanol down 7,000 bpd to 888,000.\nCensus data was released this morning, showing August corn exports at 6.397 MMT (251.8 mbu). That was a record for the month at 25.42% above last year and a 2.76% increase from July. Distillers exports were up 7.47% from a year ago at 1.167 MMT. Ethanol exports were a record for August at 188.77 million gallons, up 23.76% from last year and 14.84% larger than in July.\nExport Sales for the week of October 2 will be released on Thursday morning, with analysts looking for 1.4 to 2.5 MMT of corn sold.\nA South Korean importer purchased a total of 130,000-135,000 MT of corn in a tender on Tuesday, with the origin yet to be announced. Brazil’s ANEC estimates the November corn export total for the country at 6.36 MMT, a 0.32 MMT increase from last week’s estimates.\nCFTC data from this morning showed speculators in corn futures and options adding 40,635 contracts to their net short position in the week that ende",
        "authors": "None",
        "publish_date": "2025-11-19 22:52:41",
        "published_at_raw": "2025-11-19T22:52:41Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Wednesday session under pressure, as contracts were down 7 to 8 cents across most months. The CmdtyView national average Cash Corn price was down 6 3/4 cents at $3.91 1/4. Outside markets added pressure, with crude oil down $1...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "102883b08727f8f0d5460380c47fbc15",
        "title": "Corn Weakness Falling to Midday",
        "doc_url": "https://www.barchart.com/story/news/36212739/corn-weakness-falling-to-midday",
        "all_text": "Corn futures are trading with sharp 7 to 8 cent losses at midday on Wednesday. The CmdtyView national average Cash Corn price is down 7 3/4 cents at $3.97 1/2.\nEIA data from this morning showed a rebound of 16,000 barrels per day to 1.091 million bpd in the week ending on November 14. Stocks of ethanol were up 88,000 barrels to 22.307 million barrels. Exports slipped by 12,000 bpd to 145,000 bpd, with refiner inputs of ethanol down 7,000 bpd to 888,000.\nCensus data was released this morning, showing August corn exports at 6.397 MMT (251.8 mbu). That was a record for the month at 25.42% above last year and a 2.76% increase from July. Distillers exports were up 7.47% from a year ago at 1.167 MMT. Ethanol exports were a record for August at 188.77 million gallons, up 23.76% from last year and 14.84% larger than in July.\nA South Korean importer purchased a total of 130,000-135,000 MT of corn in a tender on Tuesday, with the origin yet to be announced. Brazil’s ANEC estimates the November corn export total for the country at 6.36 MMT, a 0.32 MMT increase from last week’s estimates.\nCFTC data for the week of September 30 will be released on Wednesday afternoon, with the full Commitment of Traders dataset not expected to be fully updated until January 23.\nDec 25 Corn is at $4.29, down 7 3/4 cents,\nNearby Cash is at $3.90 1/2, down 7 3/4 cents,\nMar 26 Corn is at $4.41 1/4, down 8 1/4 cents,\nMay 26 Corn is at $4.48 1/2, down 8 cents,",
        "authors": "None",
        "publish_date": "2025-11-19 18:29:23",
        "published_at_raw": "2025-11-19T18:29:23Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with sharp 7 to 8 cent losses at midday on Wednesday. The CmdtyView national average Cash Corn price is down 7 3/4 cents at $3.97 1/2. EIA data from this morning showed a rebound of 16,000 barrels per day to 1.091 million bp...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0fddf1acb690c81920c2ffd5fbaf31aa",
        "title": "Slipping to Start Wednesday Trade",
        "doc_url": "https://www.barchart.com/story/news/36205857/slipping-to-start-wednesday-trade",
        "all_text": "Corn price action is down 1 to 2 cents early on Wednesday. Futures posted gains across most contracts on Tuesday with contracts closing up 1 to 2 cents. Preliminary open interest was up 5,489 contracts on Tuesday, with 17,230 contracts still exiting the Dec. The CmdtyView national average Cash Corn price was up 2 cents at $3.98 1/4.\nAfter a near month and a half hiatus, USDA released their Crop Progress report showing 91% of the corn crop harvested as of 11/16, behind the 94% average harvest pace over the last 5 years.\nA South Korean importer purchased a total of 130,000-135,000 MT of corn in a tender on Tuesday, with the origin yet to be announced.\nCFTC data for the week of September 30 will be released on Wednesday afternoon, with the full Commitment of Traders dataset not expected to be fully updated until January 23.\nEIA data will be released this morning, with most looking for ethanol production to be firm with last week’s total.\nDec 25 Corn closed at $4.36 3/4, up 2 cents, currently down 2 cents\nNearby Cash was $3.98 1/4, up 2 cents,\nMar 26 Corn closed at $4.49 1/2, up 1 1/2 cents, currently down 1 3/4 cents\nMay 26 Corn closed at $4.56 1/2, up 1 cent, currently down 1 1/2 cents",
        "authors": "None",
        "publish_date": "2025-11-19 13:31:36",
        "published_at_raw": "2025-11-19T13:31:36Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is down 1 to 2 cents early on Wednesday. Futures posted gains across most contracts on Tuesday with contracts closing up 1 to 2 cents. Preliminary open interest was up 5,489 contracts on Tuesday, with 17,230 contracts still exiting...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f507a0c037c6a51819e328c168341beb",
        "title": "Buy Bean Oil as China Resumes Soybean Purchases",
        "doc_url": "https://www.barchart.com/story/news/36209010/buy-bean-oil-as-china-resumes-soybean-purchases",
        "all_text": "March soybean oil (ZLH26) futures present a buying opportunity on more price strength.\nSee on the daily bar chart for March soybean oil futures that prices are trending higher and this week hit a two-month high. See, too, at the bottom of the chart that the moving average convergence divergence indicator is in a bullish posture, as the blue MACD line is above the red trigger line and both lines are trending up. The bean oil bulls have the near-term technical advantage.\nFundamentally, China is buying U.S. soybeans again, which is supporting the soybean complex futures. Also, soybean oil has been the laggard recently, amid stronger rallies in soybeans (ZSF26) and soybean meal (ZMZ25). That suggests bean oil has some catching up to do, on the upside, in the near term.\nA move in March soybean oil futures above chart resistance at this week’s high of 53.29 cents would give the bulls more power and it would also become a buying opportunity. The upside price objective would be 59.00 cents, or above. Technical support, for which to place a protective sell stop just below, is located at this week’s low of 50.67 cents.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in natur",
        "authors": "None",
        "publish_date": "2025-11-19 15:13:39",
        "published_at_raw": "2025-11-19T15:13:39Z",
        "meta_site_name": "Barchart",
        "description": "March soybean oil futures present a buying opportunity on more price strength.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ae4df3b701ff5ad1115ba942c43858de",
        "title": "Ensure no shortage of gunny bags in Kharif season: Maharashtra minister tells officials",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3703324-ensure-no-shortage-of-gunny-bags-in-kharif-season-maharashtra-minister-tells-officials",
        "all_text": "The Maharashtra government has instructed officials to avoid a shortage of gunny bags at procurement centres during the ongoing 2025-26 Kharif season.\nRegistration for the Minimum Support Price (MSP) purchase of soybean, urad and moong began on October 30, and as many as 2,20,316 farmers have enrolled until November 18, an official release said.\nMarketing Minister Jaykumar Rawal on Wednesday reviewed the progress of procurement centres and the availability of packaging material at a review meeting. He directed the administration to ensure that there is no shortage of gunny bags. Of the 725 proposals received for procurement centres, the state government has approved 713, while NAFED and NCCF have cleared 579, and 484 centres are currently operational, according to the release. Procurement has already crossed 11,099 quintals from 528 farmers as of November 18, marking a significant expansion compared to last season's 562 centres, it said.\nThe state has set procurement targets of 18.50 lakh tonnes for soybean, 33,000 tonnes for moong and 3.25 lakh tonnes for urad this year. The Centre has raised the MSP rates to Rs 5,328 per quintal for soybean, Rs 8,768 for moong, and Rs 7,800 for urad.\nProcurement will be carried out between November 15 and February 12, through NAFED and NCCF in coordination with three nodal agencies in Mumbai, Nagpur and Pune.\n(This story has not been edited by Devdiscourse staff and is auto-generated from a syndicated feed.)",
        "authors": "None",
        "publish_date": "2025-11-19 14:04:34",
        "published_at_raw": "2025-11-19T14:04:34Z",
        "meta_site_name": "Devdiscourse",
        "description": "The Maharashtra government has instructed officials to avoid a shortage of gunny bags at procurement centres during the ongoing 2025-26 Kharif season.Registration for the Minimum Support Price MSP purchase of soybean, urad and moong began on October 30, and as many as 2,20,316 farmers have enrolled until November 18, an official release said.Marketing Minister Jaykumar Rawal on Wednesday reviewed the progress of procurement centres and the availability of packaging material at a review meeting.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:46",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3c6e094514e8288e519690c4b7bff412",
        "title": "Trump Admin Signals Mysterious ‘Structural Changes’ To SNAP Food Benefits",
        "doc_url": "https://www.huffpost.com/entry/usda-snap-fraud-brooke-rollins_n_691e2e93e4b06f2a60cb7bd2",
        "all_text": "LOADINGERROR LOADING\nWASHINGTON ― The Trump administration is planning major changes to federal food benefits, according to U.S. Department of Agriculture Secretary Brooke Rollins, though the exact nature of those changes is unclear even to members of Trump’s party on Capitol Hill.\nRollins has said all 22 million households enrolled in the Supplemental Nutrition Assistance Program will have to reapply for benefits as part of a forthcoming purge of fraudulent recipients ― a step enrollees are already required to take. A Republican source on Capitol Hill said lawmakers have no idea what Rollins is talking about.\nAdvertisement\n“We’re making a lot of structural changes in SNAP,” Rollins said Wednesday on Newsnation. “We’ll have a big announcement about that the week after Thanksgiving exactly what that’s going to look like.”\nLast week, Rollins said the USDA would “fundamentally rebuild this program, have everybody reapply for their benefit, make sure that everybody’s taking a taxpayer benefit through SNAP or food stamps that they literally are vulnerable and can’t survive without it.”\nSpeaking to Newsmax, Rollins said the USDA had uncovered evidence that thousands of SNAP recipients were actually dead, and their benefits were being paid fraudulently. The USDA hasn’t made the data public.\nAdvertisement\nIt’s not clear what reforms could be coming, especially since people on SNAP already have to reapply for benefits and quickly report any changes in their economic circumstances that",
        "authors": "None",
        "publish_date": "2025-11-19 22:44:17",
        "published_at_raw": "2025-11-19T22:44:17Z",
        "meta_site_name": "HuffPost",
        "description": "USDA Secretary Brooke Rollins' talk about making SNAP recipients reapply for benefits has program stakeholders scratching their heads.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c99cf0c47375662d3f950c3530860eff",
        "title": "SNAP fraud hits 226,000 claims as Trump admin requires reapplication",
        "doc_url": "https://www.foxnews.com/politics/food-stamp-fraud-numbers-expose-which-states-draining-most-taxpayer-dollars",
        "all_text": "NEWYou can now listen to Fox News articles!\nNew data from the U.S. Department of Agriculture reveal the states where the nation’s largest food assistance program is costing taxpayers the most through fraud and misuse.\nThe size and scope of the Supplemental Nutrition Assistance Program (SNAP), which supports more than 40 million Americans, came under renewed scrutiny during the government shutdown as funding for the sweeping food assistance program neared a funding lapse.\nCHARTS ILLUSTRATE THE SCALE OF SNAP AS MILLIONS FACE POTENTIAL BENEFIT LAPSE\nThe spotlight on the program, meant to be a lifeline for low-income households, was welcomed by Agriculture Secretary Brooke Rollins, who told Fox Business on Monday that the Trump administration will require all SNAP participants to reapply for benefits in an effort to prevent fraud.\nRollins has previously said that one of her top early priorities was reevaluating SNAP, amid concerns about who qualifies and how the program is monitored.\n\"There are vulnerable families in America that need this program that aren’t getting it because of the fraud and abuse that now we’re going to work to fix,\" Rollins said.\nTRUMP ADMINISTRATION CITES WIDESPREAD MISUSE OF SNAP AS FUNDING LAPSES DURING SHUTDOWN\nThe scale of the program is striking.\nDuring former President Joe Biden's administration, federal spending on SNAP climbed to record highs at $128 billion in 2021 and $127 billion in 2022, largely driven by COVID-19 relief measures that expanded a",
        "authors": "None",
        "publish_date": "2025-11-19 19:34:18",
        "published_at_raw": "2025-11-19T19:34:18Z",
        "meta_site_name": "Fox News",
        "description": "New USDA data reveals SNAP fraud costs taxpayers over $102 million as Agriculture Secretary Brooke Rollins requires all recipients to reapply for benefits.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "212732f34f4942d6a683d85215faf48d",
        "title": "What Do I Think of Recent US Soybean Sales?",
        "doc_url": "https://www.barchart.com/story/news/36212056/what-do-i-think-of-recent-us-soybean-sales",
        "all_text": "Since at least early October, I've written more about US soybeans than any other market.\nThe bottom line is the market has not changed a great deal fundamentally.\nThe bottom bottom line is what changes have been seen are seasonal.\nTo borrow a quote from fictional Cleveland Indian radio announcer Harry Doyle (played by the late Bub Uecker, the real play-by-play announcer for the Milwaukee Brewers for more than 5 decades): In case you hadn’t noticed, and judging by the readership numbers you haven’t, I have been talking a lot about the soybean market lately. If I go back only as far as October 1, 2025, the day the US government was shut down and the world’s largest buyer got busy covering secondary supply needs under cover of darkness, I’ve written about the soybean market no less than 7 times[i]. Most recently, this past Monday when I discussed the question of, “What Spiked the Soybean Market – Again?”.\nThe bottom line of all I’ve written over the past couple months is fundamentally the US soybean market hasn’t changed. That the latest “deal” between the US and China, brokered by the artist known as the US president himself, was a clear win for China in that it did not require the purchase of physical US soybean supplies, but rather could be filled by the purchase of futures contracts. Additionally, just likely the previous and similarly overhyped Phase One trade agreement from January 2020 the latest “deal” allowed China to buy from the most competitive market. And according ",
        "authors": "None",
        "publish_date": "2025-11-19 17:49:09",
        "published_at_raw": "2025-11-19T17:49:09Z",
        "meta_site_name": "Barchart",
        "description": "This week has seen some sales of US soybeans to China announced why USDA. Has it changed my mind about the market?",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "29f18951ead87c4e647cff58e997e31e",
        "title": "USDA SNAP benefits update: Program to be completely deconstructed? Here are the details",
        "doc_url": "https://economictimes.indiatimes.com/news/international/us/usda-snap-benefits-update-program-to-be-completely-deconstructed-here-are-the-details/articleshow/125439389.cms",
        "all_text": "Synopsis\nUSDA SNAP benefits update: USDA says it may “completely deconstruct” SNAP as the agency faces a funding shortfall that threatens November payments for roughly 42 million Americans. Secretary Brooke Rollins cites fraud risks and system failures as reasons for a full reset. All recipients will be required to reapply, creating one of the largest eligibility reviews in program history. New rules may mandate 80 hours of monthly work or training, a shift the CBO says could cut participation by 2.4 million over ten years. Several states warn of delayed EBT deposits as legal and budget disputes continue.\nUSDA SNAP benefits update: USDA has sparked nationwide concern after signaling a major overhaul of the Supplemental Nutrition Assistance Program. Millions of Americans rely on SNAP each month, and any disruption can quickly ripple across households, food banks, and state systems. The agency’s new stance, including the phrase “completely deconstruct the program,” has raised urgent questions about what happens next for families depending on these benefits.\nUSDA Secretary Brooke Rollins has said the administration wants a deeper reset of SNAP due to concerns about fraud, outdated eligibility systems, and misuse. The agency cites cases of ineligible payments, duplicate benefits, and structural inefficiencies. These concerns intensified during the 2025 government funding crisis, when USDA warned that it could not guarantee full November benefit issuance without new appropriations",
        "authors": "None",
        "publish_date": "2025-11-19 14:26:00",
        "published_at_raw": "2025-11-19T14:26:00Z",
        "meta_site_name": "The Economic Times",
        "description": "USDA SNAP benefits update: USDA says it may “completely deconstruct” SNAP as the agency faces a funding shortfall that threatens November payments for roughly 42 million Americans. Secretary Brooke Rollins cites fraud risks and system failures as reasons for a full reset. All recipients will be required to reapply, creating one of the largest eligibility reviews in program history. New rules may mandate 80 hours of monthly work or training, a shift the CBO says could cut participation by 2.4 million over ten years. Several states warn of delayed EBT deposits as legal and budget disputes continue.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "962a5391e0e48072c80cd0c8005dd62a",
        "title": "USDA SNAP benefits change: Recipients face new requirements as ‘work-free’ benefits are axed",
        "doc_url": "https://www.independent.co.uk/us/money/usda-snap-benefits-requirements-change-b2868237.html",
        "all_text": "Federal SNAP food assistance is flowing to low-income households again but in the months ahead, many participants will have to abide by new work requirements.\nThe Supplemental Nutrition Assistance Program provides monthly benefits — averaging around $190 per person — to about 42 million people nationwide.\nDuring the first few weeks of November, many of those recipients missed their regular allotments as President Donald Trump's administration battled in court over whether tap into reserves to fund the program while the government was shut down.\nHere’s what to know about SNAP:\nThe benefits are available across the country after lapses\nFor the first part of the month, the situation was chaotic after the federal government said SNAP would not be funded because of the government shutdown.\nSome states replenished the electronic benefit cards used in the program either fully or partially, using their own funds or federal dollars that were part of court orders. Others didn't.\nMost states boosted food charities, but lines were long and some shelves were empty.\nAs soon as the government reopened on Nov. 12, many states rushed to get out benefits.\nBy Tuesday, all states either had loaded full November benefits onto people’s electronic spending cards or were working on it, according to an Associated Press review. Participants should receive December SNAP benefits according to their normal schedule.\nMore SNAP recipients will face work requirements\nA massive tax and spending bill signed i",
        "authors": "None",
        "publish_date": "2025-11-19 13:59:17",
        "published_at_raw": "2025-11-19T13:59:17Z",
        "meta_site_name": "The Independent",
        "description": "The Trump administration waived the requirements in November",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "858c3fa16cdd28a2ef43234349ed856e",
        "title": "Hog Traders Look to Wednesday after Weaker Tuesday Trade",
        "doc_url": "https://www.barchart.com/story/news/36205915/hog-traders-look-to-wednesday-after-weaker-tuesday-trade",
        "all_text": "Lean hog futures saw losses on Tuesday, as contracts fell 67 cent to $1.40. USDA’s national base hog price from Tuesday afternoon was reported at $75.56, down 58 cents from the day prior. The CME Lean Hog Index was down 94 cents on November 14 at $87.00.\nUSDA’s pork carcass cutout value from the Tuesday PM report was down $1.62 to $95.39 per cwt. The picnic and belly primals were the only reported higher, with the ham leading the downward charge, losing $3.99. USDA estimated federally inspected hog slaughter for the Tuesday at 494,000 head and the week to date total at 988,000 head. That is 34,000 head above last week and up 8,638 head from same week last year.\nDec 25 Hogs closed at $77.900, down $0.675,\nFeb 26 Hogs closed at $78.025, down $1.400\nApr 26 Hogs closed at $81.625, down $1.400,",
        "authors": "None",
        "publish_date": "2025-11-19 13:31:36",
        "published_at_raw": "2025-11-19T13:31:36Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw losses on Tuesday, as contracts fell 67 cent to $1.40. USDA’s national base hog price from Tuesday afternoon was reported at $75.56, down 58 cents from the day prior. The CME Lean Hog Index was down 94 cents on November 14 at $87...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f0e5bc502d04dbf0d1b3572d565bc3f5",
        "title": "USDA SNAP Benefits update: Will Americans have to reapply for food stamps? What we know",
        "doc_url": "https://www.livemint.com/news/us-news/usda-snap-benefits-update-will-americans-have-to-reapply-for-food-stamps-what-we-know-11763557250672.html",
        "all_text": "Millions of Americans who rely on SNAP benefits each months to cover grocery costs, may soon have to reapply to get the benefits.\nIn an interview with Fox Business, Agriculture Secretary Brooke Rollins said that that participants will need to reapply for benefits in an effort to prevent fraud.\n\"Business as usual is over. The status quo is no more,\" she said\nThe move may put the recipients in a situation as many people did not get their November benefits due to the longest US government shutdown, forcing families to stand in queues to get aid for other organisations.\nRollins claimed that 186,000 deceased men and women are receiving benefits and 500,000 people receiving SNAP benefits twice under the same name.\nShe added that far only 29 states, mostly Republican-led, have complied with the request.\nData from the Department of Agriculture (USDA) indicates that more than 226,000 fraudulent benefit claims and more than 691,000 fraudulent transactions received approval, reported Fox News.\nEarlier last month, Rollins said that the investigators found thousands and thousands of illegal uses of the electronic benefits transfer (EBT) card.\nAccording to Politico, Rollins told Newsmax that she plans to “have everyone reapply for their benefits, make sure that everyone that’s taking a taxpayer-funded benefit through ... food stamps, that they literally are vulnerable and they can’t survive without it.”\nHowever, it remains unclear when the process to reapply will begin.",
        "authors": "None",
        "publish_date": "2025-11-19 13:31:09",
        "published_at_raw": "2025-11-19T13:31:09Z",
        "meta_site_name": "Livemint",
        "description": "USDA SNAP Benefits update: Will Americans have to reapply for food stamps? What we know",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8979d26fadda190400a99612063f9483",
        "title": "SNAP Benefits Update: USDA To ‘Completely Deconstruct’ Program",
        "doc_url": "https://www.newsweek.com/snap-benefits-update-usda-completely-deconstruct-program-11071472",
        "all_text": "U.S. Department of Agriculture (USDA) Secretary Brooke Rollins has said the department will \"completely deconstruct\" the Supplemental Nutrition Assistance Program (SNAP) in an effort to remove fraud and corruption from the program.\nNewsweek has contacted the USDA for comment via email outside regular working hours.\nWhy It Matters\nSNAP supports about 42 million low-income Americans nationwide by helping them cover the costs of groceries each month.\nThe program came into the spotlight during the recent government shutdown—the longest in U.S. history—when many did not receive their benefits as scheduled in November.\nRollins' comment also comes amid the government's announcement of two major changes to the program: Work requirement provisions brought in by the One Big Beautiful Bill Act could see millions removed from the program, and recipients could be required to reapply for the benefits so that those no longer deemed eligible can be removed from the program.\nWhat To Know\nIn an interview with Fox Business' Larry Kudlow on Tuesday, Rollins said early data already showed that \"186,000 dead people are receiving SNAP benefits,\" while another 500,000 people are receiving the benefits in more than one state.\nUSDA data indicates that more than 226,000 fraudulent benefit claims and 691,000 fraudulent transactions received approval in the first quarter of 2025, Fox Business reported.\nFraudulent transactions refer to when SNAP-receiving households do not authorize claims because of card",
        "authors": "None",
        "publish_date": "2025-11-19 12:35:52",
        "published_at_raw": "2025-11-19T12:35:52Z",
        "meta_site_name": "Newsweek",
        "description": "U.S. Department of Agriculture Secretary Brooke Rollins has said the department will \"completely deconstruct\" SNAP to combat fraud.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "52350318928f6448318fffd5b26d0090",
        "title": "Iowa Corn and Soybean Harvest Essentially Complete Across the State",
        "doc_url": "https://www.agriculture.com/partners-iowa-corn-and-soybean-harvest-essentially-complete-across-the-state-11852452",
        "all_text": "By Cami Koons\nJust 3% of corn acres and 1% of soybean acres across the state of Iowa remain unharvested, according to the latest data from the USDA’s Crop Progress and condition report.\nCorn harvest is just slightly ahead of the five-year average and on target with 2024 harvest figures. Soybean harvest was 100% completed this time last year, but this year’s pace is in line with the five-year average.\nThe weekly harvest-season reports from USDA’s National Agricultural Statistics Service were paused during the 43-day government shutdown. The report for the Nov. 10 through Nov. 16 period shows the tail end of Iowa’s harvest.\nAccording to the report, soil moisture conditions were slightly dry across the state. On average, 62% of topsoil and 63% of subsoil across the state had adequate moisture. Twenty-seven percent of both top and subsoils averages across the state were short in terms of moisture.\nEastern parts of the state had the driest soils, with between 39% and 57% of topsoil and subsoil in the regions listed as short.\nAccording to State Climatologist Justin Glisan, precipitation across Iowa was low for the reporting period, with most stations reporting no precipitation. The normal statewide average for the period is four-tenths of an inch, but Glisan said the statewide average was below a measurable amount.\nTemperatures at the beginning of the week were 18 degrees Fahrenheit below the climatological normal, but on Friday, average temperatures across the state were 15 to 30 ",
        "authors": "None",
        "publish_date": "2025-11-19 12:34:17",
        "published_at_raw": "2025-11-19T12:34:17Z",
        "meta_site_name": "Successful Farming",
        "description": "Just 3% of corn acres and 1% of soybean acres across the state of Iowa remain unharvested, according to the latest data from the USDA’s Crop Progress and condition report.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:24",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]