[
    {
        "id": "f7f48045a5fdf566c95d5b732501ae4a",
        "title": "Corn Rally into the Long Weekend",
        "doc_url": "https://www.barchart.com/story/news/37091613/corn-rally-into-the-long-weekend",
        "all_text": "Corn futures closed the Friday session with contracts 4 to 5 cents higher in the front months, taking back some early week losses. March was still down 21 cents on the week, a 4.71% loss. The CmdtyView national average Cash Corn price is up 6 cents at $3.89 1/2.\nThe markets will be off on Monday for the Martin Luther King Jr. Day holiday. They will open back up on Monday evening.\nCFTC data showed managed money in corn futures and options adding 65,348 contracts to their net short position in corn futures and options as of January 13. That took their net short to 81,774 contracts. Much of that was vis new short interest, at the largest since October, with longs going to their smallest since November.\nUSDA reported a couple private export sales this morning of 298,000 MT of corn during to unknown destinations, with 120,000 MT for Japan. The total flash sales for the week are now 1.83 MMT.\nUSDA Export Sales data as of January 8 has 52.035 MMT of corn commitments (shipped and unshipped sales), which is 29% above the same week las year. That is 64% of USDA’s forecast and ahead of the 62% average sales pace. Meanwhile, FAS actual shipment data is 28.97 MMT, of 36% of USDA’s projection vs. a 26% average shipping pace.\nMar 26 Corn closed at $4.24 3/4, up 4 1/2 cents,\nNearby Cash was $3.87 0/1, up 4 3/4 cents,\nMay 26 Corn closed at $4.32, up 4 1/4 cents,\nJul 26 Corn closed at $4.38, up 4 cents,",
        "authors": "None",
        "publish_date": "2026-01-16 22:53:21",
        "published_at_raw": "2026-01-16T22:53:21Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Friday session with contracts 4 to 5 cents higher in the front months, taking back some early week losses. March was still down 21 cents on the week, a 4.71% loss. The CmdtyView national average Cash Corn price is up 6 cents a...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ac8bd0f1fad5fc97dc68fce452d5281c",
        "title": "Corn Rallying into the Weekend",
        "doc_url": "https://www.barchart.com/story/news/37087213/corn-rallying-into-the-weekend",
        "all_text": "Corn price action is trading with 5 to 6 cent gains at midday on Friday. The CmdtyView national average Cash Corn price is up 6 cents at $3.89 1/2.\nThe markets will be off on Monday for the Martin Luther King Jr. Day holiday. They will open back up on Monday evening.\nUSDA reported a couple private export sales this morning of 298,000 MT of corn during to unknown destinations, with 120,000 MT for Japan.\nUSDA Export Sales data as of January 8 has 52.035 MMT of corn commitments (shipped and unshipped sales), which is 29% above the same week las year. That is 64% of USDA’s forecast and ahead of the 62% average sales pace. Meanwhile, FAS actual shipment data is 28.97 MMT, of 36% of USDA’s projection vs. a 26% average shipping pace.\nA couple South Korean importers purchased 130,000 MT of corn in private purchase overnight.\nMar 26 Corn is at $4.26 1/4, up 6 cents,\nNearby Cash is at $3.89 1/2, up 6 cents,\nMay 26 Corn is at $4.33 1/4, up 5 1/2 cents,\nJul 26 Corn is at $4.39, up 5 cents,",
        "authors": "None",
        "publish_date": "2026-01-16 18:20:52",
        "published_at_raw": "2026-01-16T18:20:52Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is trading with 5 to 6 cent gains at midday on Friday. The CmdtyView national average Cash Corn price is up 6 cents at $3.89 1/2. The markets will be off on Monday for the Martin Luther King Jr. Day holiday. They will open back up...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a33866eb9180afa4689bd3d4a6b4f8a9",
        "title": "Corn Prices Just Hit a 5-Month Low. Is It Time to Sell?",
        "doc_url": "https://www.barchart.com/story/news/37086214/corn-prices-just-hit-a-5-month-low-is-it-time-to-sell",
        "all_text": "March corn (ZCH26) futures present a selling opportunity on more price weakness.\nSee on the daily bar chart for March corn dollar futures that prices this week hit a five-month low. See, too, that a big and bearish bear flag or bearish pennant pattern is forming.\nFundamentally, a bearish USDA supply and demand report earlier this week showed higher-than-expected U.S. corn production and higher-than-expected U.S. corn stockpiles.\nA move in March corn below chart support at $4.19 would give the bears more power and it would also become a selling opportunity. The downside price objective would be $3.95 or below. Technical resistance, for which to place a protective buy stop just above, is seen at $4.30.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in nature.\nHere is what the Commodity Futures Trading Commission (CFTC) has said about futures trading (and I agree 100%):\nTrading commodity futures and options is not for everyone. IT IS A VOLATILE, COMPLEX AND RISKY BUSINESS. Before you invest any money in futures or options contracts, you should consider your financial experience, goals and financial resources, and know how much you can afford to lose above and beyond ",
        "authors": "None",
        "publish_date": "2026-01-16 17:07:25",
        "published_at_raw": "2026-01-16T17:07:25Z",
        "meta_site_name": "Barchart",
        "description": "March corn futures present a selling opportunity on more price weakness.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b31601f7c8aa44b7c5d85d8465cfea36",
        "title": "Corn Ticking Higher on Friday Morning Trade",
        "doc_url": "https://www.barchart.com/story/news/37081982/corn-ticking-higher-on-friday-morning-trade",
        "all_text": "Corn price action is showing 1 to 2 cent gains so far on Friday morning. Futures closed the Thursday session with contracts down 1 to 2 cents in the front months. Preliminary open interest was up another 14,050 contracts on Thursday. The CmdtyView national average Cash Corn price was down 1 ½ cents at $3.82 1/2.\nThe markets will be off on Monday for the Martin Luther King Jr. Day holiday. They will open back up on Monday evening.\nUSDA reported a couple private export sales of 500,302 MT of corn during the reporting period to unknown destinations, with 260,000 MT during the reporting period for Japan.\nUSDA Export Sales data from Thursday showed a total of 1.14 MMT of 2025/26 corn sold in the ending on January 8. That was more than triple the sales from the week prior, a 3-week higher, and 11.3% above the same week last year. Mexico was the top buyer of 265,800 MT, with 210,800 MT sold to Japan and 133,400 MT to Taiwan. Another 1,270 MT was sold for 2026/27.\nA couple South Korean importers purchased 130,000 MT of corn in private purchase overnight.\nMar 26 Corn closed at $4.20 1/4, down 1 3/4 cents, currently up 2 cents\nNearby Cash was $3.82 1/2, down 1 1/2 cents,\nMay 26 Corn closed at $4.27 3/4, down 2 cents, currently up 1 3/4 cents\nJul 26 Corn closed at $4.34, down 2 cents, currently up 1 1/2 cents",
        "authors": "None",
        "publish_date": "2026-01-16 13:22:38",
        "published_at_raw": "2026-01-16T13:22:38Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is showing 1 to 2 cent gains so far on Friday morning. Futures closed the Thursday session with contracts down 1 to 2 cents in the front months. Preliminary open interest was up another 14,050 contracts on Thursday. The CmdtyView na...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "24a0bd220854ddf903c1f0bd940e82ec",
        "title": "Corn heads for biggest weekly loss since July on abundant supply",
        "doc_url": "https://www.marketscreener.com/news/corn-heads-for-biggest-weekly-loss-since-july-on-abundant-supply-ce7e58deda88ff2c",
        "all_text": "Trader\nThis super rating is the result of a weighted average of the rankings based on the following ratings: Global Valuation (Composite), EPS Revisions (4 months), and Visibility (Composite). We recommend that you carefully review the associated descriptions.\nInvestor\nThis super composite rating is the result of a weighted average of the rankings based on the following ratings: Fundamentals (Composite), Global Valuation (Composite), EPS Revisions (1 year), and Visibility (Composite). We recommend that you carefully review the associated descriptions.\nGlobal\nThis composite rating is the result of an average of the rankings based on the following ratings: Fundamentals (Composite), Valuation (Composite), Financial Estimates Revisions (Composite), Consensus (Composite), and Visibility (Composite). The company must be covered by at least 4 of these 5 ratings for the calculation to be performed. We recommend that you carefully review the associated descriptions.\nQuality\nThis composite rating is the result of an average of the rankings based on the following ratings: Capital Efficiency (Composite), Quality of Financial Reporting (Composite), and Financial Health (Composite). The company must be covered by at least 2 of these 3 ratings for the calculation to be performed. We recommend that you carefully review the associated descriptions.",
        "authors": "None",
        "publish_date": "2026-01-16 02:00:20",
        "published_at_raw": "2026-01-16T02:00:20Z",
        "meta_site_name": "MarketScreener",
        "description": "Chicago corn futures edged\nhigher on Friday but were still set for a weekly loss of more\nthan 5%, their steepest drop since July, after upward revisions\nto production estimates underscored abundant...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:08",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e5a3596a389bfef549c7534168896d8d",
        "title": "Paraguay and the EU’s Deforestation Law: Indirect Trade Risks and Supply Chain Pressures",
        "doc_url": "https://www.devdiscourse.com/article/science-environment/3768790-paraguay-and-the-eus-deforestation-law-indirect-trade-risks-and-supply-chain-pressures",
        "all_text": "A study, produced by the World Bank’s Prosperity and Planet Verticals with support from institutions such as the European Commission’s Joint Research Centre, Paraguay’s National Forestry Institute (INFONA), MapBiomas Paraguay, and the Global Land Analysis and Discovery (GLAD) program, examines how Paraguay could be affected by the European Union’s Regulation on Deforestation-Free Products (EUDR). Adopted in 2023, the EUDR aims to prevent products linked to deforestation or forest degradation after December 31, 2020, from entering the EU market. Although designed to reduce global environmental damage, the regulation is expected to affect exporting countries very differently depending on how they trade, how their supply chains work, and how strong their monitoring systems are. Paraguay, a major exporter of soy and beef, offers an important test case.\nLimited Direct Exposure, Bigger Indirect Risks\nAt first glance, Paraguay seems only lightly exposed to the EUDR. Over the past decade, the EU has become a relatively small export destination for the country. By 2023, just 4.3 percent of Paraguay’s total exports went to the EU, and only 1.6 percent of exports of EUDR-covered products ended up there. This is far lower than in neighboring countries such as Brazil, Argentina, and Uruguay. On paper, this suggests that the regulation would have only a limited direct impact on Paraguay’s trade.\nHowever, this view changes once indirect trade links are considered. Paraguay is landlocked and",
        "authors": "None",
        "publish_date": "2026-01-16 03:53:05",
        "published_at_raw": "2026-01-16T03:53:05Z",
        "meta_site_name": "Devdiscourse",
        "description": "Paraguay’s direct exposure to the EU’s deforestation-free regulation is limited, but its strong dependence on soy exports processed through Argentina means up to 13% of its soy trade could be indirectly affected. The main risks lie with small, fragmented timber exporters and weak traceability systems, even though only a very small share of soybean land appears linked to recent deforestation.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e7f4a8d897589079e303fa6205f610db",
        "title": "USDA grain market shocker: Any chance for a bull market based on weather?",
        "doc_url": "https://www.barchart.com/story/news/37091741/usda-grain-market-shocker-any-chance-for-a-bull-market-based-on-weather",
        "all_text": "by Jim Roemer\nMeteorologist - Commodity Trading Advisor - Principal, Best Weather Inc. & Climate Predict - Publisher, Weather Wealth Newsletter\nScott Mathews Editor-in-Chief\nJanuary 16, 2026\nFeel free to download this latest free issue of WeatherWealth:\nhttps://www.bestweatherinc.com/weather-wealth-sample/\nHere are excerpts from one of our recent issues:\n“… Even though corn and soybean yields dropped slightly due to the dryness in late summer, I preached (last April and May) for another big US crop and a generally bearish attitude. Is it possible that all of this could change?\nEventually, there will be a bull market in grains. It all depends on the weather and if La Niña will hold on a bit longer into spring or early summer. For the most part, during three consecutive years, I have not been getting caught up in all the hype about Midwest droughts, hot weather, what China may do (or may not do), trade tariffs, etc.\nI have stuck to the weather, which, on a global basis, has been bearish for corn, soybeans, and wheat …”\n“… Unbelievable shocker in corn acreage: This goes to show you that trading USDA crop reports is futile and a waste of your money …”\n\"… The first potential weather problems I’m seeing for grains are a possible Russian freeze next week with sub-zero temperatures and a lack of snow cover. This, and the lack of moisture in the southern Plains wheat-growing regions, will be closely watched by the trade, once the crop comes out of dormancy later in March.\nIn addition,",
        "authors": "None",
        "publish_date": "2026-01-16 23:03:57",
        "published_at_raw": "2026-01-16T23:03:57Z",
        "meta_site_name": "Barchart",
        "description": "Jim offers his current opinions on the prospects for wheat prices down the road",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9c23899d24687970b175e9a4b7bae377",
        "title": "USDA grain market shocker: Any chance for a bull market based on weather?",
        "doc_url": "https://www.barchart.com/story/news/37091740/usda-grain-market-shocker-any-chance-for-a-bull-market-based-on-weather",
        "all_text": "by Jim Roemer\nMeteorologist - Commodity Trading Advisor - Principal, Best Weather Inc. & Climate Predict - Publisher, Weather Wealth Newsletter\nScott Mathews Editor-in-Chief\nJanuary 16, 2026\nFeel free to download this latest free issue of WeatherWealth:\nhttps://www.bestweatherinc.com/weather-wealth-sample/\nHere are excerpts from one of our recent issues:\n“… Even though corn and soybean yields dropped slightly due to the dryness in late summer, I preached (last April and May) for another big US crop and a generally bearish attitude. Is it possible that all of this could change?\nEventually, there will be a bull market in grains. It all depends on the weather and if La Niña will hold on a bit longer into spring or early summer. For the most part, during three consecutive years, I have not been getting caught up in all the hype about Midwest droughts, hot weather, what China may do (or may not do), trade tariffs, etc.\nI have stuck to the weather, which, on a global basis, has been bearish for corn, soybeans, and wheat …”\n“… Unbelievable shocker in corn acreage: This goes to show you that trading USDA crop reports is futile and a waste of your money …”\n\"… The first potential weather problems I’m seeing for grains are a possible Russian freeze next week with sub-zero temperatures and a lack of snow cover. This, and the lack of moisture in the southern Plains wheat-growing regions, will be closely watched by the trade, once the crop comes out of dormancy later in March.\nIn addition,",
        "authors": "None",
        "publish_date": "2026-01-16 23:03:57",
        "published_at_raw": "2026-01-16T23:03:57Z",
        "meta_site_name": "Barchart",
        "description": "Jim offers his current opinions on the prospects for wheat prices down the road",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d5d4d350b52a69dcc07525f4d154fc18",
        "title": "Hogs Close with Slight Gains on Friday",
        "doc_url": "https://www.barchart.com/story/news/37091659/hogs-close-with-slight-gains-on-friday",
        "all_text": "Lean hog futures saw slightly higher action in Friday, with contracts up 20 to 50 cents. February managed to close the week with a $2.97 gain. USDA’s national base hog price was at $74.78 reported on Friday afternoon. The CME Lean Hog Index was back up 11 cents on Jan 13 at $80.50. The markets will be off on Monday for the Martin Luther King Jr. Day holiday.\nCommitment of Traders data showed spec funds increasing their net long by just 766 contracts as of January 13, taking the lean hog net long to 82,624 contracts.\nUSDA’s pork carcass cutout value from the Friday afternoon report was 3 cents higher at $93.63 per cwt. The loin, butt, and belly primals were reported higher. USDA estimated federally inspected hog slaughter for this week at 2.623 million head. That is 60,000 head below last week and 4,066 head above the same week last year.\nFeb 26 Hogs closed at $88.275, up $0.475,\nApr 26 Hogs closed at $95.200, up $0.200\nMay 26 Hogs closed at $98.725, up $0.250,",
        "authors": "None",
        "publish_date": "2026-01-16 22:53:21",
        "published_at_raw": "2026-01-16T22:53:21Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw slightly higher action in Friday, with contracts up 20 to 50 cents. February managed to close the week with a $2.97 gain. USDA’s national base hog price was at $74.78 reported on Friday afternoon. The CME Lean Hog Index was back...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "98b734c3eb547d48fe7bf91d4ec51e9f",
        "title": "Hogs Trading Steady at Midday",
        "doc_url": "https://www.barchart.com/story/news/37087253/hogs-trading-steady-at-midday",
        "all_text": "Lean hog futures are near unchanged at midday, with nearby contracts a dime on either side. USDA’s national base hog price was not reported on Friday morning due to light volume. The CME Lean Hog Index was back up 11 cents on Jan 13 at $80.50. The markets will be off on Monday for the Martin Luther King Jr. Day holiday.\nUSDA’s pork carcass cutout value from the Friday morning report was a dime higher at $93.70 per cwt. The loin and belly primals were the only reported higher. USDA estimated federally inspected hog slaughter for Thursday at 492,000 head, with the weekly tally at 1.973 million. That is 7,000 head above last week and 46,901 head above the same week last year.\nFeb 26 Hogs are at $87.900, up $0.100,\nApr 26 Hogs are at $94.925, down $0.075\nMay 26 Hogs are at $98.575, up $0.100,",
        "authors": "None",
        "publish_date": "2026-01-16 18:20:52",
        "published_at_raw": "2026-01-16T18:20:52Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are near unchanged at midday, with nearby contracts a dime on either side. USDA’s national base hog price was not reported on Friday morning due to light volume. The CME Lean Hog Index was back up 11 cents on Jan 13 at $80.50. The ma...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "79a8b9ddc5c652a7432faa29a6883f78",
        "title": "Trump’s USDA Is Hiding the Data on Food Stamp Cuts",
        "doc_url": "https://www.motherjones.com/food/2026/01/trump-rollins-usda-snap-food-insecurity/",
        "all_text": "Get your news from a source that’s not owned and controlled by oligarchs. Sign up for the free Mother Jones Daily.\nOn December 1, under President Trump’s “One Big Beautiful Bill,” the Supplemental Nutrition Assistance Program (SNAP)—which more than 40 million Americans rely on—introduced new work requirements for people verging on retirement age.\nMillions of adults ages of 55 to 64 may now be locked out of the program if they’re not able to work—and in a one-two punch of attacks on federal services, the USDA has terminated its annual food insecurity survey, making it impossible to know just how devastating an impact Trump’s backdoor SNAP cuts will have on aging adults who are unable to get exemptions from their state.\nIn normal conditions, said Tufts University food economist Parke Wilde. policymakers and government workers would ask, “‘What are the consequences of policy changes this fall so that we can calibrate and improve the program in the future?’ We won’t be able to do that this year.”\nTargeted actions to eliminate federal government data have accompanied countless other Trump administration cuts and defundings: An executive order by Trump curtailed the collection of gender and sexuality information in federal surveys, and the Institute of Education Sciences, which disseminates education data, faced mass layoffs last year.\nWhat existing data tells us is that tacking on new SNAP work requirements leads people to lose their benefits. Research from George Washington Unive",
        "authors": "None",
        "publish_date": "2026-01-16 17:21:36",
        "published_at_raw": "2026-01-16T17:21:36Z",
        "meta_site_name": "Mother Jones",
        "description": "The agency’s food insecurity survey was pointless “liberal fodder,” a spokesperson said.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5e5dc7c17b3e16a47f3d846962dd636b",
        "title": "Students: Apply now for the USDA 1890 National Scholars Program offering full tuition, books, room and board",
        "doc_url": "https://www.fox4news.com/news/usda-1890-national-scholars-program",
        "all_text": "Applications are now being accepted for the U.S. Department of Agriculture (USDA) 1890 National Scholars Program.\nThe program provides students full tuition, fees, books, room and board, and a summer internship which could lead to full-time employment with USDA after graduation.\nBig picture view:\nThe scholarship is available to eligible high school seniors entering their first year of college that will attend one of the 1890 land-grant universities to pursue degrees in agriculture, food, natural resource sciences, or related academic disciplines. Rising college sophomores and juniors are also eligible to apply if they meet the same criteria.\nThe backstory:\nThe program is a partnership between USDA and the 19 land-grant institutions, which are Historically Black Colleges and Universities (HBCU) that were established under the Second Morrill Land Grand Act of 1890, which required states to create colleges and universities for Black students.\nUSDA 1890 National Scholars Program partner universities:\nAlabama A&M University\nAlcorn State University, Mississippi\nCentral State University, Ohio\nDelaware State University\nFlorida A&M University\nFort Valley State University, Georgia\nKentucky State University\nLangston University, Oklahoma\nLincoln University, Missouri\nNorth Carolina A&T State University\nPrairie View A&M University, Texas\nSouth Carolina State University\nSouthern University, Louisiana\nTennessee State University\nTuskegee University, Alabama\nUniversity of Arkansas Pine Bluff\nU",
        "authors": "None",
        "publish_date": "2026-01-16 16:55:46",
        "published_at_raw": "2026-01-16T16:55:46Z",
        "meta_site_name": "FOX 4 News",
        "description": "Applications are now being accepted for the U.S. Department of Agriculture (USDA) 1890 National Scholars Program.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8ead3bc0302f2ad6d354826eae9b9848",
        "title": "Hogs Look to Friday Trade After Rallying this Week",
        "doc_url": "https://www.barchart.com/story/news/37082024/hogs-look-to-friday-trade-after-rallying-this-week",
        "all_text": "Lean hog futures were in rally mode on Thursday, with contracts $1.90 to $2.30 higher at the close. Open interesting was up 7,146 contracts on Thursday. USDA’s national base hog price was not reported on Thursday afternoon due to light volume. The CME Lean Hog Index was down 11 cents on Jan 13 at $80.39. The markets will be off on Monday for the Martin Luther King Jr. Day holiday.\nUSDA’s Export Sales data showed pork bookings at 26,826 MT in the week of January 8. Mexico was the largest buyer of 9,200 MT, with 5,200 MT sold to Japan. Shipments were pegged at 40,672 MT. The top destination was Mexico at 21,000 MT, with 4,200 MT.\nUSDA’s pork carcass cutout value from the Thursday afternoon report was $2.31 higher at $93.60 per cwt. The picnic and rib primals were the only reported lower. USDA estimated federally inspected hog slaughter for Thursday at 492,000 head, with the weekly tally at 1.973 million. That is 7,000 head above last week and 46,901 head above the same week last year.\nFeb 26 Hogs closed at $87.800, up $2.100,\nApr 26 Hogs closed at $95.000, up $2.300\nMay 26 Hogs closed at $98.475, up $1.900,",
        "authors": "None",
        "publish_date": "2026-01-16 13:22:38",
        "published_at_raw": "2026-01-16T13:22:38Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were in rally mode on Thursday, with contracts $1.90 to $2.30 higher at the close. Open interesting was up 7,146 contracts on Thursday. USDA’s national base hog price was not reported on Thursday afternoon due to light volume. The CM...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "428d522900f5c910b859f9e6a83c230b",
        "title": "Off Base, Part 1: Reviewing Issues and Problems With Base Acre Policy",
        "doc_url": "https://www.agriculture.com/partners-off-base-part-1-reviewing-issues-and-problems-with-base-acre-policy-11886756",
        "all_text": "By Jonathan Coppess\nThe term “off base” is defined as “not being in agreement with what is true” (Merriam-Webster.com). For farm policy, the term may conjure the base acre design for farm program payments because the payments are decoupled from the planted crop—payments claimed to help manage crop risks are not in agreement with what crop was, in truth, planted and at risk. On Jan. 12, 2026, the USDA’s Farm Service Agency (FSA) published the rule for changes to farm payment programs, including base acres, made by the reconciliation farm bill and has indicated it will prioritize allocating additional base acres to unassigned base acres, which are former upland cotton base acres (91 FR 1043; see also, USDA-FSA, Notice ARCPLC-123). It was also reported that signup for the farm payment programs is likely to be significantly delayed (Farm Policy News, Jan. 12, 2026). These matters refocus attention on the base acre issue. This article initiates a review of base acres and potential concerns or issues with the policy design.\nBackground\nThe farm payment programs Agriculture Risk Coverage (ARC) and Price Loss Coverage (PLC) make payments to farmers on base acres, rather than the acres planted to the crop for which the payment is made. Thus, farmers can receive payments for crops they don’t plant while planting other crops that might provide a better return. It can be a confusing aspect of farm policy design that obscures important realities on the ground. Base acres have been discusse",
        "authors": "None",
        "publish_date": "2026-01-16 12:03:20",
        "published_at_raw": "2026-01-16T12:03:20Z",
        "meta_site_name": "Successful Farming",
        "description": "On Jan. 12, 2026, the USDA’s Farm Service Agency published the rule for changes to farm payment programs, including base acres, made by the reconciliation farm bill and has indicate it will prioritize allocating additional base acres to unassigned base acres, which are former upland cotton base acres. It was also reported that signup for the farm payment programs is likely to be significantly delayed. This article initiates a review of base acres and potential concerns or issues with the policy design.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ad35aa202c53403e057ef24cf9469578",
        "title": "Feds, visiting Farm Show, blame states’ errors for Trump SNAP cuts",
        "doc_url": "https://www.pennlive.com/news/2026/01/feds-visiting-farm-show-blame-states-errors-for-trump-snap-cuts.html",
        "all_text": "This article has been updated to correct the total federal budget deficit increase to $3.4 trillion.\nFederal officials visited the Farm Show on Thursday to extol their support for Pennsylvania-made foods — but if your food benefits get cut, that’s someone else’s fault.\nBrooke Rollins — the Secretary for the United States Department of Agriculture (USDA) in President Donald Trump’s cabinet — came to Harrisburg just as Pennsylvania and other states are starting to feel the impact of funding cuts to the Supplemental Nutrition Assistance Program (SNAP), enacted as part of Trump’s “One Big, Beautiful Bill” budget deal that was signed in July of last year.\nAsked about the looming changes, Rollins referenced a proposed ruling from her agency that would require stores that accept SNAP — colloquially known as food stamps — to stock more healthy foods, while not providing them with funding to do this.\nTrump’s budget bill stripped $187 billion from SNAP, according to estimates by the Congressional Joint Committee on Taxation, although the revenue lost from tax cuts means the bill will hike the deficit by about $3.4 trillion over a decade. The bill is also anticipated to increase farm subsidies by about $59 billion over ten years with incremental increases in crop-loss insurance and price guarantees.\n“Those with the least among us [will] have the same opportunities to buy healthy food with the money through the SNAP program. So there’s some real changes in SNAP. The fraud is really remar",
        "authors": "None",
        "publish_date": "2026-01-16 03:40:12",
        "published_at_raw": "2026-01-16T03:40:12Z",
        "meta_site_name": "Mechanicsburg Patriot News ",
        "description": "USDA Secretary Brooke Rollins visited the Farm Show Thursday alongside several other Republican officials.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]