[
    {
        "id": "eddcb76ded5a74dac7b575145edcb4e3",
        "title": "Bakers’ delight after record wheat harvest in southern hemisphere",
        "doc_url": "https://www.thetimes.com/uk/environment/article/bakers-delight-record-wheat-harvest-wvqfmmgfg",
        "all_text": "“National winter crop production has been revised higher,” the Australian Bureau of Agricultural and Resource Economics and Sciences said. The agency added that this was due to ­timely spring rainfall at critical growth stages and mild spring temperatures in most cropping regions.\nRichie Kelly, a farmer in the Swan Hill area of Victoria, Australia, told the Weekly Times: “We had a good start to the season and a dry finish, but it was cool, and the crops matured well. They have yielded surprisingly better than many people expected.”\nAustralia’s wheat production is now set to be 4 per cent above last year’s 34.1 million tonnes, 29 per cent above the 10-year average and the third-largest for any season on record.\nHowever, the good news for global supply comes despite British farmers experiencing one of their worst harvests on record this year following months of drought.\nFigures from the Department for ­Environment, Food and Rural Affairs showed that the wheat harvest in the UK was 11.8 million tonnes this year, an increase of 7.3 per cent on last year’s record low but 8.4 per cent below the ten-year average.\nThree of the five worst harvests on record in Britain have now occurred since 2020.\nHarry Metcalfe, a Cotswolds farmer who runs the Harry’s Farm YouTube channel, said grain was now an international commodity whose price was determined by the global market.\n“Grain price isn’t linked to cost of production any more, it’s more a sentiment. Once you go fully over to an internati",
        "authors": "None",
        "publish_date": "2025-12-14 22:05:23",
        "published_at_raw": "2025-12-14T22:05:23Z",
        "meta_site_name": "The Sunday Times",
        "description": "International grain markets will keep prices low as there is an abundant global supply, but UK farmers are looking at alternative crops",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "50e4cad42e3fbb54caf80985fff3d0bb",
        "title": "Over 60,000 Pounds of Chicken Recalled Nationwide",
        "doc_url": "https://www.mensjournal.com/food/over-60000-pounds-of-chicken-recalled-nationwide",
        "all_text": "A Georgia-based company has recalled over 60,000 pounds of chicken distributed to restaurants nationwide due to an undeclared allergen, the United States Department of Agriculture’s Food Safety and Inspection Service (FSIS) announced Friday.\nSuzanna’s Kitchen, from Suwanee, Georgia, issued a recall on approximately 62,550 pounds of fully cooked, bone-in breaded chicken products because they contain soy, a known allergen, that is not listed on the product label.\nWhat to know\nSoy allergies are known to cause symptoms ranging from mild (hives, itching, swelling, abdominal pain and nausea) to anaphylaxis, a severe and life-threatening allergic reaction.\nAccording to the FSIS notice, the 8-piece Suzanna’s Kitchen bone-in breaded chicken products were sold to restaurants in “18-lb. cases containing four units of “FULLY COOKED BREADED CHICKEN PORTIONS.” The cases had the code “P-1380 126237 B30851 23:11 K04” printed on the side.\n“The product subject to recall bears the USDA mark of inspection on the case’s label and establishment number “P-1380” printed on the side of the package. These items were shipped to restaurant locations nationwide,” the FSIS said.\n“The problem was discovered when the company notified FSIS that they had identified chicken product containing soy that had been mislabeled with a non-allergen containing product code.”\nFortunately, there have been no confirmed reports of illness or injury as a result of the consumption of the product covered under this recall.\nWh",
        "authors": "None",
        "publish_date": "2025-12-14 21:47:44",
        "published_at_raw": "2025-12-14T21:47:44Z",
        "meta_site_name": "Men's Journal",
        "description": "The affected product may still in restaurant refrigerators and freezers, according to the USDA.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c695a37963915fc98438333d5f28db8f",
        "title": "How to keep bad bugs from hitchhiking on holiday decorations",
        "doc_url": "https://www.bangordailynews.com/2025/12/14/homestead/homestead-environment/stop-bad-bugs-holiday-decorations-joam40zk0w/",
        "all_text": "This was originally published on Nov. 30, 2024.\nNo one appreciates uninvited guests who crash holiday celebrations.\nIt’s annoying enough when it’s distant friends or relatives. But when it comes to what may be lurking in your festive decorations, it can be a disaster for native ecosystems.\nThat’s why the Maine Department of Agriculture, Conservation and Forestry is stressing to Christmas tree growers and wreath-makers the importance of preventing the movement of pests into and out of Maine on holiday decorations that contain plant material.\n“Invasive insects, diseases and plants can easily be moved long distances on Christmas trees and wreaths,” said Gary Fish, state horticulturist with Maine DACF. “All of these pests can end up emerging on old wreaths or trees that are left out in the yard after the holidays.”\nBranches and leaves from boxwood is a popular wreath material, especially for people who want the decoration to last beyond the holiday season. This year Maine DACF says it’s more important than ever to know the source of any boxwood greenery because it could contain box tree moths.\nThe moth is a new invasive that was first found two years ago in New York. It’s hard to detect and the caterpillars can kill the plant by rapidly stripping its leaves and girdling its stems.\nIn Maine, the winter-hardy boxwoods are popular landscaping plants, including in hedges.\nBox tree moths overwinter as small caterpillars in a structure called a hibernaculum, which is made of a few leav",
        "authors": "None",
        "publish_date": "2025-12-14 06:00:00",
        "published_at_raw": "2025-12-14T06:00:00Z",
        "meta_site_name": "Bangor Daily News",
        "description": "What may be lurking in your festive decorations can be a disaster for native ecosystems. That's why the USDA says to be vigilant.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]