[
    {
        "id": "8c55bc068c262c35a1eb99a7ae1fcbbe",
        "title": "The breaking point: American farms are in crisis",
        "doc_url": "https://www.naturalnews.com/2026-01-10-the-breaking-point-american-farms-in-crisis.html",
        "all_text": "A prominent Georgia farmer has cut 45% of his leased acreage due to unsustainable input costs and low commodity prices.\nEconomists warn of a severe cost-price squeeze, with projected negative profits per acre for major crops like corn and soybeans.\nInput costs for items like fertilizer, seed and machinery remain near record highs while crop revenues have fallen sharply.\nThe financial strain is leading to increased farm exits, bankruptcies and warnings of unplanted cropland in 2026.\nPolicy safety net improvements are not set to take effect until late 2026, leaving farmers to navigate a deepening crisis.\nIn the heart of Georgia's prime agricultural belt, a generational grower's drastic decision to abandon nearly half his farmland has become a stark symbol of a deepening national crisis. Interviewed by Farm Journal, Alex Harrell, a record-setting soybean producer, shared how just a few months ago, he notified a dozen landlords that he was dropping his lease on their acreage—3,000 acres of his 6,000-acre operation. This move, driven by a brutal combination of skyrocketing production expenses and collapsing commodity prices, signals an alarming inflection point for American agriculture. As farmers from the Southeast to the Mid-Atlantic grapple with the same economic vise, warnings grow of significant unplanted acreage in the coming year, threatening the stability of the nation's food production system.\nThe unbearable math of modern farming\nHarrell’s choice was not impulsive but th",
        "authors": "None",
        "publish_date": "2026-01-10 05:25:15",
        "published_at_raw": "2026-01-10T05:25:15Z",
        "meta_site_name": "Natural News",
        "description": "A prominent Georgia farmer has cut 45% of his leased acreage due to unsustainable input costs and low commodity prices. Economists warn of a severe cost-price squeeze, with projected negative profits per acre for major crops like corn and soybeans. Input costs for items like fertilizer, seed and machinery remain near record highs while crop […]",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "886b86af8617c0e2ad0ce9f8b00822ca",
        "title": "USDA Suspends All Payments To Minnesota's Food Programs Over Suspected Fraud",
        "doc_url": "https://www.zerohedge.com/political/usda-suspends-all-payments-minnesotas-food-programs-over-suspected-fraud",
        "all_text": "Authored by Jill McLaughlin via The Epoch Times,\nThe U.S. Department of Agriculture (USDA) suspended payments for all federal food programs in Minnesota and Minneapolis Friday over alleged fraud and abuse of federal funds statewide.\n“Enough is enough!” USDA Secretary Brooke Rollins posted on X, announcing the suspension. “The Trump administration has uncovered massive fraud in Minnesota and Minneapolis—billions siphoned off by fraudsters. And those in charge have zero plan to fix it.”\nThe agency plans to suspend all payments of federal financial awards to the state and city—totalling about $130 million—until state and local officials provide documentation detailing expenditures and transactions for the past year, Rollins said.\nMore than 440,000 people—about one in 13 residents—receive monthly assistance from the federally funded Supplemental Nutrition Assistance Program (SNAP), according to the Minnesota Department of Children, Youth, and Families.\nSNAP uses around three-fourths of the federal funding for food-related programs and about 7 percent of all federal funding for the state, the agency reported.\nIn all, Minnesota received an estimated $2.05 billion in federal funds for 52 food-related programs in 2025, according to the state. The top five programs were SNAP; Women, Infants, and Children Supplemental Nutrition Program (WIC); school lunches; school breakfasts; and the child and adult care food program.\nAccording to Rollins, Gov. Tim Walz’s administration did not provid",
        "authors": "None",
        "publish_date": "2026-01-10 19:00:00",
        "published_at_raw": "2026-01-10T19:00:00Z",
        "meta_site_name": "ZeroHedge",
        "description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "58196fbf6697884dd6987048c6a0e3b3",
        "title": "Why Trump administration cancelled SNAP funding in Minnesota? Impact explained",
        "doc_url": "https://www.financialexpress.com/world-news/us-news/why-trump-administration-cancelled-snap-funding-in-minnesota-impact-explained/4103369/",
        "all_text": "Trump administration has stopped federal funding for SNAP and other US Department of Agriculture programs in Minnesota after what officials describe as serious and repeated failures to stop fraud.\nUS Agriculture Secretary Brooke Rollins informed Minnesota Governor Tim Walz that all active and future USDA awards to the state and the City of Minneapolis are being suspended. The total amount affected is more than $129 million.\n“I am notifying you that, effective immediately, I am suspending payments on all active awards and any future awards from USDA to the State of Minnesota and the City of Minneapolis, currently totaling over $129.18 million,” Rollins wrote in the letter.\nThe fraud cases behind the decision\nFederal investigators first released large-scale welfare fraud in Minnesota in 2022 through the Feeding Our Future case, a scheme estimated to have taken about $250 million in taxpayer money. Rollins said 78 people have been charged so far.\nMore concerns followed. In mid-December, First Assistant US Attorney Joe Thompson said that $9 billion or more in federal funds given to 14 state-run programs since 2018 may have been stolen. According to Rollins, Minnesota failed to take basic steps to prevent fraud even after these revelations.\n“Despite a staggering, wide-reaching fraud scandal, your Administrations refuse to provide basic information or take common sense measures to stop fraud,” she wrote.\nDispute over SNAP checks and recertification\nThe blocked funding includes the ",
        "authors": "None",
        "publish_date": "2026-01-10 17:32:06",
        "published_at_raw": "2026-01-10T17:32:06Z",
        "meta_site_name": "The Financial Express",
        "description": "Trump administration suspends SNAP funding in Minnesota after major fraud allegations, impacting thousands of beneficiaries, as USDA demands accountability and tighter oversight from state leaders.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0231937791a405a1f857d0b2d0c6d8d0",
        "title": "Focus for the New Year: Health Ranger Store’s COGNITIVE WELLNESS offers are happening now",
        "doc_url": "https://www.naturalnews.com/2026-01-10-health-ranger-stores-cognitive-wellness-offers-happening-now.html",
        "all_text": "Prioritize whole, organic, non-GMO foods like wild-caught fish, leafy greens and berries to support optimal cognitive health.\nLook for certifications (such as USDA Organic, NSF-sealed, etc.) and avoid synthetic additives to ensure that your food and supplements are free of toxins.\nTry beneficial superfoods like ashwagandha and lion's mane mushroom and B-vitamins to support optimal neurological health.\nChoose nutrient-dense snacks, superfood powders or starter kits with probiotics to support overall well-being over processed junk food.\nFocus on long-term, intentional living by integrating toxin-free staples and good habits into your daily life, paired with products from the Health Ranger Store New Year’s Resolutions Sale.\nAs the days pass by, you may already find yourself struggling to keep your New Year's resolutions, especially when it comes to health goals. Between busy schedules, misleading marketing and the allure of convenience foods, staying on track often feels like an uphill battle.\nBut 2026 is a fresh start to prioritize real wellness, not just quick fixes.\nThe foundation of sustained health lies in clean nutrition, strategic supplementation and intentional shopping.\nFor health-conscious individuals and families, the Health Ranger Store offers a curated guide to make 2026 a year of thriving by focusing on cognitive wellness through nutrient-dense foods and supplements that honor the body's natural design. With limited-time New Year's Resolution Sale offers, now is th",
        "authors": "None",
        "publish_date": "2026-01-10 17:10:52",
        "published_at_raw": "2026-01-10T17:10:52Z",
        "meta_site_name": "Natural News",
        "description": "Prioritize whole, organic, non-GMO foods like wild-caught fish, leafy greens and berries to support optimal cognitive health. Look for certifications (such as USDA Organic, NSF-sealed, etc.) and avoid synthetic additives to ensure that your food and supplements are free of toxins. Try beneficial superfoods like ashwagandha and lion’s mane mushroom and B-vitamins to support optimal […]",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "73bfa30c7bc07ce94dfe5cec970ba1c3",
        "title": "Trump administration suspends $129m in benefit payments to Minnesota",
        "doc_url": "https://www.theguardian.com/us-news/2026/jan/10/trump-administration-suspends-129m-benefit-payments-minnesota",
        "all_text": "The Trump administration announced it is suspending $129m in federal benefit payments to Minnesota amid allegations of widespread fraud in the state.\nThe secretary of the US Department of Agriculture (USDA), Brooke Rollins, shared a letter on Friday on social media that was addressed to Minnesota’s governor, Tim Walz, and the mayor of Minneapolis, Jacob Frey, notifying them of the administration’s decision and citing investigations into alleged fraud conducted by local non-profits and businesses.\n“Despite a staggering, wide-reaching fraud scandal, your administrations refuse to provide basic information or take common sense measures to stop fraud. The Trump administration refuses to allow such fraud to continue,” Rollins wrote.\nRollins asked Walz and Frey to provide the USDA with justification for all federal spending from 20 January 2025 to the present within 30 days. She is also requiring that all federal payments to the state moving forward require the same justification.\n“We’re communicating with state partners to understand the impacts of such a blanket cut to funding meant for residents most in need,” Brian Feintech, a spokesperson for the city of Minneapolis, said in a written statement in response to Rollins’s letter.\n“What’s abundantly clear is that Minneapolis is the latest target of the Trump administration – willing to harm Americans in service to its perceived political gain.”\nThe Guardian has contacted Walz’s office for comment.\nMinnesota’s attorney general, Kei",
        "authors": "None",
        "publish_date": "2026-01-10 17:04:00",
        "published_at_raw": "2026-01-10T17:04:00Z",
        "meta_site_name": "The Guardian",
        "description": "USDA notified state’s governor of decision, citing inquiries into alleged fraud by local non-profits and businesses",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b25b7869c6219dac1cfea53ae8e6b686",
        "title": "Dry January with abundant geopolitical heat",
        "doc_url": "https://www.barchart.com/story/news/36982173/dry-january-with-abundant-geopolitical-heat",
        "all_text": "Howdy market watchers!\nWhen you step outside, it’d be hard to know it’s January with these unseasonably warm temperatures, severe storm and tornado risks and threats of hail. We are thankful for the rain where it was received although limited and unpredicted for many. Drought is returning and deepening in many parts of the Midwest, Southeast and Southern Plains although it is still early for winter crops as well as ahead of spring/summer crop planting.\nHowever, every week ahead is going to be that much closer to critical moisture being necessary. The good news is that we are beginning to see signs of a wetter spring although that can complicate planting. Having said that, we can always do more with moisture than without, but timing is important.\nIt was a busy week of headlines and data beginning with the surprise weekend news of Venezuela President Maduro’s capture in a US military operation. By the end of the week, President Trump had assembled executives of the largest US oil companies at the White House to discuss their re-entry into the oil fields of Venezuela that they were previously forced out of when nationalized. This historic action and the subsequent discussions around the US “running” the country through Maduro’s existing regime seems like fiction but is actively playing out.\nWith the world’s largest untapped oil reserves, Venezuela is strategic for so many reasons. The initial expectation was that crude oil prices would drop dramatically on last Sunday nights ene",
        "authors": "None",
        "publish_date": "2026-01-10 15:53:36",
        "published_at_raw": "2026-01-10T15:53:36Z",
        "meta_site_name": "Barchart",
        "description": "USDA Reports at 11 AM on Monday",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e7b2fb96b9449d7d93c31c8842188557",
        "title": "Dry January with abundant geopolitical heat",
        "doc_url": "https://www.barchart.com/story/news/36982174/dry-january-with-abundant-geopolitical-heat",
        "all_text": "Howdy market watchers!\nWhen you step outside, it’d be hard to know it’s January with these unseasonably warm temperatures, severe storm and tornado risks and threats of hail. We are thankful for the rain where it was received although limited and unpredicted for many. Drought is returning and deepening in many parts of the Midwest, Southeast and Southern Plains although it is still early for winter crops as well as ahead of spring/summer crop planting.\nHowever, every week ahead is going to be that much closer to critical moisture being necessary. The good news is that we are beginning to see signs of a wetter spring although that can complicate planting. Having said that, we can always do more with moisture than without, but timing is important.\nIt was a busy week of headlines and data beginning with the surprise weekend news of Venezuela President Maduro’s capture in a US military operation. By the end of the week, President Trump had assembled executives of the largest US oil companies at the White House to discuss their re-entry into the oil fields of Venezuela that they were previously forced out of when nationalized. This historic action and the subsequent discussions around the US “running” the country through Maduro’s existing regime seems like fiction but is actively playing out.\nWith the world’s largest untapped oil reserves, Venezuela is strategic for so many reasons. The initial expectation was that crude oil prices would drop dramatically on last Sunday nights ene",
        "authors": "None",
        "publish_date": "2026-01-10 15:53:36",
        "published_at_raw": "2026-01-10T15:53:36Z",
        "meta_site_name": "Barchart",
        "description": "USDA Reports at 11 AM on Monday",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "eb693f44da94569ac2b421b5891821b6",
        "title": "Trump Officials Suspend SNAP For Thousands In Minnesota: What To Know",
        "doc_url": "https://www.newsweek.com/trump-officials-suspend-snap-for-thousands-in-minnesota-what-to-know-11339665",
        "all_text": "The Trump administration has suspended federal funding for SNAP benefits and other U.S. Department of Agriculture awards in Minnesota following a widespread fraud scandal.\nAgriculture secretary Brooke Rollins said in a letter to Minnesota Governor Tim Walz that she would halt $129 million in department funding, pointing to ongoing investigations into alleged fraud in the state’s social safety net.\n\"I am notifying you that, effective immediately, I am suspending payments on all active awards and any future awards from USDA to the State of Minnesota and the City of Minneapolis, currently totaling over $129.18 million,\" Rollins wrote in the letter, which was posted in full on X, formerly Twitter, on Friday.\nNewsweek has contacted the USDA and Walz's office via email outside of regular working hours.\nWhy It Matters\nSupplemental Nutrition Assistance Program (SNAP) benefits are distributed to around 453,900 people in Minnesota, or 8 percent of the state's population.\nFederal authorities first found large-scale welfare fraud in Minnesota in 2022 through the Feeding Our Future case, a scheme estimated to have siphoned off about $250 million in taxpayer funds.\nRollins said in her letter that 78 people have been charged to date. Since then, further allegations have emerged. In mid-December, First Assistant U.S. Attorney Joe Thompson said that $9 billion or more in federal money distributed to 14 state-run programs since 2018 may have been stolen.\nWhat To Know\nThe blocked funding includ",
        "authors": "None",
        "publish_date": "2026-01-10 11:22:45",
        "published_at_raw": "2026-01-10T11:22:45Z",
        "meta_site_name": "Newsweek",
        "description": "The USDA said in a letter to Minnesota Governor Tim Walz that it would halt $129 million in department funding.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "abd4bd7f91a1ca15e5fc3a7756073c9c",
        "title": "USDA Stops Minnesota's 'Handouts to Thieves' over Fraud Allegations: 'Enough Is Enough!'",
        "doc_url": "https://www.breitbart.com/politics/2026/01/10/secretary-rollins-usda-stops-minnesotas-handouts-to-thieves-over-fraud-allegations-enough-is-enough/",
        "all_text": "U.S. Secretary of Agriculture Brooke Rollins warned Minnesota’s Democrat leaders on Friday their “handouts to thieves” are at an end, her announcement coming amid news about rampant fraud in the state.\nIn a social media post, Rollins said President Donald Trump’s administration uncovered massive fraud in Minnesota and Minneapolis which resulted in billions of dollars being “siphoned off by fraudsters.”\nShe wrote:\nEnough is enough! The Trump administration has uncovered MASSIVE fraud in Minnesota and Minneapolis—billions siphoned off by fraudsters. And those in charge have ZERO plan to fix it.\nToday, @USDA is SUSPENDING FEDERAL FINANCIAL AWARDS to Minnesota and Minneapolis, effective immediately, until sufficient proof has been provided that the fraud has stopped. No more handouts to thieves! Time to drain the Minnesota swamp and put American taxpayers first.\nIn her letter to Gov. Tim Walz (D) and Mayor Jacob Frey (D), Rollins said, “The widespread and systemic fraud associated with federal benefit programs in the State of Minnesota and the City of Minneapolis demonstrate an inability to handle federal resources without additional oversight and accountability measures in place.”\nShe also mentioned the $250 million “Feeding Our Future” scheme and alleged scams involving the Small Business Administration Paycheck Protection Program and daycare centers.\n“While the full extent of fraud in Minnesota is not yet known, it is clear that, under your leadership — or lack thereof — fraud",
        "authors": "None",
        "publish_date": "2026-01-10 08:02:09",
        "published_at_raw": "2026-01-10T08:02:09Z",
        "meta_site_name": "Breitbart News Network",
        "description": "U.S. Secretary of Agriculture Brooke Rollins warned Minnesota's Democrat leaders their \"handouts to thieves\" are at an end.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a4a65288288e7f2af1473dc1322d6d99",
        "title": "USDA Stops Minnesota's 'Handouts to Thieves' over Fraud Allegations: 'Enough Is Enough!'",
        "doc_url": "https://www.breitbart.com/crime/2026/01/10/secretary-rollins-usda-stops-minnesotas-handouts-to-thieves-over-fraud-allegations-enough-is-enough/",
        "all_text": "U.S. Secretary of Agriculture Brooke Rollins warned Minnesota’s Democrat leaders on Friday their “handouts to thieves” are at an end, her announcement coming amid news about rampant fraud in the state.\nIn a social media post, Rollins said President Donald Trump’s administration uncovered massive fraud in Minnesota and Minneapolis which resulted in billions of dollars being “siphoned off by fraudsters.”\nShe wrote:\nEnough is enough! The Trump administration has uncovered MASSIVE fraud in Minnesota and Minneapolis—billions siphoned off by fraudsters. And those in charge have ZERO plan to fix it.\nToday, @USDA is SUSPENDING FEDERAL FINANCIAL AWARDS to Minnesota and Minneapolis, effective immediately, until sufficient proof has been provided that the fraud has stopped. No more handouts to thieves! Time to drain the Minnesota swamp and put American taxpayers first.\nIn her letter to Gov. Tim Walz (D) and Mayor Jacob Frey (D), Rollins said, “The widespread and systemic fraud associated with federal benefit programs in the State of Minnesota and the City of Minneapolis demonstrate an inability to handle federal resources without additional oversight and accountability measures in place.”\nShe also mentioned the $250 million “Feeding Our Future” scheme and alleged scams involving the Small Business Administration Paycheck Protection Program and daycare centers.\n“While the full extent of fraud in Minnesota is not yet known, it is clear that, under your leadership — or lack thereof — fraud",
        "authors": "None",
        "publish_date": "2026-01-10 08:02:09",
        "published_at_raw": "2026-01-10T08:02:09Z",
        "meta_site_name": "Breitbart News Network",
        "description": "U.S. Secretary of Agriculture Brooke Rollins warned Minnesota's Democrat leaders their \"handouts to thieves\" are at an end.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "43092868776d1a0a81c936ac07eaad35",
        "title": "USDA suspends nearly $130 million in federal funds to Minnesota over fraud concerns",
        "doc_url": "https://nypost.com/2026/01/09/us-news/usda-suspends-nearly-130-million-in-federal-funds-to-minnesota-over-fraud-concerns/",
        "all_text": "The US Department of Agriculture (USDA) will suspend nearly $130 million in financial awards to the state of Minnesota and city of Minneapolis over “widespread and systemic fraud,” USDA Secretary Brooke Rollins announced Friday.\n“Enough is enough!” Rollins wrote on X, sharing a letter sent to Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey. “The Trump administration has uncovered MASSIVE fraud in Minnesota and Minneapolis — billions siphoned off by fraudsters.\n“And those in charge have ZERO plan to fix it.”\nRollins’ letter references the $250 million Feeding Our Future scandal, which saw dozens of fraudsters pilfer pandemic-era funds meant to feed children from low-income families.\n“This fraud scheme involved USDA funding provided to the State of Minnesota to feed hungry children under the Child and Adult Care Food Program (CACFP) and the Summer Food Service Program (SFSP),” the USDA secretary noted. “As of late November, 78 defendants had been charged in what the Department of Justice characterized as the largest COVID-19 fraud scheme in the country.”\nRollins accused Walz and Frey of refusing to take accountability for the Feeding Our Future and other fraud scandals, and slammed them for “claiming that criticism of rampant fraud and abuse is ‘racist.’”\nThe USDA secretary informed the Democratic leaders that all active and future awards to the state and city – totaling more than $129 million – would be suspended “effective immediately.”\nRollins also demanded that Wal",
        "authors": "None",
        "publish_date": "2026-01-10 04:47:35",
        "published_at_raw": "2026-01-10T04:47:35Z",
        "meta_site_name": "New York Post",
        "description": "The US Department of Agriculture (USDA) will suspend nearly $130 million in financial awards to the state of Minnesota and city of Minneapolis over “widespread and systemic fraud,” USDA Secretary Brooke Rollins announced Friday.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d4149b277105d836c5cc2ac302f8ae37",
        "title": "Over $120M in USDA award payments to MN suspended, Sec. Rollins says",
        "doc_url": "https://www.newsbreak.com/cbs-minnesota-500222/4434294783804-over-120m-in-usda-award-payments-to-mn-suspended-sec-rollins-says",
        "all_text": "U.S. Agriculture Secretary Brooke Rollins said on Friday that she is suspending payments on all active and future awards from the USDA to Minnesota amid the long-running fraud scandal in which the White House has alleged a misuse of federal funds.\nIn a letter addressed to Gov. Tim Walz and Minneapolis Mayor Jacob Frey, Rollins said the suspended payments, as of Friday evening, total just over $129 million.\nAs reasons for her suspension, she highlighted the alleged fraud schemes involving the nonprofit group Feeding Our Future, Minnesota's Housing Stabilization Services program, and claims of fraud at daycare centers around the state.\n\"Despite a staggering, wide-reaching fraud scandal, your Administrations refuse to provide basic information or take common sense measures to stop fraud,\" Rollins said in the letter, which she posted on social media.\nShe asked Walz and Frey to provide her agency with justification for all federal spending to the state from Jan. 20 of last year \"to the present\" within 30 days, and said that payments moving forward will \"require such payment justification.\"\nIn a reply to Rollins' post, Minnesota Attorney General Keith Ellison said on social media, \"I will not allow you to take from Minnesotans in need. I'll see you in court.\"\n\"We're communicating with State partners to understand the impacts of such a blanket cut to funding meant for residents most in need,\" the City of Minneapolis said in a statement. \"What's abundantly clear is that Minneapolis i",
        "authors": "None",
        "publish_date": "2026-01-10 03:52:00",
        "published_at_raw": "2026-01-10T03:52:00Z",
        "meta_site_name": "NewsBreak",
        "description": "U.S. Agriculture Secretary Brooke Rollins said on Friday that she is suspending payments on all active and future awards from the USDA to Minnesota amid th",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f715f9f060d867497ba39050b4077024",
        "title": "Over $120 million in USDA award payments to Minnesota suspended, Sec. Rollins says",
        "doc_url": "https://www.cbsnews.com/minnesota/news/award-payments-usda-suspended-minnesota-secretary-brooke-rollins/",
        "all_text": "U.S. Agriculture Secretary Brooke Rollins said on Friday that she is suspending payments on all active and future awards from the USDA to Minnesota amid the long-running fraud scandal in which the White House has alleged a misuse of federal funds.\nIn a letter addressed to Gov. Tim Walz and Minneapolis Mayor Jacob Frey, Rollins said the suspended payments, as of Friday evening, total just over $129 million.\nAs reasons for her suspension, she highlighted the alleged fraud schemes involving the nonprofit group Feeding Our Future, Minnesota's Housing Stabilization Services program, and claims of fraud at daycare centers around the state.\n\"Despite a staggering, wide-reaching fraud scandal, your Administrations refuse to provide basic information or take common sense measures to stop fraud,\" Rollins said in the letter, which she posted on social media.\nShe asked Walz and Frey to provide her agency with justification for all federal spending to the state from Jan. 20 of last year \"to the present\" within 30 days, and said that payments moving forward will \"require such payment justification.\"\nIn a reply to Rollins' post, Minnesota Attorney General Keith Ellison said on social media, \"I will not allow you to take from Minnesotans in need. I'll see you in court.\"\n\"We're communicating with State partners to understand the impacts of such a blanket cut to funding meant for residents most in need,\" the City of Minneapolis said in a statement. \"What's abundantly clear is that Minneapolis i",
        "authors": "None",
        "publish_date": "2026-01-10 03:52:00",
        "published_at_raw": "2026-01-10T03:52:00Z",
        "meta_site_name": "CBS News",
        "description": "U.S. Agriculture Secretary Brooke Rollins said on Friday that she is suspending payments on all active and future awards from the USDA to Minnesota amid the long-running fraud scandal in which the White House has alleged a misuse of federal funds.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "16eb9ec430434561fe5ae973d70293da",
        "title": "USDA cuts funding for Minnesota amid fraud allegations: How will it impact SNAP and who will be affected?",
        "doc_url": "https://www.hindustantimes.com/world-news/us-news/usda-cuts-funding-for-minnesota-amid-fraud-allegations-how-will-it-impact-snap-and-who-will-be-affected-101768010536834.html",
        "all_text": "She also directed Minnesota officials to submit detailed payment justifications for all federal expenditures from January 20, 2025, to the present, within 30 days.\nFraud claims and federal investigations\nRollins said in a social media post that the Trump administration had “uncovered massive fraud” and accused those in charge of having “ZERO plan to fix it.” In her letter, she alleged that “numerous non-profits and businesses” had defrauded the federal government during the current state and city leadership.\nAlso Read: Tim Walz’s daughter defends father amid Minnesota fraud row, explains why he dropped out of 2026 race\nThe USDA action cites the Feeding Our Future case, a major fraud scheme uncovered in 2022.\nProsecutors said millions of dollars were stolen from a federal child nutrition programme set up during the Covid-19 pandemic. The Justice Department has described it as the largest Covid-related fraud scheme in US history.\nWalz has previously said he was “furious” that criminals exploited a programme meant to feed children.\nFederal scrutiny has since widened.\nHomeland Security Secretary Kristi Noem said ICE agents are conducting a “massive investigation” into alleged childcare and social services fraud in Minnesota. Treasury Secretary Scott Bessent also announced new measures aimed at curbing government benefits fraud in the state.\nWill SNAP benefits be affected?\nThe USDA has not specified which programmes will be impacted by the funding suspension, leaving questions abo",
        "authors": "None",
        "publish_date": "2026-01-10 02:22:44",
        "published_at_raw": "2026-01-10T02:22:44Z",
        "meta_site_name": "Hindustan Times",
        "description": "The USDA has suspended over $129 million in federal awards to Minnesota and Minneapolis due to widespread fraud.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c039a537750f2d33d0025613d47617c7",
        "title": "'Enough is enough!' USDA suspends federal financial awards to Minnesota and Minneapolis",
        "doc_url": "https://foxbaltimore.com/news/nation-world/enough-is-enough-usda-suspends-federal-financial-awards-to-minnesota-and-minneapolis-fraud-scheme-investigation-governor-tim-walz-mayor-jacob-frey-nick-shirley-feeding-our-children-food-programs",
        "all_text": "The U.S. Department of Agriculture (USDA) on Friday announced that the agency suspended federal financial awards to Minnesota and Minneapolis \"effective immediately.\"\n\"Enough is enough! The Trump administration has uncovered massive fraud in Minnesota and Minneapolis -- billions siphoned off by fraudsters. And those in charge have ZERO plan to fix it,\" Agriculture Secretary Brooke Rollins wrote on X.\n\"Today, @USDA is suspending federal financial awards to Minnesota and Minneapolis, effective immediately, until sufficient proof has been provided that the fraud has stopped. No more handouts to thieves! Time to drain the Minnesota swamp and put American taxpayers first,\" she added.\nRollins tagged Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey in her social media post. It also included a document that informed Walz and Frey of the new development.\n\"During your tenure as Governor of Minnesota and Mayor of Minneapolis, numerous nonprofits and businesses have defrauded the federal government in what a federal prosecutor in Minnesota called 'a staggering, industrial-scale fraud,\" she wrote in the document.\n\"Most notably, a Minneapolis-based nonprofit -- Feeding Our Future -- defrauded U.S. taxpayers of nearly $250 million in federal funds given to then by the Minnesota Department of Education,\" she added. \"This fraud scheme involved USDA funding provided to the State of Minnesota to feed hungry children under the Child and Adult Care Food Program (CACFP) and the Summer Food",
        "authors": "None",
        "publish_date": "2026-01-10 00:20:37",
        "published_at_raw": "2026-01-10T00:20:37Z",
        "meta_site_name": "Baltimore News",
        "description": "The USDA announced that the agency suspended federal financial awards to Minnesota and Minneapolis \"effective immediately.\"",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6fea0d6dfdff706303ef760fbb2ac73b",
        "title": "'Enough is enough!' USDA suspends federal financial awards to Minnesota and Minneapolis",
        "doc_url": "https://wjla.com/news/nation-world/enough-is-enough-usda-suspends-federal-financial-awards-to-minnesota-and-minneapolis-fraud-scheme-investigation-governor-tim-walz-mayor-jacob-frey-nick-shirley-feeding-our-children-food-programs",
        "all_text": "The U.S. Department of Agriculture (USDA) on Friday announced that the agency suspended federal financial awards to Minnesota and Minneapolis \"effective immediately.\"\n\"Enough is enough! The Trump administration has uncovered massive fraud in Minnesota and Minneapolis -- billions siphoned off by fraudsters. And those in charge have ZERO plan to fix it,\" Agriculture Secretary Brooke Rollins wrote on X.\n\"Today, @USDA is suspending federal financial awards to Minnesota and Minneapolis, effective immediately, until sufficient proof has been provided that the fraud has stopped. No more handouts to thieves! Time to drain the Minnesota swamp and put American taxpayers first,\" she added.\nRollins tagged Minnesota Gov. Tim Walz and Minneapolis Mayor Jacob Frey in her social media post. It also included a document that informed Walz and Frey of the new development.\n\"During your tenure as Governor of Minnesota and Mayor of Minneapolis, numerous nonprofits and businesses have defrauded the federal government in what a federal prosecutor in Minnesota called 'a staggering, industrial-scale fraud,\" she wrote in the document.\n\"Most notably, a Minneapolis-based nonprofit -- Feeding Our Future -- defrauded U.S. taxpayers of nearly $250 million in federal funds given to then by the Minnesota Department of Education,\" she added. \"This fraud scheme involved USDA funding provided to the State of Minnesota to feed hungry children under the Child and Adult Care Food Program (CACFP) and the Summer Food",
        "authors": "None",
        "publish_date": "2026-01-10 00:20:37",
        "published_at_raw": "2026-01-10T00:20:37Z",
        "meta_site_name": "WJLA",
        "description": "The USDA announced that the agency suspended federal financial awards to Minnesota and Minneapolis \"effective immediately.\"",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "951dd39a2d13df49ddb106ec69fbfe89",
        "title": "USDA suspends ‘federal financial awards’ for Minnesota, citing ‘massive fraud’",
        "doc_url": "https://www.independent.co.uk/news/world/americas/us-politics/usda-minnesota-fraud-federal-funding-b2897913.html",
        "all_text": "From reproductive rights to climate change to Big Tech, The Independent is on the ground when the story is developing. Whether it's investigating the financials of Elon Musk's pro-Trump PAC or producing our latest documentary, 'The A Word', which shines a light on the American women fighting for reproductive rights, we know how important it is to parse out the facts from the messaging.\nAt such a critical moment in US history, we need reporters on the ground. Your donation allows us to keep sending journalists to speak to both sides of the story.\nThe Independent is trusted by Americans across the entire political spectrum. And unlike many other quality news outlets, we choose not to lock Americans out of our reporting and analysis with paywalls. We believe quality journalism should be available to everyone, paid for by those who can afford it.\nYour support makes all the difference.",
        "authors": "None",
        "publish_date": "2026-01-10 00:04:54",
        "published_at_raw": "2026-01-10T00:04:54Z",
        "meta_site_name": "The Independent",
        "description": "The agriculture secretary cited ‘massive fraud’ in the state",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "999dab22c2a9131661c0be96ba634741",
        "title": "USDA suspends MILLIONS in federal awards to Minnesota over rampant fraud: 'No more handouts to thieves'",
        "doc_url": "https://www.dailymail.co.uk/news/article-15450915/minnesota-federal-awards-suspended-usda.html",
        "all_text": "The US Department of Agriculture (USDA) announced Friday that it was suspending federal financial awards to Minnesota over 'massive fraud.'\n'Enough is enough! The Trump administration has uncovered MASSIVE fraud in Minnesota and Minneapolis—billions siphoned off by fraudsters,' Brooke Rollins, the Secretary of Agriculture, wrote on X. 'And those in charge have ZERO plan to fix it.'\nThe funding for the awards was suspended effective immediately 'until sufficient proof has been provided that the fraud has stopped,' she added.\n'No more handouts to thieves!' Rollins wrote. 'Time to drain the Minnesota swamp and put American taxpayers first.'\nMinnesota Gov. Tim Walz and Minneapolis mayor Jacob Frey, both Democrats, were accused of refusing to 'provide basic information or take common sense measures to stop fraud.'\nIn a letter attached to the announcement, Rollins referenced that 'numerous non-profits and businesses have defrauded the federal government in what a federal prosecutor in Minnesota called “a staggering, industrial-scale fraud\".'\nShe specifically pointed to the Feeding Our Future nonprofit, which ran a $250 million fraud scheme that took advantage of a federally-funded child nutrition program.\nRollins said that Walz and Frey's 'leadership — or lack thereof' had resulted in 'fraudsters' exploiting American taxpayers.\n'This necessitates federal action to protect taxpayer dollars until adequate safeguards can be established,' she wrote.\nLast week, the federal government an",
        "authors": "None",
        "publish_date": "2026-01-10 00:01:16",
        "published_at_raw": "2026-01-10T00:01:16Z",
        "meta_site_name": "Daily Mail Online",
        "description": "The funding was suspended effective immediately 'until sufficient proof has been provided that the fraud has stopped,' Brooke Rollins, the Secretary of Agriculture, announced.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]