[
    {
        "id": "6eba0a4abc7703e1db33c5cba52609e1",
        "title": "This Farmer-Founded Drink Brand Is Now Available in Stores",
        "doc_url": "https://www.mensjournal.com/food/tractor-beverage-brings-its-organic-drinks-to-retail-shelves",
        "all_text": "Tractor Beverage Company, long known for supplying organic drinks to restaurants and foodservice operations, is stepping into retail for the first time. The brand is debuting its new USDA-certified organic drink, Haymaker, exclusively at Sprouts Farmers Market stores nationwide. The launch marks a major shift for the company, bringing a product once poured behind counters directly to consumers.\nHaymaker is an apple cider vinegar–based sparkling tonic available in three flavors: Refresher, Tangerine Pomegranate, and Hibiscus Lemonade. Each is formulated with organic ingredients and designed to offer a lighter, tangier profile than traditional sugared beverages. It’s the kind of drink aimed at shoppers who want something refreshing and functional without leaning on artificial flavors or syrups.\nWant trending news, op-eds, and top stories straight to your inbox? Sign up for our Daily newsletter.\nWho Is Tractor Beverage Company?\nFounded in 2014 in Hayden, Idaho, Tractor Beverage Company began as a farmer-led effort to create a cleaner alternative to conventional fountain drinks. The company focused early on organic ingredients, transparent sourcing, and keeping artificial flavors, colors, and sweeteners out of its beverages. Over the past decade, that approach helped Tractor grow into what it calls the first and only certified organic, non-GMO beverage line served at scale in U.S. restaurants, schools, and corporate dining.\nThe brand has also expanded its mission beyond beverages",
        "authors": "None",
        "publish_date": "2025-11-29 15:55:00",
        "published_at_raw": "2025-11-29T15:55:00Z",
        "meta_site_name": "Men's Journal",
        "description": "Tractor Beverage brings its USDA-certified organic Haymaker drinks to retail for the first time, launching exclusively at Sprouts Farmers Market.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "10d6b85e4c8681234a76fd8ba5932602",
        "title": "Tooele Valley Meat reprimanded after 'inhumane' amputation of steer's hoof",
        "doc_url": "https://www.sltrib.com/news/2025/11/28/usda-halts-slaughter-tooele-valley/",
        "all_text": "Federal food inspectors asked a Tooele County butcher shop to stop slaughtering animals after one of its agents saw staff “inhumanely” amputate an injured and conscious steer’s foot ahead of slaughter.\nThe black steer in line to be killed at Tooele Valley Meat on Nov. 5 tried to escape the queue and got its front left hoof stuck in between a gate post and a gate as it tried to jump the fence, U.S. Department of Agriculture inspectors witnessed, according to a notice of suspension letter.\nAs the animal struggled to get free, it broke its legs at the ankle in a compound fracture and laid against the gate, the notice said, “slumped with its head under its stuck leg.”\nThe owner decided the only way to free the animal and get it to slaughter was to amputate its hoof, according to the notice. Inspectors warned employees twice that the animal needed to be stunned — and therefore unconscious — before that happened, but about 15 minutes after the animal became trapped, the owner sliced off its hoof and corralled it into the slaughterhouse.\nThe same day, the USDA sent Tooele Valley Meat the suspension notice for inhumanely handling or slaughtering livestock. It required the business stop slaughter processes until it sent the USDA its plans for “corrective action and preventative measures.”\nThe suspension was lifted two days later, after Tooele Valley Meat provided that information. Now, the business can operate — with increased scrutiny from Food Safety and Inspection Service inspector",
        "authors": "None",
        "publish_date": "2025-11-29 13:00:00",
        "published_at_raw": "2025-11-29T13:00:00Z",
        "meta_site_name": "Salt Lake Tribune",
        "description": "The federally ordered two-day suspension came after a USDA inspector saw Tooele Valley Meat's owner cut the hoof off a conscious, injured steer that got ensnared in a gate as it tried to escape slaughter.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2c9fd161f095d1905d7f17a999619863",
        "title": "Charleston-area food pantries fill gaps made by federal cuts",
        "doc_url": "https://www.postandcourier.com/charleston_sc/food-bank-pantries-usda-charleston/article_87a3bb12-f93a-440e-bc0d-f96cab09bd91.html",
        "all_text": "CHARLESTON — Between May and September, the Lowcountry Food Bank lost out on 21,384 gallons of milk and 33,750 one-dozen cartons of eggs.\nThe nonprofit, which serves 10 coastal communities, was one of four South Carolina food banks that didn’t receive 1.5 million pounds of food from the U.S. Department of Agriculture during that time. They didn’t get the pallets of meat, dried fruit and cheese they often rely on for people in need.\nFor the Lowcountry Food Bank, the loss amounted to 615,787 pounds. Nationwide, 94 million pounds of federal food aid that was expected this summer never arrived.\nStarting in the spring, the Trump administration canceled $500 million from the USDA's Emergency Food Assistance Program that sends dairy, meat, eggs and produce to food banks, roughly one-fourth of the program’s funding last year, according to ProPublica.\nAccording to Brenda Shaw, Lowcountry Food Bank’s chief development officer, what comes from the USDA typically equates to $12 million and feeds roughly 167,000 people, she said.\nThe Emergency Food Assistance Program, which was established by Congress in 1983, received additional aid under the Biden administration to address post-pandemic supply chain challenges. Starting this spring, the program experienced significant cuts.\n\"While the Biden-era TEFAP slush fund was terminated, the program continues to operate uninterrupted, as originally intended by Congress, with more than $394 million spent in recent months to connect families with fo",
        "authors": "None",
        "publish_date": "2025-11-29 10:00:00",
        "published_at_raw": "2025-11-29T10:00:00Z",
        "meta_site_name": "Charleston Post and Courier",
        "description": "This year, Charleston-area food banks and pantries have needed to replenish the hole left from missing food aid that typically comes from the USDA.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]