[
    {
        "id": "90287699721a28d6fb641886ceba3981",
        "title": "Corn Closes with Tuesday Weakness",
        "doc_url": "https://www.barchart.com/story/news/37028134/corn-closes-with-tuesday-weakness",
        "all_text": "Corn futures closed the Tuesday session with contracts down 1 to 3 ½ cents across the front months, following sharp Monday losses. The CmdtyView national average Cash Corn price was down 1 3/4 cents at $3.81 1/2.\nEIA data will be released on Wednesday morning, with traders looking for ethanol production to be steady following last week’s ballooning stocks total and drop in refiner inputs.\nA couple South Korean importers purchased a total of 264,000 MT of corn in tenders overnight, with another tender for 140,000 MT issued for a Wednesday deadline.\nBrazil’s January corn exports are projected at 3.27 MMT according to ANEC, up 0.42 MMT from the previous number.\nMar 26 Corn closed at $4.19 3/4, down 1 3/4 cents,\nNearby Cash was $3.81 1/2, down 1 3/4 cents,\nMay 26 Corn closed at $4.27 3/4, down 2 3/4 cents,\nJul 26 Corn closed at $4.34 1/2, down 3 1/2 cents,",
        "authors": "None",
        "publish_date": "2026-01-13 22:04:21",
        "published_at_raw": "2026-01-13T22:04:21Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Tuesday session with contracts down 1 to 3 ½ cents across the front months, following sharp Monday losses. The CmdtyView national average Cash Corn price was down 1 3/4 cents at $3.81 1/2. EIA data will be released on Wednesd...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "321b4b48eff2d599e1aff44c2c3dd046",
        "title": "Corn Following Up Monday with Tuesday Weakness",
        "doc_url": "https://www.barchart.com/story/news/37024514/corn-following-up-monday-with-tuesday-weakness",
        "all_text": "Corn futures are trading with 1 to 3 cent losses at Tuesday’s midday, seeing some limited follow-through from Monday’s action. The CmdtyView national average Cash Corn price was down 1 1/2 cents at $3.82 1/2.\nUSDA’s Crop Production report from Monday showed US corn yield at 186.5 bpa, which was a 0.5 bpa increase from the November report. Acres were up 1.3 million on the harvested side to 91.3 million acres. That took the production number to 17.021 bbu, up 269 mbu from November. The quarterly Grain Stocks report tallied December 1 corn stocks at 13.282 bbu. That was 1.207 bbu above a year ago.\nWASDE data showed US ending stocks raised by 198 mbu, taking the projection to 2.227 bbu. That came via the production adjustment as carryover from 2024/25 was up 19 mbu, and feed raised by 100 mbu. World ending stocks were raised by 11.76 MMT to 290.91 MMT, with the US increase and a 6.24 MMT increase to Chinese production.\nA couple South Korean importers purchased a total of 264,000 MT of corn in tenders overnight, with another tender for 140,000 MT issued for a Wednesday deadline.\nMar 26 Corn is at $4.20, down 1 1/2 cents,\nNearby Cash is at $3.82 1/2, down 1 1/2 cents,\nMay 26 Corn is at $4.28 1/4, down 2 1/4 cents,\nJul 26 Corn is at $4.35 1/2, down 2 1/2 cents,",
        "authors": "None",
        "publish_date": "2026-01-13 18:28:24",
        "published_at_raw": "2026-01-13T18:28:24Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with 1 to 3 cent losses at Tuesday’s midday, seeing some limited follow-through from Monday’s action. The CmdtyView national average Cash Corn price was down 1 1/2 cents at $3.82 1/2. USDA’s Crop Production report from Monda...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "73fe6f62d88fada6e4f46883572e006d",
        "title": "USDA Says 2025 Corn Production Hit 17 Billion Bushels, Likely to Keep Prices Low",
        "doc_url": "https://www.agriculture.com/partners-usda-says-2025-corn-production-hit-17-billion-bushels-likely-to-keep-prices-low-11884347",
        "all_text": "By Ryan Hanrahan\nFarm Futures’ Bruce Blythe reported that “corn futures plunged to the lowest levels since August after USDA stunned the market by boosting its 2025 U.S. crop estimate above 17 billion bushels for the first time, signaling a heavy supply outlook that likely will burden prices and further squeeze farmer bottom lines even amid record demand. Soybean futures also tumbled after USDA held its yield figure steady.”\n“USDA said last year’s U.S. corn crop averaged a record 186.5 bushels per acre, up 0.5 bushel from a previous estimate, according to the agency’s annual Crop Production Annual Summary released (yesterday),” Blythe reported. “The average marked a 4% improvement over 179.3 bpa in 2024 and clashed with trade expectations for a downward revision of about 2 bpa.”\n“USDA also raised harvested acreage 1.3 million acres to 91.3 million acres, resulting in a record crop totaling 17.021 billion bushels, up 269 million bushels from USDA’s previous estimate in November and up over 2 billion bushels, or 14%, from 2024,” Blythe reported. “USDA also raised its forecast for U.S. corn stocks at the end of the 2025-26 marketing year by 198 million bushels to 2.227 billion bushels, a seven-year high.”\n“Today’s numbers ‘blindsided’ the market, painting a troubling picture for U.S. farmers struggling with crop prices that remain stubbornly below break-even levels and no apparent end in sight, said Jon Prischmann, President of Blue Creek Commodities and Hedging LLC in Fergus Fa",
        "authors": "None",
        "publish_date": "2026-01-13 15:32:37",
        "published_at_raw": "2026-01-13T15:32:37Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA’s latest report shows U.S. corn production reached a record 17+ billion bushels in 2025, fueling abundant stocks and likely keeping prices low — pressuring farm incomes and renewing calls for expanded markets and ethanol demand.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1fc16bf4f137a9c7bfb751f6620bb40c",
        "title": "Corn Extending Losses on Tuesday Morning",
        "doc_url": "https://www.barchart.com/story/news/37016933/corn-extending-losses-on-tuesday-morning",
        "all_text": "Corn price action is down another 2 to 4 cents so far on Tuesday. Futures extended the losses following the bearish USDA data release on Monday, as futures closed with 22 to 24 ¼ cent losses in the front months. Preliminary open interest shot up 44,360 contracts on Tuesday, suggesting new selling interest. Deferred contracts were down 5 to 14 ½ cents. The CmdtyView national average Cash Corn price was down 24 cents at $3.83 1/4.\nA private export sale announcement of 204,000 MT of corn was announced to South Korea this morning by USDA, with another 310,000 MT of corn sold to unknown destinations. That news was buried by other not so friendly USDA reports.\nUSDA’s Crop Production report from Monday showed US corn yield at 186.5 bpa, which was a 0.5 bpa increase from the November report. Acres were up 1.3 million on the harvested side to 91.3 million acres. That took the production number to 17.021 bbu, up 269 mbu from November. The quarterly Grain Stocks report tallied December 1 corn stocks at 13.282 bbu. That was 1.207 bbu above a year ago.\nWASDE data showed US ending stocks raised by 198 mbu, taking the projection to 2.227 bbu. That came via the production adjustment as carryover from 2024/25 was up 19 mbu, and feed raised by 100 mbu. World ending stocks were raised by 11.76 MMT to 290.91 MMT, with the US increase and a 6.24 MMT increase to Chinese production.\nMonday morning’s Export Inspections report showed 1.49 MMT (58.66 mbu) of corn shipped in the week of 1/8. That was 1",
        "authors": "None",
        "publish_date": "2026-01-13 13:12:11",
        "published_at_raw": "2026-01-13T13:12:11Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is down another 2 to 4 cents so far on Tuesday. Futures extended the losses following the bearish USDA data release on Monday, as futures closed with 22 to 24 ¼ cent losses in the front months. Preliminary open interest shot up 44,3...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c25d41cf193d15cfb4479ebb04d337da",
        "title": "Grower Groups Warn of Deeper Price Pain After Corn Supply Shock From USDA Report",
        "doc_url": "https://www.agriculture.com/grower-groups-warn-of-deeper-price-pain-after-corn-supply-shock-from-usda-report-11884139",
        "all_text": "The USDA on Monday projected a record-breaking 17-billion-bushel corn supply in 2025–2026, shocking the market and “raising alarms among the nation’s corn growers,” according to the National Corn Growers Association (NCGA).\n“The surplus supply promises to keep corn prices low as farmers struggle to pay high input costs,” the group said.\nNCGA was among a number of groups who responded strongly to the USDA projections, using the opportunity to advocate for corn growers by calling for swift, long-term policy solutions. Here’s a look at the reactions.\nIowa Department of Agriculture and Land Stewardship\nThe Iowa Department of Agriculture and Land Stewardship (IDALS) has been led by Secretary of Agriculture Mike Naig since 2018.\nNaig offered comments on the Crop Production Summary, first praising Iowa farmers for their resilience, and then calling for federal farm policy advances.\n“The 2025 growing season tested Iowa farmers with highly variable conditions, including areas that saw too much rain, others that were too dry, and disease pressure that added to the complexities. Even so, Iowa farmers once again delivered a historic and record-breaking crop. This productivity is coming at a time of real stress in the ag economy, with tight margins driven by high input costs and continued pressure from low commodity prices,” said Naig.\n“To reverse this trend, we can start by taking steps to use more of what we grow and raise here at home. We need Congress to deliver a modern, five-year fa",
        "authors": "None",
        "publish_date": "2026-01-13 00:09:14",
        "published_at_raw": "2026-01-13T00:09:14Z",
        "meta_site_name": "Successful Farming",
        "description": "The USDA on Monday projected a record-breaking 17-billion-bushel corn supply in 2025-2026, shocking the market and “raising alarms among the nation’s corn growers,” according to the National Corn Growers Association.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "12ac9c231b85bd674bae5197ddb34515",
        "title": "High Prices Squeeze India's Soybean Meal Exports",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3768038-high-prices-squeeze-indias-soybean-meal-exports",
        "all_text": "India's export of soybean meal witnessed a substantial decline of 37.50% in December 2025, a consequence of its higher prices compared to other major exporters such as the United States.\nThe Soybean Processors Association of India (SOPA) revealed that in December 2024, India had exported 2.77 lakh tonne of soybean meal, a significant contrast to the recent figures. During December 2025, the UAE, Iran, Nepal, and Bangladesh stood out as the leading importers of Indian soybean meal.\nSOPA's Executive Director DN Pathak cited elevated prices as a primary reason for the suppressed global demand, with countries like the US, Brazil, and Argentina offering more competitive options. Despite this, soybean meal remains a crucial protein source, utilized in diverse food products and animal feeds, maintaining its relevance. Firmly rooted in Madhya Pradesh, SOPA continues its mission to bolster the soybean sector in India.",
        "authors": "None",
        "publish_date": "2026-01-13 12:27:31",
        "published_at_raw": "2026-01-13T12:27:31Z",
        "meta_site_name": "Devdiscourse",
        "description": "India's soybean meal exports dropped 37.50% in December 2025, influenced by high prices compared to other countries like the US. Despite being a valuable protein source, the demand falters due to cost. Madhya Pradesh remains the key soybean state, as SOPA continues to advocate for the crop.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a29316deb5449be7cc3af7eeaf82c5f4",
        "title": "Hogs Close with Tuesday Gains",
        "doc_url": "https://www.barchart.com/story/news/37028177/hogs-close-with-tuesday-gains",
        "all_text": "Lean hog futures posted gains of 20 to 50 cents in the front months on Tuesday. USDA’s national base hog price was reported at $70 on Tuesday afternoon. The CME Lean Hog Index was down 25 cents on Jan 9 at $80.60.\nUSDA’s pork carcass cutout value from the Tuesday PM report was $1.30 lower at $91.80 per cwt. The rib and ham primals were the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 474,000 head, with the weekly tally at 991,000. That is 2,000 head shy of last week but 62,597 head above the same week last year.\nFeb 26 Hogs closed at $84.625, up $0.200,\nApr 26 Hogs closed at $91.250, up $0.500\nMay 26 Hogs closed at $95.425, up $0.400,",
        "authors": "None",
        "publish_date": "2026-01-13 22:04:21",
        "published_at_raw": "2026-01-13T22:04:21Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted gains of 20 to 50 cents in the front months on Tuesday. USDA’s national base hog price was reported at $70 on Tuesday afternoon. The CME Lean Hog Index was down 25 cents on Jan 9 at $80.60. USDA’s pork carcass cutout value fr...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:00",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b6b42363da8eaefa3bc3284a9de84532",
        "title": "Hogs Back to Higher Trade on Tuesday",
        "doc_url": "https://www.barchart.com/story/news/37024554/hogs-back-to-higher-trade-on-tuesday",
        "all_text": "Lean hog futures are trading with 20 to 30 point gains across the nearby contracts on Tuesday. USDA’s national base hog price was not reported on Tuesday morning due to light volume. The CME Lean Hog Index was down 25 cents on Jan 9 at $80.60.\nUSDA’s pork carcass cutout value from the Tuesday AM report was 97 cents lower at $92.13 per cwt. The rib and belly primals were the only reported higher. USDA estimated federally inspected hog slaughter for Monday at 497,000 head. That is 1,000 head shy of last Monday but 13,474 head above the same week last year.\nFeb 26 Hogs are at $84.625, up $0.200,\nApr 26 Hogs are at $91.050, up $0.300\nMay 26 Hogs are at $95.250, up $0.225,",
        "authors": "None",
        "publish_date": "2026-01-13 18:28:24",
        "published_at_raw": "2026-01-13T18:28:24Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are trading with 20 to 30 point gains across the nearby contracts on Tuesday. USDA’s national base hog price was not reported on Tuesday morning due to light volume. The CME Lean Hog Index was down 25 cents on Jan 9 at $80.60. USDA’...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "97e0f14d96d4c7f0da23fd0865421154",
        "title": "USDA projects drop in Florida citrus harvest",
        "doc_url": "https://www.heraldtribune.com/story/news/state/2026/01/13/usda-forecast-shows-florida-citrus-production-decline/88157709007/",
        "all_text": "Florida's 2025-26 citrus harvest is projected to be slightly lower than the previous season's historic lows.\nThe USDA forecasts 12 million boxes of oranges and 1.2 million boxes of grapefruit for the current season.\nDespite the low forecast, industry leaders express optimism due to healthier trees and innovative treatments.\nTALLAHASSEE — More than a third of the way into the growing season, Florida’s citrus industry is looking at projections of a harvest that would be down slightly from the historic lows of the 2024-25 crop.\nIn its first report about the 2025-26 season, the U.S. Department of Agriculture on Jan. 12 forecast that Florida will produce 12 million boxes of oranges, down from 12.2 million during the 2024-25 season. The forecast also estimated Florida will produce 1.2 million boxes of grapefruit, down from 1.3 million in 2024-25.\nSpecialty crops, which include tangerines and tangelos are set to match the 400,000 boxes produced last season, while lemon production is forecast to grow from 670,000 boxes to 700,000 boxes.\nFlorida Citrus Mutual Executive Vice President and CEO Matt Joyner acknowledged the estimate was “lower than we would like.” But he added there is an increased confidence in the industry as “growers are reporting healthier trees and larger fruit.”\n“Innovative treatments, therapies and disease-tolerant trees are making a real difference,” Joyner said in a prepared statement. “With more time and good weather, we’re optimistic we’ll continue to see signs",
        "authors": "None",
        "publish_date": "2026-01-13 15:42:58",
        "published_at_raw": "2026-01-13T15:42:58Z",
        "meta_site_name": "Herald-Tribune",
        "description": "USDA’s 2025-26 forecast projects 12M orange boxes and 1.2M grapefruit, slightly below 2024-25. But growers say there are reasons for hope.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4220b1f5d5711e6df313ede4f6314b56",
        "title": "Edible Garden Expands New York City Dominance with New Urban Market and DUMBO Market Locations in Brooklyn and Manhattan",
        "doc_url": "https://www.manilatimes.net/2026/01/13/tmt-newswire/globenewswire/edible-garden-expands-new-york-city-dominance-with-new-urban-market-and-dumbo-market-locations-in-brooklyn-and-manhattan/2257983",
        "all_text": "Additional Locations Now Carry Fresh USDA Organic Herbs, Hydroponic Basil, and Value-Added, Clean-Label Food Brands Pickle Party and Pulp®\nBELVIDERE, NJ, Jan. 13, 2026 (GLOBE NEWSWIRE) -- Edible Garden AG Incorporated (\"Edible Garden” or the \"Company”) (Nasdaq: EDBL, EDBLW), a leading provider of controlled environment agriculture (CEA) solutions and sustainable, locally grown organic produce, today announced that new Urban Market and DUMBO Market locations in Brooklyn and Manhattan are now carrying a range of the Company’s fresh cut and potted herbs, hydroponic basil, and value-added, clean-label food brands Pickle Party and Pulp. The expansion further strengthens the Company’s retail footprint across high-density metropolitan neighborhoods and expands access to fresh, clean-label, and sustainably produced foods.\nUrban Market is a neighborhood-focused grocery destination serving Brooklyn shoppers with a curated selection of everyday essentials, fresh foods, and locally relevant products. With a convenience-driven format and a strong emphasis on quality and value, the store caters to health-conscious consumers seeking fresh produce and innovative food offerings close to home. Complementing this approach, DUMBO Market in Manhattan is a modern specialty grocer known for its thoughtfully sourced products, premium fresh foods, and focus on flavor, quality, and culinary inspiration, appealing to discerning shoppers looking for distinctive, better-for-you brands alongside tradition",
        "authors": "None",
        "publish_date": "2026-01-13 13:26:31",
        "published_at_raw": "2026-01-13T13:26:31Z",
        "meta_site_name": "The Manila Times",
        "description": "Additional Locations Now Carry Fresh USDA Organic Herbs, Hydroponic Basil, and Value-Added, Clean-Label Food Brands Pickle Party and Pulp®",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5d1c0b1b5c3477e7dcbb740484662bcf",
        "title": "Edible Garden Expands New York City Dominance with New",
        "doc_url": "https://www.globenewswire.com/news-release/2026/01/13/3217782/0/en/Edible-Garden-Expands-New-York-City-Dominance-with-New-Urban-Market-and-DUMBO-Market-Locations-in-Brooklyn-and-Manhattan.html",
        "all_text": "BELVIDERE, NJ, Jan. 13, 2026 (GLOBE NEWSWIRE) -- Edible Garden AG Incorporated (“Edible Garden” or the “Company”) (Nasdaq: EDBL, EDBLW), a leading provider of controlled environment agriculture (CEA) solutions and sustainable, locally grown organic produce, today announced that new Urban Market and DUMBO Market locations in Brooklyn and Manhattan are now carrying a range of the Company’s fresh cut and potted herbs, hydroponic basil, and value-added, clean-label food brands Pickle Party and Pulp. The expansion further strengthens the Company’s retail footprint across high-density metropolitan neighborhoods and expands access to fresh, clean-label, and sustainably produced foods.\nUrban Market is a neighborhood-focused grocery destination serving Brooklyn shoppers with a curated selection of everyday essentials, fresh foods, and locally relevant products. With a convenience-driven format and a strong emphasis on quality and value, the store caters to health-conscious consumers seeking fresh produce and innovative food offerings close to home. Complementing this approach, DUMBO Market in Manhattan is a modern specialty grocer known for its thoughtfully sourced products, premium fresh foods, and focus on flavor, quality, and culinary inspiration, appealing to discerning shoppers looking for distinctive, better-for-you brands alongside traditional grocery staples.\nThe additional locations will offer Edible Garden’s fresh potted living herbs, cut herbs, and hydroponic basil, grown u",
        "authors": "None",
        "publish_date": "2026-01-13 13:17:00",
        "published_at_raw": "2026-01-13T13:17:00Z",
        "meta_site_name": "GlobeNewswire",
        "description": "Additional Locations Now Carry Fresh USDA Organic Herbs, Hydroponic Basil, and Value-Added, Clean-Label Food Brands Pickle Party and Pulp®...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2ee28b02f1ac9a3c8276ae506d1ce9b1",
        "title": "Cotton Extending Higher on Tuesday AM Trade",
        "doc_url": "https://www.barchart.com/story/news/37016983/cotton-extending-higher-on-tuesday-am-trade",
        "all_text": "Cotton price action is up 14 to 18 points on Tuesday morning. Futures close with gains of 50 to 55 points across the front months on Monday, as USDA data was friendlier to the market. Crude oil futures were back up 72 cents per barrel at $59.84. The US dollar index was down $0.215 at $98.675.\nNASS Cotton Ginnings data showed 11.962 million RB of cotton ginned as of January 1, which was down from a year ago by 1.023 million RB.\nUSDA showed cotton harvested acres up 430,000 acres, with yield down 73 lbs/acre, at 856 lbs. That took production down 0.35 million bales to 13.92 million. Ending stocks were 300,000 bales lower to 4.2 million.\nThe Friday online auction from The Seam showed sales of 56.57 cents/lb on 4,773 bales. The Cotlook A Index was down 35 points on January 9 at 74.45 cents. ICE certified cotton stocks were steady on 1/9 with the certified stocks level at 11,510 bales. The Adjusted World Price was updated to 50.97 cents/lb on Thursday afternoon, up 21 points from the week prior.\nMar 26 Cotton closed at 64.91, up 50 points, currently up 23 points\nMay 26 Cotton closed at 66.44, up 53 points, currently up 21 points\nJul 26 Cotton closed at 67.86, up 55 points, currently up 19 points",
        "authors": "None",
        "publish_date": "2026-01-13 13:12:11",
        "published_at_raw": "2026-01-13T13:12:11Z",
        "meta_site_name": "Barchart",
        "description": "Cotton price action is up 14 to 18 points on Tuesday morning. Futures close with gains of 50 to 55 points across the front months on Monday, as USDA data was friendlier to the market. Crude oil futures were back up 72 cents per barrel at $59.84. The...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "97bc7822296809580de39a675fe1304e",
        "title": "Hogs Fade on Monday as Traders Look to Tuesday",
        "doc_url": "https://www.barchart.com/story/news/37016973/hogs-fade-on-monday-as-traders-look-to-tuesday",
        "all_text": "Lean hog futures closed with losses of 80 cents to $1.025 in the front months on Monday. Preliminary open interest was down 1,343 contracts on Monday. USDA’s national base hog price was not reported on Monday afternoon due to light volume. The CME Lean Hog Index was down 13 cents on Jan 8 at $80.85.\nUSDA’s pork carcass cutout value from the Monday PM report was 78 cents higher at $93.10 per cwt. The butt primal was the only reported lower. USDA estimated federally inspected hog slaughter for Monday at 497,000 head. That is 1,000 head shy of last Monday but 13,474 head above the same week last year.\nFeb 26 Hogs closed at $84.425, down $0.875,\nApr 26 Hogs closed at $90.750, down $1.025\nMay 26 Hogs closed at $95.025, down $0.825,",
        "authors": "None",
        "publish_date": "2026-01-13 13:12:11",
        "published_at_raw": "2026-01-13T13:12:11Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed with losses of 80 cents to $1.025 in the front months on Monday. Preliminary open interest was down 1,343 contracts on Monday. USDA’s national base hog price was not reported on Monday afternoon due to light volume. The CME Le...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ccd5e5b58dfe067d9955f7120e75dff4",
        "title": "Wheat Mostly Lower on Tuesday Morning",
        "doc_url": "https://www.barchart.com/story/news/37016953/wheat-mostly-lower-on-tuesday-morning",
        "all_text": "Wheat trade is mostly 1 to 4 cents lower in the winer wheat contracts on Tuesday morning trade, with spring wheat up 3 to 4 cents. The wheat complex posted losses across all three exchanges on Monday, as USDA data had a bearish spin. Chicago SRW futures were down 6 cents on the session. Open interest was down 1,272 contracts on Monday, mostly in March. KC HRW futures posted losses of 3 to 5 cents into the Monday close. OI slipped 2,278 contracts, with 4,805 out of March. MPLS spring wheat was down 1 to 2 cents across the front months.\nExport Inspections data showed wheat shipments at 317,465 MT (11.66 mbu) shipped in the week that ended on January 8. That was an increase of 73.03% from the week prior, and up 2.19% from same week last year. The Philippines was the top destination of 100,459 MT, with 60,419 MT to Mexico and 39,899 MT to Taiwan. Marketing year shipments have totaled 15.581 MMT (572.52 mbu), which is up 19.23% yr/yr.\nUSDA showed no changes the 2025/26 US wheat output, as feed and residual was trimmed by 20 mbu on the balance sheet to 100 and carryover from 2024/25 was up 4 mbu. That took US wheat ending stocks up 25 mbu to 926 mbu per the WASDE report. World wheat stocks were raised by another 3.38 MMT to 278.25 MMT.\nThe quarterly Grain Stocks report showed December 1 wheat stocks at 1.675 bbu, above the average guess of 1.636 bbu. That was also 107 mbu above the same period last year.\nUSDA released their Winter wheat Seedings report on Monday, showed all winter ",
        "authors": "None",
        "publish_date": "2026-01-13 13:12:11",
        "published_at_raw": "2026-01-13T13:12:11Z",
        "meta_site_name": "Barchart",
        "description": "Wheat trade is mostly 1 to 4 cents lower in the winer wheat contracts on Tuesday morning trade, with spring wheat up 3 to 4 cents. The wheat complex posted losses across all three exchanges on Monday, as USDA data had a bearish spin. Chicago SRW futu...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "096613ba890e9b96daaf82810e9cd527",
        "title": "Despite extreme weather, disease, Iowa set 2025 harvest records",
        "doc_url": "https://www.desmoinesregister.com/story/money/agriculture/2026/01/13/iowa-harvest-record-crop-2025/88148553007/",
        "all_text": "Iowa farmers harvested a record 2.77 billion bushels of corn last year, beating a record set nearly a decade ago despite struggling with disease pressure, a derecho, record rainfall and other challenges, new data shows.\nThe state’s growers also produced 595.6 million bushels of soybeans, the third-largest Iowa harvest of the crop on record, the U.S. Department of Agriculture’s data shows.\n“The 2025 growing season tested Iowa farmers with highly variable conditions,” Mike Naig, Iowa’s agriculture secretary, said in a statement Monday, Jan. 12. “Even so, Iowa farmers once again delivered a historic and record-breaking crop.”\nIn July, northern and eastern Iowa were hit by damaging derecho winds, ranging from 80 mph to 100 mph, that toppled trees, powerlines and corn. The month also brought heavy rains, with a statewide average of 9.2 inches, the second most on record for the period, state data shows.\nAdding to the challenges, some farmers struggled with yield-cutting diseases: southern rust in corn and sudden death syndrome in soybeans.\nWith the 2025 harvest, Iowa remains the largest U.S. corn grower, beating No. 2 Illinois by 418 million bushels, and the second-biggest soybean grower, trailing Illinois, the leader, by nearly 44 million bushels, data shows.\nIowa and U.S. farmers also battled financial headwinds last year, with the costs to grow corn and soybeans often higher than the price they received for their crops, losses that were exacerbated by ongoing trade disputes.\nLas",
        "authors": "None",
        "publish_date": "2026-01-13 12:18:18",
        "published_at_raw": "2026-01-13T12:18:18Z",
        "meta_site_name": "Des Moines Register",
        "description": "Iowa farmers' corn, soybean harvest in 2025 set new records, despite derecho, disease and near-record rainfall, USDA says.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1dde74beff221d0e65d77b48a2494f7b",
        "title": "Despite extreme weather, disease, Iowa set 2025 harvest records",
        "doc_url": "https://www.amestrib.com/story/money/agriculture/2026/01/13/iowa-harvest-record-crop-2025/88148553007/",
        "all_text": "Iowa farmers harvested a record 2.77 billion bushels of corn last year, beating a record set nearly a decade ago despite struggling with disease pressure, a derecho, record rainfall and other challenges, new data shows.\nThe state’s growers also produced 595.6 million bushels of soybeans, the third-largest Iowa harvest of the crop on record, the U.S. Department of Agriculture’s data shows.\n“The 2025 growing season tested Iowa farmers with highly variable conditions,” Mike Naig, Iowa’s agriculture secretary, said in a statement Monday, Jan. 12. “Even so, Iowa farmers once again delivered a historic and record-breaking crop.”\nIn July, northern and eastern Iowa were hit by damaging derecho winds, ranging from 80 mph to 100 mph, that toppled trees, powerlines and corn. The month also brought heavy rains, with a statewide average of 9.2 inches, the second most on record for the period, state data shows.\nAdding to the challenges, some farmers struggled with yield-cutting diseases: southern rust in corn and sudden death syndrome in soybeans.\nWith the 2025 harvest, Iowa remains the largest U.S. corn grower, beating No. 2 Illinois by 418 million bushels, and the second-biggest soybean grower, trailing Illinois, the leader, by nearly 44 million bushels, data shows.\nIowa and U.S. farmers also battled financial headwinds last year, with the costs to grow corn and soybeans often higher than the price they received for their crops, losses that were exacerbated by ongoing trade disputes.\nLas",
        "authors": "None",
        "publish_date": "2026-01-13 12:18:18",
        "published_at_raw": "2026-01-13T12:18:18Z",
        "meta_site_name": "Ames Tribune",
        "description": "Iowa farmers' corn, soybean harvest in 2025 set new records, despite derecho, disease and near-record rainfall, USDA says.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:01",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]