[
    {
        "id": "e8f15146b8e32c9b55f2de1dc8da613f",
        "title": "Corn Pulls Back on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/36561666/corn-pulls-back-on-wednesday",
        "all_text": "Corn futures gave back some of the Tuesday gains, with contracts own 3 to 4 cents on Wednesday, as soon to expire December was down 6 cents. The CmdtyView national average Cash Corn price was down 3 1/2 cents at $3.99.\nEIA data showed a total of 1.105 million barrels per day of ethanol production in the US during the week ending on December 5, down 21,000 bpd from the week prior’s record. Ethanol stocks pulled back just 1,000 barrels to 22.51 million barrels in that week. Refiner inputs of ethanol were down 6,000 bpd to 851,000 bpd, with exports dropping 45,000 bpd to 125,000 bpd.\nNASS released their backed up Grain Crushings report this afternoon, showing September corn grind at 435.36 million bushels, down 2.66% from last year. October corn grind was also released, with 476.4 mbu of corn usage, up 2.76% vs. last year. In the first two months of the marketing year, corn used for ethanol was up 1 million bushel from last year.\nExport Sales data will get another backlogged update on Thursday morning, with traders looking for 0.8-2 MMT in corn sales during the week of 11/13.\nAnother CFTC release on Wednesday from the week of November 10 showed corn speculators trimming another 31,993 contracts from their net short position, taking it to 39,523 contracts.\nA couple South Korean importers purchased a total of 136,000 MT of corn in tenders overnight. Taiwan tendered for 65,000 MT of corn.\nDec 25 Corn closed at $4.34 3/4, down 6 cents,\nNearby Cash was $3.99, down 3 1/2 cents,\nMar 26",
        "authors": "None",
        "publish_date": "2025-12-10 23:21:37",
        "published_at_raw": "2025-12-10T23:21:37Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures gave back some of the Tuesday gains, with contracts own 3 to 4 cents on Wednesday, as soon to expire December was down 6 cents. The CmdtyView national average Cash Corn price was down 3 1/2 cents at $3.99. EIA data showed a total of 1....",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "65b54b775f3efa6ee4d1beee13db1db1",
        "title": "Corn Posting Wednesday Weakness, as Ethanol Production Remains Robust",
        "doc_url": "https://www.barchart.com/story/news/36556299/corn-posting-wednesday-weakness-as-ethanol-production-remains-robust",
        "all_text": "Corn futures are showing losses of 3 to 4 cents across the front months on Wednesday, as contracts give back some of the Tuesday gains. The CmdtyView national average Cash Corn price is down 3 1/2 cents at $3.99.\nEIA data showed a total of 1.105 million barrels per day of ethanol production in the US during the week ending on December 5, down 21,000 bpd from the week prior’s record. Ethanol stocks pulled back just 1,000 barrels to 22.51 million barrels in that week. Refiner inputs of ethanol were down 6,000 bpd to 851,000 bpd, with exports dropping 45,000 bpd to 125,000 bpd.\nCFTC data from the week of November 4 showed corn speculators cutting 17,990 contracts from their net short position, taking it to 71,516 contracts.\nA couple South Korean importers purchased a total of 136,000 MT of corn in tenders overnight. Taiwan tendered for 65,000 MT of corn.\nDec 25 Corn is at $4.37, down 3 3/4 cents,\nNearby Cash is at $3.99, down 3 1/2 cents,\nMar 26 Corn is at $4.44 1/2, down 3 1/2 cents,\nMay 26 Corn is at $4.52 1/4, down 3 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-10 18:16:05",
        "published_at_raw": "2025-12-10T18:16:05Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are showing losses of 3 to 4 cents across the front months on Wednesday, as contracts give back some of the Tuesday gains. The CmdtyView national average Cash Corn price is down 3 1/2 cents at $3.99. EIA data showed a total of 1.105 mil...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5a66ea388eb21d714f63183e1b4d75d4",
        "title": "Corn Fading Back Early on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/36549984/corn-fading-back-early-on-wednesday",
        "all_text": "Corn price action is down fractionally to 2 cents so far on Wednesday morning. Futures posted gains of 4 to 5 cents across most contracts on Tuesday, following a bullish USDA report. Open interest was up 6,413 contracts on Tuesday, suggesting net new buying. The CmdtyView national average Cash Corn price was up 4 1/2 cents at $4.03 1/2.\nThe monthly WASDE was out this morning, showing a 125 mbu cut to US ending stocks, now at 2.029 billion bushels. That was well below estimates and came all from an increase to the export category.\nOn the world side, the largest adjustment was via increase carryover (+1.71 MMT), mainly in Argentina, as the US cut more than off set that. World ending stocks for 2025/26 are seen at 279.15 MMT, a 2.19 MMT drop from last month. Other notable adjustments was a 3 MMT cut to Ukraine output.\nCFTC data from the week of November 4 showed corn speculators cutting 17,990 contracts from their net short position, taking it to 71,516 contracts.\nA couple South Korean importers purchased a total of 136,000 MT of corn in tenders overnight. Taiwan tendered for 65,000 MT of corn.\nANEC estimates the December Brazilian corn export total at 6.3 MMT. That is a 1.31 MMT increase from last week’s projection and would be 2.03 MMT increase over last year’s total in December. Argentina trimmed their export tax on corn by 1 percentage point to 8.5% according to a release from the country’s economic minster.\nDec 25 Corn closed at $4.40 3/4, up 4 1/2 cents, currently down 3/4",
        "authors": "None",
        "publish_date": "2025-12-10 13:25:49",
        "published_at_raw": "2025-12-10T13:25:49Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is down fractionally to 2 cents so far on Wednesday morning. Futures posted gains of 4 to 5 cents across most contracts on Tuesday, following a bullish USDA report. Open interest was up 6,413 contracts on Tuesday, suggesting net new...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d6ba52ba8e75bc9809c99fa0c7174cce",
        "title": "Corn prices continue to climb above 200-day moving average",
        "doc_url": "https://www.barchart.com/story/news/36541480/corn-prices-continue-to-climb-above-200-day-moving-average",
        "all_text": "I am Stephen Davis, senior market strategist at Walsh Trading, Inc., Chicago, Illinois. You can reach me at 312-878-2391.\nToday's World Agricultural Supply and Demand Estimates (WASDE) report from the United States Department of Agriculture was positive, pushing corn prices above the 200-day moving average. See the chart below. In my opinion, any market above a 200-day moving average is bullish; prices will go higher by the end of the year and into the new year.\nThe report states “This month’s 2025/26 U.S. corn outlook is for greater exports and lower ending stocks. Exports are raised 125 million bushels to 3.2 billion reflecting shipments to date. Export inspection data showed robust foreign demand during November and implies total shipments during the September-November quarter will likely exceed 800 million bushels, surpassing the prior high set during 2007. With no supply changes and use rising, corn ending stocks are down 125 million bushels to 2.0 billion.”\nThe weekly chart below shows prices at 440.0 or above for five out of the last seven weeks. 2026 U.S. corn acreage is anticipated to be lower than 2025. However, higher prices could result in more acreage devoted to corn.\nAn option trade strategy is to sell three March 2026 corn puts at 4.4 ($675). With that premium in your account, buy one March 2026 corn at 450.0 call at 12.0 ($600). The puts you sell will pay for the call you buy. If and when corn rallies, you can buy the puts back.\nContact me anytime to discuss t",
        "authors": "None",
        "publish_date": "2025-12-10 01:35:54",
        "published_at_raw": "2025-12-10T01:35:54Z",
        "meta_site_name": "Barchart",
        "description": "I am Stephen Davis, senior market strategist at Walsh Trading, Inc., Chicago, Illinois. You can reach me at 312-878-2391. Today's World Agricultural Supply and Demand Estimates (WASDE) report from the United States Department of Agriculture was posit...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "49f49fe48aa64803cf37fa9ad1c19525",
        "title": "Corn prices continue to climb above 200-day moving average",
        "doc_url": "https://www.barchart.com/story/news/36541479/corn-prices-continue-to-climb-above-200-day-moving-average",
        "all_text": "I am Stephen Davis, senior market strategist at Walsh Trading, Inc., Chicago, Illinois. You can reach me at 312-878-2391.\nToday's World Agricultural Supply and Demand Estimates (WASDE) report from the United States Department of Agriculture was positive, pushing corn prices above the 200-day moving average. See the chart below. In my opinion, any market above a 200-day moving average is bullish; prices will go higher by the end of the year and into the new year.\nThe report states “This month’s 2025/26 U.S. corn outlook is for greater exports and lower ending stocks. Exports are raised 125 million bushels to 3.2 billion reflecting shipments to date. Export inspection data showed robust foreign demand during November and implies total shipments during the September-November quarter will likely exceed 800 million bushels, surpassing the prior high set during 2007. With no supply changes and use rising, corn ending stocks are down 125 million bushels to 2.0 billion.”\nThe weekly chart below shows prices at 440.0 or above for five out of the last seven weeks. 2026 U.S. corn acreage is anticipated to be lower than 2025. However, higher prices could result in more acreage devoted to corn.\nAn option trade strategy is to sell three March 2026 corn puts at 4.4 ($675). With that premium in your account, buy one March 2026 corn at 450.0 call at 12.0 ($600). The puts you sell will pay for the call you buy. If and when corn rallies, you can buy the puts back.\nContact me anytime to discuss t",
        "authors": "None",
        "publish_date": "2025-12-10 01:35:54",
        "published_at_raw": "2025-12-10T01:35:54Z",
        "meta_site_name": "Barchart",
        "description": "I am Stephen Davis, senior market strategist at Walsh Trading, Inc., Chicago, Illinois. You can reach me at 312-878-2391. Today's World Agricultural Supply and Demand Estimates (WASDE) report from the United States Department of Agriculture was posit...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "74df847d8f98b8f516cc2d8be61700f6",
        "title": "Soybean Bulls Battling Back at Wednesday’s Midday",
        "doc_url": "https://www.barchart.com/story/news/36556309/soybean-bulls-battling-back-at-wednesdays-midday",
        "all_text": "Soybeans are back to higher trade on Wednesday, with contracts up 1 to 3 1/2 cents. The cmdtyView national average Cash Bean price is 3 1/4 cents lower at $10.20 1/4. Soymeal futures are steady to $1.10 in the red, with Soy Oil futures 10 to 46 points higher. There was another delivery for December soybean meal overnight, with 8 more issued for December soybean oil.\nUSDA reported private export sales of 136,000 MT of soybeans to China and 119,000 MT to unknown destinations, as well as 212,000 MT to unknown received in the reporting period. Another 120,000 MT of soybean meal was sold to Poland.\nAn aged CFTC Commitment of Traders report showed another 60,194 contracts added to the managed money net long position as of November 4, taking it to 178,683 contracts. The two week move was 143,354 contracts to the long side, the largest 2-week bull move on record. CFTC will release another report this afternoon, expediting the catch up on the backlog from the shutdown.\nJan 26 Soybeans are at $10.90 3/4, up 3 1/2 cents,\nNearby Cash is at $10.20 1/4, up 3 1/2 cents,\nMar 26 Soybeans are at $11.00 3/4, up 2 1/2 cents,\nMay 26 Soybeans are at $11.10, up 1 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-10 18:16:05",
        "published_at_raw": "2025-12-10T18:16:05Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are back to higher trade on Wednesday, with contracts up 1 to 3 1/2 cents. The cmdtyView national average Cash Bean price is 3 1/4 cents lower at $10.20 1/4. Soymeal futures are steady to $1.10 in the red, with Soy Oil futures 10 to 46 poin...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b00c19265306ec006e94a0181eab1bad",
        "title": "USDA restores food stamps for holders of special visas, which some states had paused",
        "doc_url": "https://www.bostonglobe.com/2025/12/10/metro/afghan-siv-holders-food-stamps-vermont/",
        "all_text": "A federal agency issued new guidance this week clarifying that certain immigrants with green cards remain eligible for SNAP benefits, even after a new law removed tens of thousands of others from the rolls.\nThe guidance, published Tuesday by the US Department of Agriculture, makes clear that Afghans who supported the American government before immigrating to the US may still receive food stamps if otherwise eligible. It reverses several states, including Vermont, that had already stopped providing the benefits to Afghans with Special Immigrant Visas.\n“It’s a bright spot,” said Meredith Owen Edwards, senior director of policy and advocacy for Refugee Council USA, noting that the development comes amid a raft of federal policy changes targeting Afghan immigrants.\nStates have been struggling to determine how to treat Afghan SIV-holders since July, when President Donald Trump signed the One Big Beautiful Bill Act. The law prevented refugees and asylees who have not had a green card for more than five years from receiving SNAP benefits.\nIn September, Vermont became the first state to interpret the law as excluding SIV-holders, who are granted green cards upon arrival. According to Owens Edwards, Rhode Island, Maryland, Indiana and Ohio followed suit. Other states, including Massachusetts, continued to provide SNAP benefits to SIV-holders, pending further word from the federal government.\nFEATURED VIDEO\nThe Vermont Department for Children and Families has said the new law led to 11",
        "authors": "None",
        "publish_date": "2025-12-10 23:51:27",
        "published_at_raw": "2025-12-10T23:51:27Z",
        "meta_site_name": "The Boston Globe",
        "description": "The new guidance from the US Department of Agriculture upends interpretations by officials in Vermont, Rhode Island other states",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bdb32fbeef97cc1876cf7391a9512c70",
        "title": "Wheat Falls Lower on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/36561686/wheat-falls-lower-on-wednesday",
        "all_text": "Wheat posted Wednesday weakness, as futures saw a delayed response to USDA’s added world production from Tuesday. Chicago SRW futures poste losses of a nickel in the front months on the midweek session. KC HRW futures saw losses of 3 to 4 cents on Wednesday. MPLS spring wheat as steady to a penny lower.\nThe weekly Export Sales report will get another catch-up release on Thursday morning. Analysts are looking for between 200,000 to 600,000 MT in sales for the week ending on 11/13.\nThe quarterly Flour Milling report from NASS was released on Wednesday, with the July-September wheat ground for flour totaling 231.4 million bushels. That was 8.5 million bushels above the April-June total, but down 1 mbu vs. the same period last year.\nCFTC released another update to the Commitment of Traders report this afternoon, indicating managed money cutting 11,852 contracts from their net short in CBT wheat to 58,761 contracts as of 11/10. In KC wheat, speculators trimmed 9,237 contracts from their net short to 33,217 contracts.\nDec 25 CBOT Wheat closed at $5.31 1/4, down 5 cents,\nMar 26 CBOT Wheat closed at $5.29 1/2, down 5 cents,\nDec 25 KCBT Wheat closed at $5.16 1/2, down 3 3/4 cents,\nMar 26 KCBT Wheat closed at $5.23 1/4, down 3 3/4 cents,\nDec 25 MGEX Wheat closed at $5.82 1/2, unch,\nMar 26 MGEX Wheat closed at $5.75 1/4, down 1 cent,",
        "authors": "None",
        "publish_date": "2025-12-10 23:21:37",
        "published_at_raw": "2025-12-10T23:21:37Z",
        "meta_site_name": "Barchart",
        "description": "Wheat posted Wednesday weakness, as futures saw a delayed response to USDA’s added world production from Tuesday. Chicago SRW futures poste losses of a nickel in the front months on the midweek session. KC HRW futures saw losses of 3 to 4 cents on We...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d6849ece1aa4748d09926eeeea1f0766",
        "title": "Wheat Futures Drop on World Production Outlook -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/wheat-futures-drop-on-world-production-outlook-daily-grain-highlights-ce7d50dada8ef524",
        "all_text": "By Kirk Maltais\n-- Wheat for March delivery fell 1% to $5.29 a bushel on the Chicago Board of Trade Wednesday, declining after Tuesday's WASDE report from the USDA showed higher production outlooks for the main competing countries to U.S. wheat.\n-- Corn for March delivery fell 0.9% to $4.44 1/4 a bushel.\n-- Soybeans for January delivery rose 0.4% to $10.92 a bushel.\nHIGHLIGHTS\nAbundant Fields: CBOT wheat fell Wednesday after the USDA projected robust production of wheat globally. In its December WASDE report, the USDA said that it expects higher wheat production out of a host of places, including the EU, Russia, Argentina and Australia.\nThe projections for increased output look to make the ability of U.S. wheat to compete on the global stage even tougher.\n\"Bulls need a story, and the market isn't getting much supportive news today,\" said Brady Huck of Advance Trading.\nSlate of Sales: The USDA reported new flash sales of soybeans and soy products, with China among the buyers. That gave soybeans support Wednesday. In a notice, the USDA said 136,000 metric tons of soybeans were sold to China for delivery in the 2025-26 marketing year.\nAn additional 119,000 tons of soybeans were sold to unknown destinations for 2025-26 delivery, and 120,000 tons of soybean meal were sold to Poland for delivery in 2025-26.\nQuiet Period: With the holidays coming up, trading volumes are generally low, which exacerbates big moves in prices.\n\"I think we will see the markets chop around now a little as",
        "authors": "None",
        "publish_date": "2025-12-10 21:29:17",
        "published_at_raw": "2025-12-10T21:29:17Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\n-- Wheat for March delivery fell 1% to $5.29 a bushel on the Chicago Board of Trade Wednesday, declining after Tuesday's WASDE report from the USDA showed higher production...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b864d7c0d2d9defbbc26b004cea5f95d",
        "title": "USDA approves South Carolina request to ban SNAP candy, soda",
        "doc_url": "https://eu.greenvilleonline.com/story/news/politics/2025/12/10/usda-sc-snap-soda-ban-candy/87702999007/",
        "all_text": "The U.S. Department of Agriculture approved South Carolina's request to remove candy and soft drinks from SNAP eligibility.\nGov. Henry McMaster's executive order defined four categories of food to be excluded: candy, soft drinks, energy drinks, and sweetened beverages.\nThe decision has drawn criticism from some state leaders for restricting food choices for low-income families.\nThe U.S. Department of Agriculture has approved a request from Gov. Henry McMaster to exclude candy and soft drinks from a list of foods that can be bought with Supplemental Nutrition Assistance Program benefits.\nMcMaster filed an executive order on Sept. 3 directing the South Carolina Department of Social Services to submit a waiver request to remove sugary drinks and candy from the SNAP eligible foods. The order defined four food categories — candy, soft drinks, energy drinks, and sweetened beverages — to be removed from SNAP eligibility.\nSouth Carolina's waiver, along with similar waivers from five other states, were approved by the USDA on Dec. 10. The South Carolina waiver lists Aug. 31, 2026, as the anticipated implementation date for the change.\n\"Thank you to President Trump and Secretary Rollins for approving our light-touch, common-sense approach to strengthen the SNAP program by promoting healthier outcomes for South Carolinians,\" McMaster said in a statement.\nMcMaster's September executive order requiring the state's social service agency to submit the waiver drew criticism. State Sen. Ed Su",
        "authors": "None",
        "publish_date": "2025-12-10 19:25:04",
        "published_at_raw": "2025-12-10T19:25:04Z",
        "meta_site_name": "Greenville News",
        "description": "South Carolina is one of 18 states that have sought to remove sugary drinks and candy from a list of SNAP-eligible foods",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "569217075bf630c848abef70e5b6de06",
        "title": "Federal government bars “junk foods” from SC SNAP program",
        "doc_url": "https://www.postandcourier.com/politics/snap-benefits-sc-food-stamps-usda-mcmaster/article_506f0d6a-9e45-460a-8c59-bc68f26c24ed.html",
        "all_text": "COLUMBIA — The U.S. Department of Agriculture has approved a South Carolina waiver to eliminate residents’ ability to buy “junk foods” like candy and soda with their taxpayer-funded benefits under the federal Supplemental Nutrition Assistance Program.\nFirst announced by Gov. Henry McMaster in August, the shift in policy would disallow beneficiaries of those benefits — colloquially known as food stamps — from using them to purchase foodstuffs “understood to have low nutritional value,” a definition which includes candies, sweetened beverages and South Carolina’s official hospitality beverage: sweet tea.\nThere are, however, specific carveouts for baking chocolate or sweetened protein bars.\n“Thank you to President (Donald) Trump and Secretary (Brooke) Rollins for approving our light-touch, common-sense approach to strengthen the SNAP program by promoting healthier outcomes for South Carolinians,” McMaster said in a Dec. 10 press statement lauding the changes. “By encouraging families to purchase healthy, nutritious food — and not junk food – we ensure federal taxpayer dollars are used to their maximum benefit and keep South Carolina at the forefront of the effort to Make America Healthy Again.”\nThe policy changes take effect in January.\nA national push\nThe policy was written in response to a broader push by U.S. Health Secretary Robert F. Kennedy Jr. to “make America healthy again,” eliminating subsidies for foods connected to weight gain and diabetes.\nBut the waivers are also a",
        "authors": "None",
        "publish_date": "2025-12-10 19:05:00",
        "published_at_raw": "2025-12-10T19:05:00Z",
        "meta_site_name": "Charleston Post and Courier",
        "description": "The USDA approved South Carolina’s waiver to restrict the purchase of candy, soda and other “junk foods” with Supplemental Nutrition Assistance Program benefits.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "adcd7fb50e3e5ed50ca77175e3af8360",
        "title": "Hogs Mostly Higher at Midday",
        "doc_url": "https://www.barchart.com/story/news/36556341/hogs-mostly-higher-at-midday",
        "all_text": "Lean hog futures are showing steady trade in soon to expire December, with other contracts up 5o cents to $1. USDA’s national base hog price was not reported due to packer submission issues. The CME Lean Hog Index was up 5 cents on December 8 at $81.89.\nUSDA’s pork carcass cutout value from the Wednesday AM report was 33 cents higher to $96.77 per cwt. The picnic, ham, and rib primals were the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 493,000 head, taking the week to date total to 981,000 head. That was 10,000 head above last week and 9,285 head above the same week last year.\nDec 25 Hogs are at $82.500, unch,,\nFeb 26 Hogs are at $82.450, up $0.575\nApr 26 Hogs is at $87.425, up $0.900,",
        "authors": "None",
        "publish_date": "2025-12-10 18:16:05",
        "published_at_raw": "2025-12-10T18:16:05Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are showing steady trade in soon to expire December, with other contracts up 5o cents to $1. USDA’s national base hog price was not reported due to packer submission issues. The CME Lean Hog Index was up 5 cents on December 8 at $81...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7c3c6694ce88f6563e7cd572918e53d0",
        "title": "USDA approves Missouri waiver to exclude candy, sodas from SNAP purchases",
        "doc_url": "https://abc17news.com/news/missouri/2025/12/10/usda-approves-missouri-waiver-to-exclude-candy-sodas-from-snap-purchases/",
        "all_text": "COLUMBIA, Mo. (KMIZ)\nThe USDA said Wednesday that it had approved Missouri's waiver seeking to exclude candy, soda and other junk food from purchase with Supplemental Nutrition Assistance Program funding.\nMissouri was one of six states receiving a waiver Wednesday, including Hawaii, North Dakota, South Carolina, Virginia and Tennessee. The USDA approved a waiver requested by Missouri Gov. Mike Kehoe in October.\nThe prohibition includes candy, prepackaged sweets such as snack cakes and juice drinks made from less than 50% fruit or vegetable juice. The changes begin in 2026.\n“We are incredibly thankful for Secretary Rollins’ approval of our waiver,” Gov. Mike Kehoe said of Agriculture Secretary Brooke Rollins in a news release. “Missouri is proud to partner with the Trump administration on the Make America Healthy Again movement as we refocus SNAP to maximize nutritional health for families while also supporting the abundant agricultural output of our state.”\nSo far, 18 governors have sought waivers, the release states.",
        "authors": "None",
        "publish_date": "2025-12-10 17:43:39",
        "published_at_raw": "2025-12-10T17:43:39Z",
        "meta_site_name": "ABC17News.com",
        "description": "MO Healthy SNAP Waiver - Oct 22 2025_0Download COLUMBIA, Mo. (KMIZ) The USDA said Wednesday that it had approved Missouri's waiver seeking to exclude candy, soda and other junk food from purchase with Supplemental Nutrition Assistance Program funding. Missouri was one of six states receiving a waiver Wednesday, including Hawaii, North Dakota, South Carolina, Virginia",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "33ea78ae47e92cde41c6021162e4d2fc",
        "title": "USDA grants waiver to ban candy, soft drinks from SNAP in South Carolina",
        "doc_url": "https://www.wistv.com/2025/12/10/usda-grants-waiver-ban-candy-soft-drinks-snap-south-carolina/",
        "all_text": "COLUMBIA, S.C. (WIS) - The United States Department of Agriculture said Wednesday that it has granted a request to ban candy, soft drinks and other items from food stamp programs in multiple states - including South Carolina.\nIn a statement released Wednesday, United States Secretary of Agriculture Brooke Rollins said that the waivers were granted as part of the Trump administration’s “Make America Healthy Again” initiative.\n“Under the MAHA initiative, we are taking bold, historic steps to reverse the chronic diseases epidemic that has taken root in this country for far too long,” Rollins said in a statement. “America’s governors are answering that call with courage and innovation, offering solutions that honor the generosity of the taxpayer while helping families live longer, healthier lives.”\nThe approval comes after Gov. Henry McMaster directed the state to submit a waiver request to the USDA in September “to exclude the purchase of candy, energy drinks, soft drinks, and sweetened beverages from the list of eligible foods under the Supplemental Nutrition Assistance Program (SNAP), also known as food stamps.”\nClick or tap here to read the full waiver that was submitted.\nMcMaster said in a statement Wednesday that the waiver approval “keeps South Carolina at the forefront” of healthy eating initiatives.\n“Thank you to President Trump and Secretary Rollins for approving our light-touch, common-sense approach to strengthen the SNAP program by promoting healthier outcomes for So",
        "authors": "None",
        "publish_date": "2025-12-10 17:40:05",
        "published_at_raw": "2025-12-10T17:40:05Z",
        "meta_site_name": "WIS10",
        "description": "South Carolina will soon be one of several states to ban the purchase of candy and soft drinks using SNAP.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6897179b3303324743be3618ce7642f8",
        "title": "The clean water dividend: Organic farming cuts pollution while boosting yields",
        "doc_url": "https://www.naturalnews.com/2025-12-10-organic-farming-cuts-pollution-while-boosting-yields.html",
        "all_text": "A new USDA study finds organic corn-soybean systems reduce nitrogen pollution by 50% while matching or exceeding conventional yields.\nNitrogen runoff from chemical-intensive agriculture contaminates drinking water, especially burdening small rural communities with high cleanup costs.\nOrganic farming practices build soil health, increase biodiversity and enhance resilience to climate extremes like drought.\nDecades of research confirm organic systems protect water quality, use less energy and can be more profitable for farmers.\nThe findings add to a robust body of evidence advocating for a transition to organic agriculture to safeguard public and environmental health.\nIn a landmark finding with profound implications for America’s heartland, U.S. Department of Agriculture (USDA) researchers report that organic farming systems can dramatically reduce a major source of water pollution while producing crop yields on par with, or even exceeding, conventional chemical-intensive methods. Published in the Journal of Environmental Quality, the seven-year study conducted in Iowa reveals that a four-year organic crop rotation reduced nitrogen loads leaching into waterways by 50% compared to standard corn-soybean fields. This pollution, primarily from synthetic fertilizer runoff, contaminates drinking water, harms aquatic ecosystems and contributes to greenhouse gas emissions. The research provides a powerful, evidence-based counterpoint to the long-held assumption that high productivity n",
        "authors": "None",
        "publish_date": "2025-12-10 17:25:14",
        "published_at_raw": "2025-12-10T17:25:14Z",
        "meta_site_name": "Natural News",
        "description": "A new USDA study finds organic corn-soybean systems reduce nitrogen pollution by 50% while matching or exceeding conventional yields. Nitrogen runoff from chemical-intensive agriculture contaminates drinking water, especially burdening small rural communities with high cleanup costs. Organic farming practices build soil health, increase biodiversity and enhance resilience to climate extremes like drought. Decades of research […]",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a05526b782dbac41fd87320f1cfc0ee5",
        "title": "Grains Mixed This Morning | Wednesday, Dec. 10, 2025",
        "doc_url": "https://www.agriculture.com/grains-mixed-this-morning-or-wednesday-dec-10-2025-11865892",
        "all_text": "As of 9:14 a.m. CT, March corn was down 1¾¢ at $4.46¼ per bushel.\nJanuary soybeans were up less than a penny at $10.87¾ per bushel.\nMarch CBOT wheat was down 5¢ at $5.29½ per bushel. March Kansas City wheat was down 2¾¢ at $5.24¼ per bushel. March Minneapolis wheat was unchanged at $5.76¼.\nThis morning, Cole Raisbeck, commodities broker with Kluis Commodity Advisors, noted: “In quiet markets, it becomes even more important to watch local basis and spreads, since those can provide opportunities. That’s what we’ll be keeping an eye on as we move through the rest of December.”\nUSDA announced several new export sales this morning:\nChina is buying 136,000 metric tons of soybeans for the 2025/2026 marketing year\nUnknown destinations are buying 119,000 metric tons of soybeans for the 2025/2026 marketing year\nUnknown destinations are buying 212,000 metric tons of soybeans for the 2025/2026 marketing year\nPoland is buying 120,000 metric tons of soybean cake and meal for the 2025/2026 marketing year.\nAs of 9:15 a.m. CT, January feeder cattle were up $1.98 at $337.48 per hundredweight (cwt). February live cattle were up 70¢ at $227.65 per cwt. As of 9:14 a.m. CT, February lean hogs were up 65¢ at $82.53 per cwt.\nJanuary crude oil was down 35¢ at $57.90 per barrel.\nThe U.S. Dollar Index December contract was down to 99.03.\nAs of 9:10 a.m. CT, the S&P 500 Index was up 1.51 points, and the Dow Jones Industrial Average was up 113.26 points.\nPublished: 9:47 a.m. CT",
        "authors": "None",
        "publish_date": "2025-12-10 15:47:48",
        "published_at_raw": "2025-12-10T15:47:48Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA announced several new export sales this morning.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "943265507d8fd92ea2d3280bf9f4eeb9",
        "title": "Hogs Look to Wednesday Trade",
        "doc_url": "https://www.barchart.com/story/news/36550024/hogs-look-to-wednesday-trade",
        "all_text": "Lean hog futures closed Tuesday with mixed trade, as December was up 20 cents another other contracts down 45 to 55 cents. Open interest was down 2,056 contracts. USDA’s national base hog price was reported at $71.43 on Tuesday afternoon, up $1.39 from the day prior. The CME Lean Hog Index was back up 3 cents on December 5 at $81.84.\nUSDA’s pork carcass cutout value from the Tuesday PM report was back up 93 cents to $96.44 per cwt. The picnic, ham, and belly primals were the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 493,000 head, taking the week to date total to 981,000 head. That was 10,000 head above last week and 9,285 head above the same week last year.\nDec 25 Hogs closed at $82.500, up $0.200,\nFeb 26 Hogs closed at $81.875, down $0.525\nApr 26 Hogs closed at $86.525, down $0.450,",
        "authors": "None",
        "publish_date": "2025-12-10 13:25:49",
        "published_at_raw": "2025-12-10T13:25:49Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed Tuesday with mixed trade, as December was up 20 cents another other contracts down 45 to 55 cents. Open interest was down 2,056 contracts. USDA’s national base hog price was reported at $71.43 on Tuesday afternoon, up $1.39 f...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "09466a3e31e7b82b4ccb4ced7fd24cc9",
        "title": "Cotton Starting Wednesday with Strength",
        "doc_url": "https://www.barchart.com/story/news/36550034/cotton-starting-wednesday-with-strength",
        "all_text": "Cotton price action is up 18 to 25 points so far on Wednesday. Futures posted Tuesday gains of 10 to 19 points at the close, as contracts held up despite a mildly bearish USDA report. Crude oil futures were down 49 cents per barrel at $58.39 on the day, with the US dollar index $0.114 higher to $99.175.\nUSDA’s Crop Production report left acreage alone, but raised yield by 10 lbs/acre to 929 lbs. That took production up 150,000 bales to 14.27 million bales. In the WASDE, there were some adjustments in the unaccounted and domestic use to take projected ending stocks up 200,000 bales to 4.5 million. The cash average price was trimmed by 2 cents to 60 cents/lb. The world stocks were left steady, as just a 40,000 bale increase was noted at 75.97 million bales.\nCotton Ginnings data showed 8.645 million RB of cotton ginned as of December 1, a 10.25% decline from the same date last year.\nCommitment of Traders data for the week ending on November 4 showed specs trimming 10,311 contracts from their net short position in that week to 63,782 contracts.\nThe Monday online auction from The Seam saw sales on 5,608 bales at an average price of 60.2 cents/lb. The Cotlook A Index was down 25 points on December 8 at 73.95 cents. ICE certified cotton stocks were steady on 12/8 with the certified stocks level at 13,971 bales. The Adjusted World Price was updated last week to 51.28 cents/lb last week, up 51 points from the previous week.\nMar 26 Cotton closed at 63.86, up 18 points, currently up 23 ",
        "authors": "None",
        "publish_date": "2025-12-10 13:25:49",
        "published_at_raw": "2025-12-10T13:25:49Z",
        "meta_site_name": "Barchart",
        "description": "Cotton price action is up 18 to 25 points so far on Wednesday. Futures posted Tuesday gains of 10 to 19 points at the close, as contracts held up despite a mildly bearish USDA report. Crude oil futures were down 49 cents per barrel at $58.39 on the d...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e4e3b1331c62b8cb63796c7246406c7c",
        "title": "South Carolina SNAP waiver approved by USDA to restrict soda and candy purchases",
        "doc_url": "https://www.wltx.com/article/news/local/usda-south-carolina-waiver-candy-sugary-drinks-snap/101-84b74a91-6fac-4ed7-9b7e-e69e72e21f04",
        "all_text": "COLUMBIA, S.C. — The U.S. Department of Agriculture (USDA) has approved Governor Henry McMaster’s waiver to exclude the purchase of candy, energy drinks, soft drinks and sweetened beverages from the list of eligible foods under the Supplemental Nutrition Assistance Program (SNAP), also known as food stamps, in South Carolina.\nThe announcement came on Wednesday from the USDA, which approved South Carolina and five other states for the waiver.\nGovernor McMaster announced his intent to pursue the waiver in August and issued an executive order in September directing the South Carolina Department of Social Services to submit the waiver request.\nThe order stated that they hope to implement the change by Aug. 31, 2026.\nState and national health data were cited in support of the policy change. According to the Centers for Disease Control and Prevention, South Carolina has one of the highest adult obesity rates in the nation, with about 36% of adults classified as obese. A recent report from the Annie E. Casey Foundation found that 38% of children in South Carolina between the ages of 10 and 17 are considered obese.\nAccording to the National Health and Nutrition Examination Survey, SNAP enrollees consume significantly more sugary drinks than nonrecipients, with children enrolled in SNAP consuming 43% more than children with similar incomes who are not enrolled in SNAP.\n“By encouraging families to purchase healthy, nutritious food – and not junk food – we ensure federal taxpayer dollar",
        "authors": "None",
        "publish_date": "2025-12-10 12:50:00",
        "published_at_raw": "2025-12-10T12:50:00Z",
        "meta_site_name": "WLTX.com",
        "description": "South Carolina won federal approval to block SNAP purchases of candy, soda and energy drinks, with the change expected to take effect by Aug. 31, 2026.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6b455a7fc8dd04dd6f55d6b111cc928b",
        "title": "5 mistakes with broccoli that completely destroy its nutrition",
        "doc_url": "https://timesofindia.indiatimes.com/life-style/food-news/5-mistakes-with-broccoli-that-completely-destroy-its-nutrition/photostory/125889929.cms",
        "all_text": "When it comes to cruciferous vegetables, broccoli is considered to be one of the nutritious vegetables. Rich in vitamin C, it is known for its immune-boosting properties, and vitamin K, which is crucial for bone health. Also, it is rich in fiber that helps promote digestive health. As per a study published by the National Library of Medicine, broccoli also supports cardiovascular health. A Phase 1 clinical trial demonstrated that consuming 100 grams of fresh broccoli sprouts daily over a week provided cardiovascular benefits. It has also been shown to contain bioactive compounds such as glucosinolates, sulforaphane, and indole-3-carbinol, all of which have been shown to have significant health-promoting effects. According to the United States Department of Agriculture (USDA), a cup of broccoli contains 3% to 3.5% of a person’s daily need for calcium, 45–54% of daily need for vitamin C, and 64–86% of their daily need for vitamin K. It is also rich in antioxidant called sulforaphane, which is said to contribute to reducing inflammation and combating oxidative stress. As per experts, broccoli also offers protection against certain cancers, support heart health, and contribute to overall well-being. But, did you know that if not cooked right, broccoli might lose all its nutritional benefits? This piece of information explores five common mistakes people commit with broccoli that completely destroy its nutrition.\nAs per the study titled Effects of different cooking methods on heal",
        "authors": "None",
        "publish_date": "2025-12-10 11:24:12",
        "published_at_raw": "2025-12-10T11:24:12Z",
        "meta_site_name": "Times of India",
        "description": "When it comes to cruciferous vegetables, broccoli is considered to be one of the nutritious vegetables. Rich in vitamin C, it is known for its immune-boosting properties, and vitamin K, which is crucial for bone health. Also, it is rich in fiber that helps promote digestive health. As per a study published by the National Library of Medicine, broccoli also supports cardiovascular health. A Phase 1 clinical trial demonstrated that consuming 100 grams of fresh broccoli sprouts daily over a week provided cardiovascular benefits. It has also been shown to contain bioactive compounds such as glucosinolates, sulforaphane, and indole-3-carbinol, all of which have been shown to have significant health-promoting effects. According to the United States Department of Agriculture (USDA), a cup of broccoli contains 3% to 3.5% of a person’s daily need for calcium, 45–54% of daily need for vitamin C, and 64–86% of their daily need for vitamin K. It is also rich in antioxidant called sulforaphane, which is said to contribute to reducing inflammation and combating oxidative stress. As per experts, broccoli also offers protection against certain cancers, support heart health, and contribute to overall well-being. But, did you know that if not cooked right, broccoli might lose all its nutritional benefits? This piece of information explores five common mistakes people commit with broccoli that completely destroy its nutrition.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]