[
    {
        "id": "665062eae479b0052405fbd53a19619e",
        "title": "Corn Rallies Higher on Thursday",
        "doc_url": "https://www.barchart.com/story/news/36702528/corn-rallies-higher-on-thursday",
        "all_text": "Corn futures closed the Thursday session with contracts up 4 to 4 ½ cents across the front months. Bulls were battling back after spillover pressure from the other grains earlier this week. The CmdtyView national average Cash Corn price was up 4 cents to $4.00 3/4.\nExport Sales data was updated for the week of 11/27 this morning, with 1.792 MMT sold in that week, on the higher side of trade estimates of between 1-2 MMT of corn sales. That was a 3-week low but still 3.5% above the same week last year.\nExport sale commitments were 29.7% larger than the same period last year at 44.35 MMT, or 1.746 billion bushels. That is a record buying pace for corn exports.\nMar 26 Corn closed at $4.44 1/2, up 4 cents,\nNearby Cash was $4.00 3/4, up 4 cents,\nMay 26 Corn closed at $4.52 1/4, up 4 1/2 cents,\nJul 26 Corn closed at $4.58, up 4 1/2 cents,",
        "authors": "None",
        "publish_date": "2025-12-18 22:42:53",
        "published_at_raw": "2025-12-18T22:42:53Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Thursday session with contracts up 4 to 4 ½ cents across the front months. Bulls were battling back after spillover pressure from the other grains earlier this week. The CmdtyView national average Cash Corn price was up 4 cent...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4f098d1c19d0cd3b7ab353f02e9842aa",
        "title": "Corn Futures Climb on Signs of Stronger Demand -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/corn-futures-climb-on-signs-of-stronger-demand-daily-grain-highlights-ce7d50dcd18ff425",
        "all_text": "By Kirk Maltais\n--Corn for March delivery rose 0.8% to $4.44 1/4 a bushel on the Chicago Board of Trade Thursday, as competitively-priced corn exports are finding increased demand from global buyers.\n--Wheat for March delivery rose 0.4% to $5.08 1/2 a bushel.\n--Soybeans for January delivery fell 0.6% to $10.51 1/4 a bushel.\nHIGHLIGHTS\nCorn Pop: Multiple signs pointing to stronger demand for U.S. corn supported futures Thursday. The record-large harvest in the past crop year has made corn exports competitively priced versus other alternatives around the world. Domestically, a record rate of ethanol production is also providing support. \"As long as U.S. corn FOB values remain competitively priced globally, demand should remain solid,\" Linn & Associates' Brian Pullam said.\nMixed Showing: The USDA's latest export sales report through Nov. 27 shows 1.8 million metric tons of corn were sold across the 2025/26 and 2026/27 marketing years. While demand supported corn futures, soybean futures were pressured due to disappointment about export sales. \"Beans haven't been able to find any support despite the promise of Chinese buying and a U.S. carryout that is not exactly loose,\" said Charlie Sernatinger of Marex.\nINSIGHT\nSmooth Sailing: Black Sea agricultural consultancy SovEcon raised its outlook for Russian wheat production due to a better-than-expected showing for yields in Siberia. The firm now forecasts 2025 Russian wheat production of 88.8 million metric tons, up 200,000 tons from",
        "authors": "None",
        "publish_date": "2025-12-18 20:59:17",
        "published_at_raw": "2025-12-18T20:59:17Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\n--Corn for March delivery rose 0.8% to $4.44 1/4 a bushel on the Chicago Board of Trade Thursday, as competitively-priced corn exports are finding increased demand from global...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "265d6f7ab6842269ae19b49d53c8237d",
        "title": "How Much Higher Will Corn Prices Climb?",
        "doc_url": "https://www.barchart.com/story/news/36694678/how-much-higher-will-corn-prices-climb",
        "all_text": "March corn (ZCH26) futures present a buying opportunity on more price strength.\nSee on the daily bar chart for March corn futures that prices have this week rebounded from a strong support area and that a bullish double-bottom reversal pattern may now be forming.\nFundamentally, export and domestic demand for U.S. corn has been solid the past few months.\nA move in March corn futures above chart resistance at $4.45 would give the bulls more power and it would also become a buying opportunity. The upside price objective would be $4.75 or above. Technical support, for which to place a protective sell stop just below, is located at the November low of $4.34 ½.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hypothetical in nature.\nHere is what the Commodity Futures Trading Commission (CFTC) has said about futures trading (and I agree 100%):\nTrading commodity futures and options is not for everyone. IT IS A VOLATILE, COMPLEX AND RISKY BUSINESS. Before you invest any money in futures or options contracts, you should consider your financial experience, goals and financial resources, and know how much you can afford to lose above and beyond your initial payment to a broker. You should u",
        "authors": "None",
        "publish_date": "2025-12-18 16:40:46",
        "published_at_raw": "2025-12-18T16:40:46Z",
        "meta_site_name": "Barchart",
        "description": "March corn futures present a buying opportunity on more price strength.",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "555881f0f08b3b95638f1c246176327c",
        "title": "Corn Bulls Continue Back to Push Higher on Thursday Morning",
        "doc_url": "https://www.barchart.com/story/news/36689987/corn-bulls-continue-back-to-push-higher-on-thursday-morning",
        "all_text": "Corn price action is steady to up 1 ¾ cents so far. Futures posted gains of 2 to 4 ½ cents on Wednesday. Preliminary open interest was up 2,852 contracts. Demand continues to be solid, with record ethanol and exports. The CmdtyView national average Cash Corn price as up 4 cents to $3.96 3/4.\nExport Sales data will be updated for the week of 11/27 this morning, with traders looking for between 1-2 MMT of corn sales.\nEIA data from Wednesday showed another record ethanol corn grind for the week ending on December 12, up 26,000 barrels per day week/week to 1.131 million bpd. Despite the increased output, stocks saw a draw of 157,000 barrels to 22.353 million barrels. That came as ethanol exports were up 66,000 bpd to 191,000 bpd, with refiner inputs of ethanol rising 55,000 barrels per day from the week prior to 906,000 bpd.\nCommitment of Traders data, now as of December 2, showed spec funds adding back 34,142 contracts to the long side in that week, mainly on short covering. That flipped their net position to long in corn futures and options to 23,270 contracts as of that date\nBrazil’s December corn exports are estimated to total 6.35 MMT according to ANEC, a 0.05 MMT increase from the week prior.\nMar 26 Corn closed at $4.40 1/2, up 4 cents, currently up 1 3/4 cents\nNearby Cash was $3.96 3/4, up 4 cents,\nMay 26 Corn closed at $4.47 3/4, up 3 1/4 cents, currently up 1 1/2 cents\nJul 26 Corn closed at $4.53 1/2, up 2 1/2 cents, currently up 1 1/4 cents",
        "authors": "None",
        "publish_date": "2025-12-18 13:36:30",
        "published_at_raw": "2025-12-18T13:36:30Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is steady to up 1 ¾ cents so far. Futures posted gains of 2 to 4 ½ cents on Wednesday. Preliminary open interest was up 2,852 contracts. Demand continues to be solid, with record ethanol and exports. The CmdtyView national average C...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1e4770ad9c4f2e57945dd1483650fda9",
        "title": "‘Sold three sacks of wheat to watch the match’: Heartbroken fans demand full refund after India vs South Africa 4th T20I gets called off due to excessive fog in Lucknow",
        "doc_url": "https://crickettimes.com/2025/12/sold-three-sacks-of-wheat-to-watch-the-match-heartbroken-fans-demand-full-refund-after-india-vs-south-africa-4th-t20i-gets-called-off-due-to-excessive-fog-in-lucknow/",
        "all_text": "The fourth T20I between India and South Africa at Lucknow’s Ekana Cricket Stadium was abandoned without a single ball being bowled on Wednesday night, after dense fog and smog made playing conditions unsafe. The late decision sparked widespread frustration among fans, many of whom packed the stadium in anticipation of an exciting contest.\nThe match was scheduled for a 7 pm IST start, but worsening visibility throughout the evening prevented the toss from taking place. Despite multiple delays and inspections, conditions failed to improve, forcing officials to call off the game.\nUmpires conduct multiple inspections before calling off the match\nAs fog thickened over the ground, umpires conducted six separate inspections in an attempt to salvage the contest. Ground staff and match officials waited in the hope that conditions would clear enough for at least a shortened game.\nHowever, even after more than two hours of delays, visibility remained well below safe standards for players and officials. At approximately 9:25 pm, the decision was finally taken to abandon the match entirely.\nWith no result possible, the series scoreline remains 2-1 in India’s favour, setting up a decisive fifth T20I in Ahmedabad.\nFans vent anger outside Ekana Stadium\n“Refund, refund” chants echo after abandonment\nThe abandonment triggered angry scenes outside the stadium, where heartbroken supporters gathered holding their tickets and demanding full refunds. Many fans accused organisers of poor planning, q",
        "authors": "None",
        "publish_date": "2025-12-18 07:00:45",
        "published_at_raw": "2025-12-18T07:00:45Z",
        "meta_site_name": "The Cricket Times",
        "description": "Fans heartbroken as India vs South Africa 4th T20I in Lucknow gets called off due to excessive fog. India are currently 2-1 up in the five-match series.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "54017700510597056e574dba090c0ecc",
        "title": "'Sold Wheat, Came From Agra': Angry Fans Demand Refund After IND-SA T20I In Lucknow Abandoned",
        "doc_url": "https://www.news18.com/cricket/sold-wheat-came-from-agra-angry-fans-demand-refund-after-ind-sa-t20i-in-lucknow-abandoned-ws-bno-9777219.html",
        "all_text": "The fourth T20I between India and South Africa in Lucknow was abandoned without toss due to excessive fog.\nSerious questions are being raised over the scheduling of the ongoing five-match T20I series between India and South Africa after a contest in Lucknow was abandoned without a toss thanks to “excessive fog\". Naturally, the fans who had gathered at the venue for the match were left disappointed, with several demanding refunds.\nThe contest was scheduled to get underway from 7 PM IST but the toss was delayed due to low visibility, with the stadium enveloped by a thick blanket of fog. However, after as many as six inspections, the match was eventually called off.\nThe players of the two teams had started warming up prior to the toss but left the field for their respective dressing rooms. India all-rounder Hardik Pandya was even spotted wearing a mask when on the field.\nOne fan claimed he sold wheat to watch the game but now wants a refund.\n“I sold three sacks of wheat and came here to watch this match. I want my money back,\" news agency ANI quoted one spectator as saying.\nAnother fan said, “It would have been better if the match had been scheduled earlier in the day. Tickets and reimbursement are irrelevant. We wanted to see the match, see our Indian Cricket Team.\"\nMatches held at most north zone venues have historically been affected by weather conditions during the winter months.\nAs per the Board of Control for Cricket in India’s (BCCI) policy, refunds (minus fees) are issue",
        "authors": "None",
        "publish_date": "2025-12-18 03:28:19",
        "published_at_raw": "2025-12-18T03:28:19Z",
        "meta_site_name": "News18",
        "description": "The fourth T20I between India and South Africa in Lucknow was abandoned without toss due to excessive fog.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2c366686880b719ae8c31cb28e3f59f0",
        "title": "'Sold Wheat, Came From Agra': Angry Fans Demand Refund After IND-SA T20I In Lucknow Abandoned",
        "doc_url": "https://www.news18.com/cricket/sold-wheat-came-from-agra-angry-fans-demand-refund-after-ind-sa-t20i-in-lucknow-abandoned-9777219.html",
        "all_text": "The fourth T20I between India and South Africa in Lucknow was abandoned without toss due to excessive fog.\nSerious questions are being raised over the scheduling of the ongoing five-match T20I series between India and South Africa after a contest in Lucknow was abandoned without toss thanks to “excessive fog\". Naturally, the fans who had gathered at the venue for the match, were left disappointed with several demanding refunds.\nThe contest was scheduled to get underway from 7 PM IST but the toss was delayed due to low visibility with the stadium enveloped by a thick blanket of fog. However, after as many as six inspections, the match was eventually called off.\nThe players of the two teams had started warming up prior to the toss but left the field for their respective dressing rooms. India allrounder Hardik Pandya was even spotted wearing a mask when on the field.\nOne fan claimed he sold wheat to watch the game but now wants a refund.\n“I sold three sacks of wheat and came here to watch this match. I want my money back,\" news agency ANI quoted one spectator as saying.\nAnother fan said, “It would have been better if the match had been scheduled earlier in the day. Tickets and reimbursement are irrelevant. We wanted to see the match, see our Indian Cricket Team.\"\nFinal T20I In Ahmedabad\nIndia lead the five-match series 2-1 following their victories in Cuttack and Dharamsala. The Suryakumar Yadav-led side now cannot lose the series with the fifth and final T20I to be held on Frid",
        "authors": "None",
        "publish_date": "2025-12-18 03:28:19",
        "published_at_raw": "2025-12-18T03:28:19Z",
        "meta_site_name": "News18",
        "description": "The fourth T20I between India and South Africa in Lucknow was abandoned without toss due to excessive fog.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "91e95d0fdbc9a1e610a9000480466bc1",
        "title": "Hogs Post Gains on Thursday",
        "doc_url": "https://www.barchart.com/story/news/36702568/hogs-post-gains-on-thursday",
        "all_text": "Lean hog futures closed with Thursday gains of 95 cents to $1.12. USDA’s national base hog price was down $1.06 in the Thursday afternoon report at $68.65. The CME Lean Hog Index was up 57 cents on December 16 at $83.87.\nUSDA’s Export Sales report showed 30,646 MT of pork sold in the week ending on 11/27 for 2025, with 2,351 MT for 2026 delivery. Shipments were tallied at a 9-week low at 27,091 MT.\nUSDA’s pork carcass cutout value from the Thursday PM report was $$1.11 lower to $97.43 per cwt. The loin and rib primals were the only reported higher. USDA estimated federally inspected hog slaughter for Thursday at 495,000 head, with the weekly total at 1.957 million head. That was 8,000 head below last week and 10,755 head above the same week last year.\nFeb 26 Hogs closed at $84.125, up $1.125,\nApr 26 Hogs closed at $88.950, up $1.000\nMay 26 Hogs closed at $92.875, up $0.950,",
        "authors": "None",
        "publish_date": "2025-12-18 22:42:53",
        "published_at_raw": "2025-12-18T22:42:53Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed with Thursday gains of 95 cents to $1.12. USDA’s national base hog price was down $1.06 in the Thursday afternoon report at $68.65. The CME Lean Hog Index was up 57 cents on December 16 at $83.87. USDA’s Export Sales report s...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "30e6202c28ae9aa38bbe5c2f7ca375d2",
        "title": "Cattle Fall Back on Thursday Ahead of Friday’s USDA Report",
        "doc_url": "https://www.barchart.com/story/news/36702558/cattle-fall-back-on-thursday-ahead-of-fridays-usda-report",
        "all_text": "Live cattle futures were down 97 cents to $1.90 on Thursday. There were 20 deliveries retendered at 1 cent on Thursday. Cash trade got kicked off on Thursday, with a few early sales at $228 across the country and dressed sales have been $356-358. The Thursday Fed Cattle Exchange online auction showed no sales on the 1,708 head listed and bids of $225-226.50 live and $350.50 dressed. Feeder cattle futures were down $1.25 to $1.90 at the Thursday close. The CME feeder cattle index from December 17 was up 26 cents from the day prior at $350.05.\nWeekly Export Sales data showed just 1,908 MT of beef sold for 2025 delivery in the week ending on 11/27, with 12,087 MT for 2026. Export shipments were 10,869 MT during that week, a 3-week low.\nThe December Cattle on Feed report will be released on Friday, with traders looking for November placements to be down 8% from last year and marketings with a 11.3% drop. December 1 on feed is expected to be 1.6% below last year.\nUSDA Wholesale Boxed Beef prices were mixed in the Thursday afternoon report, with the Chc/Sel spread widening to $13.31. Choice boxes were up $1.19 to $357.28, while Select was $2.46 lower at $343.97. USDA federally inspected cattle slaughter was estimated at 123,000 head on Thursday, with the weekly total at 472,000 head. That was 12,000 head below last week and 11,643 head shy of the same week last year.\nDec 25 Live Cattle closed at $228.425, down $1.875,\nFeb 26 Live Cattle closed at $228.400, down $1.150,\nApr 26 Live ",
        "authors": "None",
        "publish_date": "2025-12-18 22:42:53",
        "published_at_raw": "2025-12-18T22:42:53Z",
        "meta_site_name": "Barchart",
        "description": "Live cattle futures were down 97 cents to $1.90 on Thursday. There were 20 deliveries retendered at 1 cent on Thursday. Cash trade got kicked off on Thursday, with a few early sales at $228 across the country and dressed sales have been $356-358. The...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "522cd9bc3dd148631cf26a1261831cc5",
        "title": "USDA grant helps Texas Tech vet school with rural, ag initiative",
        "doc_url": "https://www.lubbockonline.com/story/news/2025/12/18/usda-grant-helps-texas-tech-vet-school-with-rural-ag-initiative/87830825007/",
        "all_text": "Texas Tech University’s School of Veterinary Medicine is working to tackle the nationwide shortage of food animal veterinarians with the creation of the school’s first food animal residency program designed to strengthen veterinary services in rural and agricultural communities.\nJennifer Koziol, associate professor of food animal medicine and surgery, is leading the groundbreaking initiative made possible by a $250,000 U.S. Department of Agriculture (USDA) Veterinary Service Grant, the university announced in a news release Thursday.\n“The lack of veterinary coverage in rural regions has far-reaching consequences, from diminished livestock health and welfare to threats against food security and community economic viability,” Koziol said. “The USDA project aligns with national strategic goals of supporting rural prosperity and ensuring a safe, nutritious food supply.”\nThe residency, which is planned to launch in 2026, will recruit early-career veterinarians and provide them with advanced clinical and research training to help them become future educators in food animal medicine. By mentoring veterinarians into teaching roles, the program aims to meet a critical need for more qualified food animal faculty at veterinary schools as institutions struggle to recruit and retain specialists.\nEducators trained through the residency will work to influence more students to pursue careers in food animal, large animal or mixed animal practice, helping alleviate the shortage of practitioner",
        "authors": "None",
        "publish_date": "2025-12-18 19:47:34",
        "published_at_raw": "2025-12-18T19:47:34Z",
        "meta_site_name": "Lubbock Avalanche-Journal",
        "description": "The USDA awarded Texas Tech's vet school in Amarillo a $250K grant aimed at strengthening veterinary services in rural and ag communities. Here's how it will help.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "405f3d0e8d3a5d7ceb1ea6a10cd60539",
        "title": "USDA grant helps Texas Tech vet school with rural, ag initiative",
        "doc_url": "https://www.amarillo.com/story/news/2025/12/18/usda-grant-helps-texas-tech-vet-school-with-rural-ag-initiative/87830825007/",
        "all_text": "Texas Tech University’s School of Veterinary Medicine is working to tackle the nationwide shortage of food animal veterinarians with the creation of the school’s first food animal residency program designed to strengthen veterinary services in rural and agricultural communities.\nJennifer Koziol, associate professor of food animal medicine and surgery, is leading the groundbreaking initiative made possible by a $250,000 U.S. Department of Agriculture (USDA) Veterinary Service Grant, the university announced in a news release Thursday.\n“The lack of veterinary coverage in rural regions has far-reaching consequences, from diminished livestock health and welfare to threats against food security and community economic viability,” Koziol said. “The USDA project aligns with national strategic goals of supporting rural prosperity and ensuring a safe, nutritious food supply.”\nThe residency, which is planned to launch in 2026, will recruit early-career veterinarians and provide them with advanced clinical and research training to help them become future educators in food animal medicine. By mentoring veterinarians into teaching roles, the program aims to meet a critical need for more qualified food animal faculty at veterinary schools as institutions struggle to recruit and retain specialists.\nEducators trained through the residency will work to influence more students to pursue careers in food animal, large animal or mixed animal practice, helping alleviate the shortage of practitioner",
        "authors": "None",
        "publish_date": "2025-12-18 19:47:34",
        "published_at_raw": "2025-12-18T19:47:34Z",
        "meta_site_name": "Amarillo Globe-News",
        "description": "The USDA awarded Texas Tech's vet school in Amarillo a $250K grant aimed at strengthening veterinary services in rural and ag communities. Here's how it will help.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ad2c404ce3c72dd288dc48f7191f9a1e",
        "title": "Soybeans Extending Weakness to Thursday",
        "doc_url": "https://www.barchart.com/story/news/36697244/soybeans-extending-weakness-to-thursday",
        "all_text": "Soybeans are trading with Thursday losses of 4 to 5 ¼ cents at midday. The cmdtyView national average Cash Bean price is 4 1/4 cents lower at $9.83. Soymeal futures are $1 to $1.30 lower, with Soy Oil futures down 20 to 26 points.\nUSDA reported a private export sale of 114,000 MT of soybeans to unknown destinations this morning.\nWeekly Export Sales data from this morning showed 1.106 MMT in soybean sales for the week ending on 11/27, in the middle of 0.6-2 MMT estimates. That was a drop of 52.3% from the week prior and is less than half of the same week last year.\nMeal sales totaled 436,046 MT, nearing the top end of 200,000-450,000 MT estimates. Bean oil sales were tallied at 25,516 MT, exceeding the 5,000-25,000 MT in trade expectations.\nAnother delayed update to the backlogged CFTC reports showed managed money adding just 1,137 contracts to their net long as of the week ending on 12/2. That net long was 215,428 contracts in soybean futures and options.\nJan 26 Soybeans are at $10.54, down 4 1/4 cents,\nNearby Cash is at $9.83, down 4 1/4 cents,\nMar 26 Soybeans are at $10.63 1/2, down 5 1/4 cents,\nMay 26 Soybeans are at $10.74 3/4, down 5 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-18 18:23:51",
        "published_at_raw": "2025-12-18T18:23:51Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are trading with Thursday losses of 4 to 5 ¼ cents at midday. The cmdtyView national average Cash Bean price is 4 1/4 cents lower at $9.83. Soymeal futures are $1 to $1.30 lower, with Soy Oil futures down 20 to 26 points. USDA reported a pri...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "44dd528ce75fee48e08372758cee7ca3",
        "title": "Hog Traders See Weakness on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/36690033/hog-traders-see-weakness-on-wednesday",
        "all_text": "Lean hog futures posted losses of $1.45 to $1.80 on the Wednesday session. OI dropped 10,642 contracts. USDA’s national base hog price was up 15 cents in the Wednesday afternoon report at $69.71. The CME Lean Hog Index was up 31 cents on December 15 at $83.30.\nCFTC data, now just 2 weeks old, showed spec funds at a net long of 46,650 contracts in lean hog futures and options as of the week ending on December 2. That was a drop of 3,543 contracts from the week prior.\nUSDA’s pork carcass cutout value from the Tuesday PM report was 2 cents lower to $98.54 per cwt. The butt and picnic primals were the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 494,000 head, with the weekly total at 1.462 million head. That was 9,000 head below last week and 927 head above the same week last year.\nFeb 26 Hogs closed at $83.000, down $1.775,\nApr 26 Hogs closed at $87.950, down $1.750\nMay 26 Hogs closed at $91.925, down $1.450,",
        "authors": "None",
        "publish_date": "2025-12-18 13:36:31",
        "published_at_raw": "2025-12-18T13:36:31Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted losses of $1.45 to $1.80 on the Wednesday session. OI dropped 10,642 contracts. USDA’s national base hog price was up 15 cents in the Wednesday afternoon report at $69.71. The CME Lean Hog Index was up 31 cents on December 15...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]