[
    {
        "id": "c4ec4a91c3035d28d0f3b8e6221223ad",
        "title": "Corn Bulls Showing Black Friday Gains, as Export Business Remains Strong",
        "doc_url": "https://www.barchart.com/story/news/36360792/corn-bulls-showing-black-friday-gains-as-export-business-remains-strong",
        "all_text": "Corn futures are trading with midday Black Friday gains of 2 to 5 cents. Today is first notice day for December futures, with 80 deliveries issued all by an ADM customer. The CmdtyView national average Cash Corn price is up 8 ¼ cents at $4.12.\nA private export sale of 273,988 MT of corn was reported by USDA to unknown destinations this morning.\nUSDA’s catchup continued this morning, with the Export Sales report for the week ending on October 16 showing 2.82 MMT of corn sold for 2025/26, exceeding the estimate of 1.4-2.5 MMT. There was another 571,502 MT for 2026/27, falling in the middle of the 0.5-1 MMT trade estimates. Combined sales of 3.394 MMT were the largest in exactly a year, shy of the 4.183 MMT from the same week last year. Total export commitments are still 42.9% above last year at 33.56 MMT, 1.32 bbu. That is also a record high for the current week.\nSales data for the week ending on 10/23 will be out Monday morning, with traders looking for 1.1-2.5 MMT in corn bookings during that week.\nDec 25 Corn is at $4.36 1/2, up 4 3/4 cents,\nNearby Cash is at $4.12 1/1, up 8 1/4 cents,\nMar 26 Corn is at $4.47 1/2, up 2 1/4 cents,\nMay 26 Corn is at $4.55 1/2, up 2 1/2 cents,",
        "authors": "None",
        "publish_date": "2025-11-28 17:21:19",
        "published_at_raw": "2025-11-28T17:21:19Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with midday Black Friday gains of 2 to 5 cents. Today is first notice day for December futures, with 80 deliveries issued all by an ADM customer. The CmdtyView national average Cash Corn price is up 8 ¼ cents at $4.12. A pri...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9d1271c2f7a9252c98661a0eb5977646",
        "title": "Soybeans Bulls Post Black Friday Buying, as USDA confirms Sales to China",
        "doc_url": "https://www.barchart.com/story/news/36363599/soybeans-bulls-post-black-friday-buying-as-usda-confirms-sales-to-china",
        "all_text": "Soybeans posted gains of 4 to 6 ¼ cents across the nearby contracts on Friday, with January up 12 ¾ cents on the week. The cmdtyView national average Cash Bean price was 6 1/2 cents higher at $10.65 ½. Soymeal futures were down $1.70 to $3.60, with December down 70 cents on the day. Soy Oil futures were 87 to 10 points higher, with December rallying 150 points on the short week. There were 199 deliveries issued against December soybean meal for first notice day, with 447 for bean oil.\nUSDA reported a private export sale of 312,000 MT of soybeans to China this morning.\nUSDA’s Export Sales data for the week ending on October 16 was released this morning, with 1.1 MMT of soybean sales in that week. That was in the middle of the trader ideas looking for between 0.6 and 2 MMT. That was the first week to breach 1 MMT this marketing year, at 41.2 above the previous week, yet was still 56.9% below last year. China to that point had yet to make a purchase.\nSoybean meal sales were tallied at 543,119 MT, an improvement from the week prior. Bean oil sales were 19,133 MT for 2025/26 in the week of 10/16.\nThe report for the week ending on October 23 will be released on Monday morning, with analysts looking for 0.6 to 1.6 MMT of beans sold, with bean meal at 50,000-500,000 MT and bean oil at 5,000 to 25,000 MT.\nAgroconsult estimates the 2025/26 Brazilian soybean crop at 178.1 MMT, which would be a 6 MMT increase from last year’s total.\nJan 26 Soybeans closed at $11.37 3/4, up 6 1/4 cents,\nN",
        "authors": "None",
        "publish_date": "2025-11-28 22:09:05",
        "published_at_raw": "2025-11-28T22:09:05Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans posted gains of 4 to 6 ¼ cents across the nearby contracts on Friday, with January up 12 ¾ cents on the week. The cmdtyView national average Cash Bean price was 6 1/2 cents higher at $10.65 ½. Soymeal futures were down $1.70 to $3.60, with D...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "20a6eaa0f6a911681ce02d49ae9d2a22",
        "title": "Hogs Close Black Friday Mixed",
        "doc_url": "https://www.barchart.com/story/news/36363629/hogs-close-black-friday-mixed",
        "all_text": "Lean hog futures were up 17 cents in the December contract on Friday, the rest of the nearbys down 35 to 45 cents. December was up $2.80 this week. USDA’s national base hog price was reported at $72.09 on Friday afternoon, down $1.48 from the day prior. The CME Lean Hog Index was down another 54 cents on November 25 at $82.27.\nExport Sales data suggested 28,038 MT of pork sales in the week of 10/16, a 5-week low. Shipments were tallied at a 17-week high of 30,329 MT.\nUSDA’s pork carcass cutout value from the Friday afternoon report was down 3 cents to $94.22 per cwt. The loin and picnic were the only primals reported lower. USDA estimated federally inspected hog slaughter for the week was 2.163 million head. That was 121,423 head below the week last year.\nDec 25 Hogs closed at $80.600, up $0.175,\nFeb 26 Hogs closed at $81.000, down $0.375\nApr 26 Hogs closed at $84.900, down $0.450,",
        "authors": "None",
        "publish_date": "2025-11-28 22:09:05",
        "published_at_raw": "2025-11-28T22:09:05Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were up 17 cents in the December contract on Friday, the rest of the nearbys down 35 to 45 cents. December was up $2.80 this week. USDA’s national base hog price was reported at $72.09 on Friday afternoon, down $1.48 from the day pri...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0f4dbf75565fb6e1e92b2ef23a2fe0af",
        "title": "Hogs on the Higher Side at Midday on the Shortened Friday Session",
        "doc_url": "https://www.barchart.com/story/news/36360832/hogs-on-the-higher-side-at-midday-on-the-shortened-friday-session",
        "all_text": "Lean hog futures posted Wednesday gains of $1.95 to $2.50 as bulls were catching some pre-Black Friday sales. USDA’s national base hog price was not reported on Friday morning due to light volume. The CME Lean Hog Index was down another 54 cents on November 25 at $82.27.\nExport Sales data suggested 28,038 MT of pork sales in the week of 10/16, a 5-week low. Shipments were tallied at a 17-week high of 30,329 MT.\nUSDA’s pork carcass cutout value from the Friday morning report was up 50 cents to $94.75 per cwt. The picnic was the only primal reported lower. USDA estimated federally inspected hog slaughter for Wednesday at 487,000 head, taking the weekly total to 1.474 million head. That is 8,000 head below last week and down 340 head from same week last year.\nDec 25 Hogs are at $80.750, up $0.325,\nFeb 26 Hogs are at $81.475, up $0.100\nApr 26 Hogs is at $85.425, up $0.075,",
        "authors": "None",
        "publish_date": "2025-11-28 17:21:19",
        "published_at_raw": "2025-11-28T17:21:19Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted Wednesday gains of $1.95 to $2.50 as bulls were catching some pre-Black Friday sales. USDA’s national base hog price was not reported on Friday morning due to light volume. The CME Lean Hog Index was down another 54 cents on N...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2c321d62c6cc04d0bca6b552b00c1a2a",
        "title": "Soybeans Holding onto Gains, as USDA confirms Sales to China",
        "doc_url": "https://www.barchart.com/story/news/36360802/soybeans-holding-onto-gains-as-usda-confirms-sales-to-china",
        "all_text": "Soybeans are trading with gains of 3 to 4 cents on Friday following the holiday. The cmdtyView national average Cash Bean price is 3 3/4 cents higher to $10.62 3/4. Soymeal futures are down $2.50 to $2.70, as Soy Oil futures are 83 to 97 points higher. There were 199 deliveries issued against December soybean meal for first notice day, with 447 for bean oil.\nUSDA reported a private export sale of 312,000 MT of soybeans to China this morning.\nUSDA’s Export Sales data for the week ending on October 16 was released this morning, with 1.1 MMT of soybean sales in that week. That was in the middle of the trader ideas looking for between 0.6 and 2 MMT. That was the first week to breach 1 MMT this marketing year, at 41.2 above the previous week, yet was still 56.9% below last year. China to that point had yet to make a purchase.\nSoybean meal sales were tallied at 543,119 MT, an improvement from the week prior. Bean oil sales were 19,133 MT for 2025/26 in the week of 10/16.\nThe report for the week ending on October 23 will be released on Monday morning, with analysts looking for 0.6 to 1.6 MMT of beans sold, with bean meal at 50,000-500,000 MT and bean oil at 5,000 to 25,000 MT.\nAgroconsult estimates the 2025/26 Brazilian soybean crop at 178.1 MMT, which would be a 6 MMT increase from last year’s total.\nJan 26 Soybeans are at $11.35 1/2, up 4 cents,\nNearby Cash is at $10.62 3/4, up 3 3/4 cents,\nMar 26 Soybeans are at $11.44 1/4, up 3 1/2 cents,\nMay 26 Soybeans are at $11.54, up 3 1/2 ",
        "authors": "None",
        "publish_date": "2025-11-28 17:21:19",
        "published_at_raw": "2025-11-28T17:21:19Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are trading with gains of 3 to 4 cents on Friday following the holiday. The cmdtyView national average Cash Bean price is 3 3/4 cents higher to $10.62 3/4. Soymeal futures are down $2.50 to $2.70, as Soy Oil futures are 83 to 97 points highe...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cd105fec2182a53423c2ddc8bbf7b70c",
        "title": "B&M issues urgent nationwide recall of two infant milk powders: Why “use by” dates on formula matters more than you think",
        "doc_url": "https://www.naturalnews.com/2025-11-28-bm-issues-nationwide-recall-infant-milk-powders.html",
        "all_text": "B&M pulled several Aptamil and Kendamil infant milk products after shoppers spotted items months past their \"use by\" dates, underscoring that quality lapses can happen anywhere and that retailers themselves emphasize these items \"should not have been sold.\"\nFDA and USDA guidance stresses that infant formula past their \"use by\" dates may no longer deliver the precise nutrients listed on the label or flow properly through a baby bottle nipple, meaning it can undermine feeding and safety even if it looks fine.\nExperts explain that \"sell by,\" \"best by\" and \"use by\" dates on general foods are overwhelmingly about quality, not hazards. But expired infant milk formula is the only food category where the stamped \"use by\" date is a true safety line, not a guess about freshness.\nMisunderstanding confusing labels like \"best by\" and \"use by\" dates leads to wasted food on one hand and dangerous assumptions on the other. Infant milk formula is the rare exception where the date is not about flavor but safety.\nBehind each printed date is a promise – from regulators, manufacturers and retailers – that the product is safe. When that promise falters, parents are left to bridge the gap.\nThe moment you become responsible for feeding a child, food labels take on a whole new kind of gravity. A printed or stamped date that once seemed like a loose suggestion suddenly becomes something you squint at in a dim kitchen light at two in the morning, holding a crying baby in one arm and a can of formula in",
        "authors": "None",
        "publish_date": "2025-11-28 16:02:23",
        "published_at_raw": "2025-11-28T16:02:23Z",
        "meta_site_name": "Natural News",
        "description": "B&M pulled several Aptamil and Kendamil infant milk products after shoppers spotted items months past their “use by” dates, underscoring that quality lapses can happen anywhere and that retailers themselves emphasize these items “should not have been sold.” FDA and USDA guidance stresses that infant formula past their “use by” dates may no longer deliver […]",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "14a33fb9ecc7b449295187ad818da3c2",
        "title": "3 Big Things Today, Nov. 28, 2025",
        "doc_url": "https://www.agriculture.com/3-big-things-today-nov-28-2025-11858573",
        "all_text": "1. Grain, Soybean Trading Closed Due to Thanksgiving\nGrain and soybean trading was closed overnight due to the Thanksgiving holiday.\nTrading on the Chicago Board of Trade is set to resume at 8:30 a.m. and will close early at 12:05 p.m.\n2. Fewer Eggs Set Weekly, Broiler Placements Rise, USDA Says\nEggs set in incubators last week declined on an annual basis while broiler placements rose, according to a report from USDA.\nHatcheries put 248 million eggs in incubators in the week through Nov. 22, the agency said. That's down 1% year over year.\nAverage hatchability, which is derived by dividing the number of chicks hatched by eggs set three weeks prior, was 79.8%.\nBroiler placements, meanwhile, rose 3% year over year to 191 million chicks, the government said. Cumulative placements rose 1% to 9.02 billion.\nGeorgia was the largest state for setting broiler-type eggs at 35.4 million, followed by Alabama at 33.1 million and North Carolina at 26.3 million.\nChick placements were also led by Georgia at 27.5 million, Arkansas at 22.2 million and Alabama at 22.1 million, USDA said in its report.\n3. Blizzard Warnings Issued from Montana to Indiana\nBlizzard warnings and winter weather advisories have been issued for a wide chunk of land stretching from Montana into Indiana, National Weather Service maps show.\nIn eastern Iowa and northern Illinois, as much as 14 inches of snow are possible along with winds gusting to 25 mph, the agency said.\nA winter storm warning has been issued for the area",
        "authors": "None",
        "publish_date": "2025-11-28 12:16:46",
        "published_at_raw": "2025-11-28T12:16:46Z",
        "meta_site_name": "Successful Farming",
        "description": "Grain, soybean trading closed overnight for Thanksgiving. Fewer eggs set weekly, chick placements rise, USDA says. Blizzard warnings issued from Montana to Indiana.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]