[
    {
        "id": "e46e1258c96995bbd1265c01ec5001d5",
        "title": "Corn Closes Higher on Wednesday with Record Ethanol Production",
        "doc_url": "https://www.barchart.com/story/news/36679639/corn-closes-higher-on-wednesday-with-record-ethanol-production",
        "all_text": "Corn futures posted gains of 2 to 4 ½ cents on Wednesday. Demand continues to be solid, with record ethanol and exports. The CmdtyView national average Cash Corn price as up 4 cents to $3.96 3/4.\nUSDA reported a private export sale of 177,055 MT of corn to Mexico this morning.\nEIA data from this morning showed another record ethanol corn grind for the week ending on December 12, up 26,000 barrels per day week/week to 1.131 million bpd. Despite the increased output, stocks saw a draw of 157,000 barrels to 22.353 million barrels. That came as ethanol exports were up 66,000 bpd to 191,000 bpd, with refiner inputs of ethanol rising 55,000 barrels per day from the week prior to 906,000 bpd.\nCommitment of Traders data, now as of December 2, showed spec funds adding back 34,142 contracts to the long side in that week, mainly on short covering. That flipped their net position to long in corn futures and options to 23,270 contracts as of that date\nA South Korean importer purchased a total of 268,000 MT of corn in a tender overnight. Brazil’s December corn exports are estimated to total 6.35 MMT according to ANEC, a 0.05 MMT increase from the week prior.\nMar 26 Corn closed at $4.40 1/2, up 4 cents,\nNearby Cash was $3.96 3/4, up 4 cents,\nMay 26 Corn closed at $4.47 3/4, up 3 1/4 cents,\nJul 26 Corn closed at $4.53 1/2, up 2 1/2 cents,",
        "authors": "None",
        "publish_date": "2025-12-17 23:33:18",
        "published_at_raw": "2025-12-17T23:33:18Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted gains of 2 to 4 ½ cents on Wednesday. Demand continues to be solid, with record ethanol and exports. The CmdtyView national average Cash Corn price as up 4 cents to $3.96 3/4. USDA reported a private export sale of 177,055 MT of...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bac95b2f2f3570ea152338001f3bc183",
        "title": "Corn Posting Wednesday Strength on Record Ethanol Production",
        "doc_url": "https://www.barchart.com/story/news/36673808/corn-posting-wednesday-strength-on-record-ethanol-production",
        "all_text": "Corn futures are trading with contracts 2 to 4 ½ cents higher at Wednesday’s midday. Demand continues to be solid, with record ethanol and exports. The CmdtyView national average Cash Corn price is up 4 1/2 cents to $3.96 1/4.\nUSDA reported a private export sale of 177,055 MT of corn to Mexico this morning.\nEIA data from this morning showed another record ethanol corn grind for the week ending on December 12, up 26,000 barrels per day week/week to 1.131 million bpd. Despite the increased output, stocks saw a draw of 157,000 barrels to 22.353 million barrels. That came as ethanol exports were up 66,000 bpd to 191,000 bpd, with refiner inputs of ethanol rising 55,000 barrels per day from the week prior to 906,000 bpd.\nA South Korean importer purchased a total of 268,000 MT of corn in a tender overnight. Brazil’s December corn exports are estimated to total 6.35 MMT according to ANEC, a 0.05 MMT increase from the week prior.\nMar 26 Corn is at $4.41, up 4 1/2 cents,\nNearby Cash is at $3.96 1/4, up 4 1/2 cents,\nMay 26 Corn is at $4.48, up 3 1/2 cents,\nJul 26 Corn is at $4.53 3/4, up 2 3/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-17 18:21:24",
        "published_at_raw": "2025-12-17T18:21:24Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with contracts 2 to 4 ½ cents higher at Wednesday’s midday. Demand continues to be solid, with record ethanol and exports. The CmdtyView national average Cash Corn price is up 4 1/2 cents to $3.96 1/4. USDA reported a private...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b6a869f03223da3a31688686dfca4a71",
        "title": "‘I sold three sacks of wheat and came here. Want my money back…’: Angry fans demand refund as IND vs SA T20I called off",
        "doc_url": "https://www.firstpost.com/firstcricket/india-vs-south-africa-4th-t20i-lucknow-abandoned-smog-pollution-fans-angry-bcci-13960765.html",
        "all_text": "The in Lucknow was called off on Wednesday night due to poor visibility, leaving fans angry and disappointed. The match was abandoned without a single ball being bowled after thick smog covered the Ekana Stadium, once again raising questions over the BCCI’s decision to schedule matches in north India during winter, when the pollution is at its peak.\nOfficially, the match was called off due to “excessive fog”, but the real issue was heavy smog caused by air pollution. The Air Quality Index (AQI) in Lucknow remained above 400 throughout the evening, which falls in the hazardous category and is dangerous for both players and spectators. Indian all-rounder Hardik Pandya was seen wearing a surgical mask while warming up before the match.\nSTORY CONTINUES BELOW THIS AD\nThe match was scheduled to begin at 7 pm, but the toss itself was delayed as visibility was extremely poor. The umpires conducted six inspections before finally calling off the game at around 9:30 pm. BCCI vice-president and senior Uttar Pradesh Cricket Association official Rajeev Shukla also walked onto the field during one of the inspections.\nFans express anger\nFans who had turned up in large numbers were visibly upset. One supporter said, “I sold three sacks of wheat and came here to watch the match. I want my money back.” Several others echoed similar sentiments on social media, questioning why matches are scheduled in cities known for poor air quality during winter.\nSTORY CONTINUES BELOW THIS AD\nSTORY CONTINUES B",
        "authors": "None",
        "publish_date": "2025-12-17 18:03:05",
        "published_at_raw": "2025-12-17T18:03:05Z",
        "meta_site_name": "Firstpost",
        "description": "The India vs South Africa 4th T20I in Lucknow was abandoned without a ball being bowled due to dense smog and hazardous AQI levels, leaving fans angry and raising serious questions over BCCI’s scheduling.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "433b743225b344ff20bd2c378e9cffde",
        "title": "Wheat Extends Losses as Ample Global Supply Continues to Weigh",
        "doc_url": "https://www.agriculture.com/partners-wheat-extends-losses-as-ample-global-supply-continues-to-weigh-11871034",
        "all_text": "CANBERRA/PARIS, Dec. 17 (Reuters) - Chicago wheat futures fell for a fourth consecutive session on Wednesday after plunging to eight-week lows the previous day as ample supply and progress in peace talks between Russia and Ukraine triggered selling by speculative investors.\nCorn futures steadied after falling on Tuesday as cheaper wheat provided competition for corn in feed markets. A partial recovery in crude oil prices failed to lift soybeans, which had slipped to seven-week lows on Tuesday due to plentiful supply and lacklustre demand for U.S. exports.\nThe most-active wheat contract on the Chicago Board of Trade was down 0.2% at $5.08-1/2 a bushel, as of 1220 GMT, after diving 2.2% and touching $5.07-1/2, its lowest level since October 23, on Tuesday.\n\"The weather is too good in a lot of growing regions, and that is pushing up supply. Demand is not following to the same extent,\" said Michael Whitehead, executive director for food, beverage and agribusiness insights at ANZ.\n\"Nothing appears to be on the horizon that would change the dynamic,\" he said.\nSouthern Hemisphere producers are pouring wheat into an already well-supplied market. The Rosario Grains Exchange last week raised its production estimate for Argentina to a record-high 27.7 million metric tons, and Australia is on track for its third-biggest harvest.\nCommodity funds were net sellers of CBOT wheat, soybeans and corn on Tuesday, traders said. Their net sales of wheat were the biggest for any day since November ",
        "authors": "None",
        "publish_date": "2025-12-17 14:59:08",
        "published_at_raw": "2025-12-17T14:59:08Z",
        "meta_site_name": "Successful Farming",
        "description": "Chicago wheat futures fell for a fourth consecutive session on Wednesday after plunging to eight-week lows the previous day as ample supply and progress in peace talks between Russia and Ukraine triggered selling by speculative investors.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "665d87c95f4dc279333f94831bdf10fa",
        "title": "Hogs Fall Back on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/36679679/hogs-fall-back-on-wednesday",
        "all_text": "Lean hog futures posted losses of $1.45 to $1.80 on the Wednesday session. USDA’s national base hog price was up 15 cents in the Wednesday afternoon report at $69.71. The CME Lean Hog Index was up 31 cents on December 15 at $83.30.\nCFTC data, now just 2 weeks old, showed spec funds at a net long of 46,650 contracts in lean hog futures and options as of the week ending on December 2. That was a drop of 3,543 contracts from the week prior.\nUSDA’s pork carcass cutout value from the Tuesday PM report was 2 cents lower to $98.54 per cwt. The butt and picnic primals were the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 494,000 head, with the weekly total at 1.462 million head. That was 9,000 head below last week and 927 head above the same week last year.\nFeb 26 Hogs closed at $83.000, down $1.775,\nApr 26 Hogs closed at $87.950, down $1.750\nMay 26 Hogs closed at $91.925, down $1.450,",
        "authors": "None",
        "publish_date": "2025-12-17 23:33:18",
        "published_at_raw": "2025-12-17T23:33:18Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted losses of $1.45 to $1.80 on the Wednesday session. USDA’s national base hog price was up 15 cents in the Wednesday afternoon report at $69.71. The CME Lean Hog Index was up 31 cents on December 15 at $83.30. CFTC data, now ju...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a05cb68cd281871b8d008288d773fe60",
        "title": "Soybeans Close with Weakness on Wednesday",
        "doc_url": "https://www.barchart.com/story/news/36679649/soybeans-close-with-weakness-on-wednesday",
        "all_text": "Soybeans posted Wednesday losses of 3 to 4 ½ cents at the close. The cmdtyView national average Cash Bean price was 5 cents lower at $9.87 1/4. Soymeal futures were $4.10 to $5.20 lower, with Soy Oil futures steady to 16 points higher.\nUSDA reported a couple private export sales of 198,000 MT of soybean to China and 125,000 MT to unknown destinations this morning.\nAnother delayed update to the backlogged CFTC reports showed managed money adding just 1,137 contracts to their net long as of the week ending on 12/2. That net long was 215,428 contracts in soybean futures and options.\nANEC estimates the Brazilian soybean exports for December at 3.57 MMT, a 0.24 MMT increase from last week’s estimate.\nJan 26 Soybeans closed at $10.58 1/4, down 4 1/2 cents,\nNearby Cash was $9.87 1/4, down 5 cents,\nMar 26 Soybeans closed at $10.68 3/4, down 3 cents,\nMay 26 Soybeans closed at $10.80, down 3 cents,",
        "authors": "None",
        "publish_date": "2025-12-17 23:33:18",
        "published_at_raw": "2025-12-17T23:33:18Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans posted Wednesday losses of 3 to 4 ½ cents at the close. The cmdtyView national average Cash Bean price was 5 cents lower at $9.87 1/4. Soymeal futures were $4.10 to $5.20 lower, with Soy Oil futures steady to 16 points higher. USDA reported...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0856309166e6f0b3e8d04c9e3a813286",
        "title": "USDA Tells Walz Minnesota Must Recertify SNAP Households",
        "doc_url": "https://www.newsmax.com/us/brooke-rollins-usda-tim-walz/2025/12/17/id/1238732/",
        "all_text": "Agriculture Secretary Brooke Rollins has required Minnesota to carry out a sweeping recertification of Supplemental Nutrition Assistance Program (SNAP) households in four of its largest counties within 30 days amid heightened scrutiny of fraud in pandemic-era federally funded benefit programs.\nRollins wrote Tuesday to Democrat Gov. Tim Walz that Minnesota is required to participate in a SNAP pilot program \"to increase the efficiency ... and improve delivery of SNAP benefits to eligible households.\" Rollins posted a copy of the letter on X.\n\"More accurate certifications of eligibility of SNAP benefits will ensure that those in need receive assistance, raising levels of nutrition among low-income individuals,\" Rollins wrote.\nWalz's administration has faced mounting criticism as federal authorities investigate and prosecute fraud tied to pandemic-era benefit programs in Minnesota.\n\"@GovTimWalz, there is nothing you can do NOW that changes the fact you stood idly by as criminals stole MILLIONS from the American taxpayer and hungry families,\" Rollins wrote on X. \"The attached requires you to verify SNAP participants in the next 30 days.\"\nThe Department of Justice has charged more than 75 individuals in connection with the Feeding Our Future fraud scheme involving child nutrition funds. A White House statement said the majority of those charged are of Somali heritage.\nAuthorities have also alleged fraud tied to Minnesota's Housing Stabilization Services program, a Medicaid-funded i",
        "authors": "None",
        "publish_date": "2025-12-17 21:46:40",
        "published_at_raw": "2025-12-17T21:46:40Z",
        "meta_site_name": "Newsmax",
        "description": "Minnesota has been required by Agriculture Secretary Brooke Rollins to carry out a sweeping recertification of Supplemental Nutrition Assistance Program (SNAP) households in four of its largest counties within 30 days.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "520bcfe745f31e21efaf39db51bab597",
        "title": "Lip Balm Brand Earth's Daughter Surpasses 3 Million Units Sold on Amazon",
        "doc_url": "https://www.manilatimes.net/2025/12/18/tmt-newswire/globenewswire/lip-balm-brand-earths-daughter-surpasses-3-million-units-sold-on-amazon/2245661",
        "all_text": "Sunnyvale, California, Dec. 17, 2025 (GLOBE NEWSWIRE) -- Earth's Daughter has sold more than 3 million units of its USDA Organic lip balm on Amazon. The California-based brand, operated by A La Carte Research, Inc., credits the milestone to growing consumer interest in personal care products with transparent, organic ingredients.\nEarth's Daughter Lip Balm Variety 6-Pack\nThe numbers are driven primarily by the brand's USDA Organic Lip Balm Variety 6-Pack. The set includes six flavors: eucalyptus mint, strawberry breeze, vanilla bean, creamy coconut, citrus blast, and bing cherry. All are made with USDA-certified organic oils, beeswax, and botanical extracts. Customers have left nearly 14,000 five-star reviews on Amazon, frequently praising the balms for smooth texture, clean ingredients, and value.\n\"We've watched this grow steadily over several years, not overnight,\" said Mike Weimar, spokesperson for Earth's Daughter. \"Our customers read labels. They want to know what's in the products they're using every day, and they're choosing options that don't include synthetic additives or ingredients they can't pronounce.\"\nEarth's Daughter manufactures its lip balms in the United States. The company has focused on keeping formulations simple by using organic oils and beeswax as the foundation while making the products affordable for families. Each 6-pack retails for under $10.\nThe brand launched its lip balm line after noticing a gap in the market for organic lip care that didn't carr",
        "authors": "None",
        "publish_date": "2025-12-17 19:36:20",
        "published_at_raw": "2025-12-17T19:36:20Z",
        "meta_site_name": "The Manila Times",
        "description": "About Earth's Daughter USDA Organic lip balm variety 6-pack with six delicious fruit flavors. The set includes six flavors: eucalyptus mint, strawberry breeze, vanilla bean, mint, creamy coconut, mangocitrus blast, and bing cherry. All are made with USDA-certified organic oils, beeswax, and botanical extractsSunnyvale, California, Dec. 17, 2025 (GLOBE NEWSWIRE) -- Earth's Daughter has sold more than 3 million units of its USDA Organic lip balm on Amazon. The California-based brand, operated by A La Carte Research, Inc., credits the milestone to growing consumer interest in personal care products with transparent, organic ingredients.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e102f6043009f49da7d473291f6a3301",
        "title": "Lip Balm Brand Earth's Daughter Surpasses 3 Million Units",
        "doc_url": "https://www.globenewswire.com/news-release/2025/12/17/3207277/0/en/Lip-Balm-Brand-Earth-s-Daughter-Surpasses-3-Million-Units-Sold-on-Amazon.html",
        "all_text": "Sunnyvale, California, Dec. 17, 2025 (GLOBE NEWSWIRE) -- Earth's Daughter has sold more than 3 million units of its USDA Organic lip balm on Amazon. The California-based brand, operated by A La Carte Research, Inc., credits the milestone to growing consumer interest in personal care products with transparent, organic ingredients.\nEarth's Daughter Lip Balm Variety 6-Pack\nThe numbers are driven primarily by the brand's USDA Organic Lip Balm Variety 6-Pack. The set includes six flavors: eucalyptus mint, strawberry breeze, vanilla bean, creamy coconut, citrus blast, and bing cherry. All are made with USDA-certified organic oils, beeswax, and botanical extracts. Customers have left nearly 14,000 five-star reviews on Amazon, frequently praising the balms for smooth texture, clean ingredients, and value.\n\"We've watched this grow steadily over several years, not overnight,\" said Mike Weimar, spokesperson for Earth's Daughter. \"Our customers read labels. They want to know what's in the products they're using every day, and they're choosing options that don't include synthetic additives or ingredients they can't pronounce.\"\nEarth's Daughter manufactures its lip balms in the United States. The company has focused on keeping formulations simple by using organic oils and beeswax as the foundation while making the products affordable for families. Each 6-pack retails for under $10.\nThe brand launched its lip balm line after noticing a gap in the market for organic lip care that didn't carr",
        "authors": "None",
        "publish_date": "2025-12-17 19:23:39",
        "published_at_raw": "2025-12-17T19:23:39Z",
        "meta_site_name": "GlobeNewswire",
        "description": "Sunnyvale, California, Dec. 17, 2025 (GLOBE NEWSWIRE) -- Earth's Daughter has sold more than 3 million units of its USDA Organic lip balm on Amazon. The...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "87762a4cc36516d311d65ba8a0ad9a0d",
        "title": "Senator Baldwin Pushes Trump Administration to Ramp Up Avian Flu Response for Farmers and Consumers",
        "doc_url": "https://www.weau.com/2025/12/17/senator-baldwin-pushes-trump-administration-ramp-up-avian-flu-response-farmers-consumers/",
        "all_text": "WASHINGTON, D.C. (U.S. SENATOR TAMMY BALDWIN PRESS RELEASE) - Today, U.S. Senator Tammy Baldwin (D-WI) pushed the Trump Administration to ramp up their avian flu response as the first dairy herd in Wisconsin tested positive for avian flu in Dodge County earlier this month. Specifically, Senator Baldwin is calling on the Department of Agriculture (USDA) and Secretary Brooke Rollins to stop delaying the implementation of their avian influenza vaccine policy, in order to keep costs down for consumers and ensure Wisconsin’s livestock and agricultural industry are protected from the ongoing outbreak.\n“For years, Wisconsin has dealt with the fall-out from an avian flu outbreak that has driven up grocery prices for consumers and caused undue stress for our farmers who are already facing headwinds created by the Trump Administration,” said Senator Baldwin. “So far this year, the Trump Administration has dragged their feet on implementing their own plan to address avian flu, and American farmers and consumers are sick of paying the price. As the avian flu begins to threaten Wisconsin cattle, it’s high time for the Trump Administration to deliver on a response that matches the scale and urgency of this crisis.”\nIn a letter sent today to Secretary Rollins, Senator Baldwin emphasized that nearly four years into the current avian flu outbreak, the disease is still spreading, infecting over 3.5 million animals on Wisconsin farms since September, including the first confirmed case of avian ",
        "authors": "None",
        "publish_date": "2025-12-17 17:29:50",
        "published_at_raw": "2025-12-17T17:29:50Z",
        "meta_site_name": "WEAU",
        "description": "Baldwin is calling on the USDA and Secretary Brooke Rollins to stop delaying the implementation of their avian influenza vaccine policy.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8951e8447894cd31f294556afcedbf55",
        "title": "Tennessee Farmers, Forest Owners to Receive $38.1M in Hurricane Helene Relief",
        "doc_url": "https://www.agriculture.com/partners-tennessee-farmers-forest-owners-to-receive-usd38-1m-in-hurricane-helene-relief-11870996",
        "all_text": "By Cassandra Stephenson\nTennessee farmers and forest owners who suffered agricultural losses due to Hurricane Helene will receive $38.1 million in assistance from the USDA.\nThe funding will cover infrastructure and timber losses, future economic losses and market losses, the USDA announced on Dec. 12. The funds will be administered to eligible farmers by the Tennessee Department of Agriculture.\n“This block grant funding recognizes the unique challenges faced by Tennessee’s agricultural producers in the wake of Hurricane Helene and will help cover a wide range of critical current needs as well as setbacks still to come,” Tennessee Agriculture Commissioner Andy Holt said in a news release.\nThe funds come from $30 billion earmarked for disaster relief block grants in 14 states — including Tennessee — under the American Relief Act of 2025.\nCarter, Cocke, Greene, Hamblen, Hawkins, Johnson, Unicoi, and Washington counties are covered under the program, according to the state.\nAssistance will be distributed to applicants as a lump sum. A minimum of 10 acres under single ownership is required to qualify. Verified damage must exceed a minimum of $1,000. For timber producers, a minimum of 15% of their acreage must be affected.\nThe amount given to each applicant will depend on funding and applications received, and will be capped at 90% of applicants’ reported loss. Applicants who have received other federal funding for Hurricane Helene relief can still apply for assistance under this p",
        "authors": "None",
        "publish_date": "2025-12-17 14:34:13",
        "published_at_raw": "2025-12-17T14:34:13Z",
        "meta_site_name": "Successful Farming",
        "description": "Tennessee farmers and forest owners who suffered agricultural losses due to Hurricane Helene will receive $38.1 million in assistance from the USDA.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ba424482dbcee05b03252677a22bc736",
        "title": "USDA Receives Mostly Negative Feedback on Reorganization Plan",
        "doc_url": "https://www.agriculture.com/partners-usda-receives-mostly-negative-feedback-on-reorganization-plan-11870985",
        "all_text": "By Ryan Hanrahan\nGovernment Executive’s Eric Katz reported that “the Agriculture Department received overwhelmingly negative feedback on its plan to relocate thousands of staff and consolidate dozens of offices, as employees, lawmakers, and stakeholders said it could lead to a significant brain drain and disruptions to key farmer-support programs.”\n“While just 10% of the USDA workforce is currently in the Washington area, the department is looking to relocate around 2,600 of those employees to new locations,” Katz reported. “The department is standing up five regional hubs around the country that will house relocated employees, located in Raleigh, North Carolina; Kansas City, Missouri; Indianapolis; Fort Collins, Colorado; and Salt Lake City, Utah. It is slashing other regional offices across the country and consolidating many support functions.”\n“The department solicited emailed comments from the public between Aug. 1 and Sept. 30. USDA received nearly 47,000 responses, most of which were from form letters or part of an organized campaign,” Katz reported. “Of the 14,000 remaining messages, 82% expressed a negative sentiment, according to USDA’s analysis of the responses. Just 5% expressed a positive tone.”\n“Among the most common concerns, USDA said, were for the impacts of reductions in personnel and resources. Potential layoffs, which USDA has said would be necessary if an insufficient number of employees agree to relocate, or employees opting to resign instead of moving wo",
        "authors": "None",
        "publish_date": "2025-12-17 14:19:43",
        "published_at_raw": "2025-12-17T14:19:43Z",
        "meta_site_name": "Successful Farming",
        "description": "Government Executive’s Eric Katz reported that “the Agriculture Department received overwhelmingly negative feedback on its plan to relocate thousands of staff and consolidate dozens of offices, as employees, lawmakers and stakeholders said it could lead to a significant brain drain and disruptions to key farmer-support programs.”",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a4c1a4ef433491092fcaf20d0ef53c21",
        "title": "Hogs See Turnaround Tuesday Bounce",
        "doc_url": "https://www.barchart.com/story/news/36667642/hogs-see-turnaround-tuesday-bounce",
        "all_text": "Lean hog futures reversed higher from the Monday weakness, with Tuesday gains of 75 cents to $1 higher. Open interest suggested some short covering, down 4,899 contracts. USDA’s national base hog price was down $3.12 in the Tuesday afternoon report at $69.56. The CME Lean Hog Index was up 19 cents on December 12 at $82.99.\nUSDA’s pork carcass cutout value from the Tuesday PM report was 33 cents lower to $98.56 per cwt. The rib and ham primals were the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 494,000 head, with the weekly total at 973,000. That was 8,000 head below last week after a revision to Monday and 1,175 head shy of the same week last year.\nFeb 26 Hogs closed at $84.775, up $0.925,\nApr 26 Hogs closed at $89.700, up $0.775\nMay 26 Hogs closed at $93.375, up $0.875,",
        "authors": "None",
        "publish_date": "2025-12-17 13:33:11",
        "published_at_raw": "2025-12-17T13:33:11Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures reversed higher from the Monday weakness, with Tuesday gains of 75 cents to $1 higher. Open interest suggested some short covering, down 4,899 contracts. USDA’s national base hog price was down $3.12 in the Tuesday afternoon report a...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "501cba2db3bab45c96f493e3315db6db",
        "title": "8 ways to add blueberries to your breakfast",
        "doc_url": "https://timesofindia.indiatimes.com/life-style/food-news/8-ways-to-add-blueberries-to-your-breakfast/photostory/126029892.cms",
        "all_text": "When it comes to berries, blueberries are often considered to be one of the most nutritious ones that are rich in antioxidants, vitamins, and minerals. According to a data report by the USDA, National Nutrient Database for Standard Reference 1 cup of blueberries offer 14.4 mg vitamin C. And it is proven that vitamin C is a powerful antioxidant that plays a key role in strengthening the immune system.t is also said to be important for collagen production for healthy skin and helps with absorption of iron. Here are 8 ways to include blueberries in your breakfast.\nOne can also add fresh or frozen blueberries to morning oatmeal or cereal for a tasty twist and a great dose of antioxidants. Soak oatmeal in curd or milk overnight. Next morning add protein powder and blueberries on top and enjoy.\nAnother healthy breakfast delight is a salad that can be enjoyed for breakfast. Simply toss a handful of blueberries along with apple, kiwi, and banana slices and top the salad bowl with mixed greens, cheese, and balsamic vinaigrette. Enjoy!\nAnother popular way to enjoy blueberries is to add them to regular pancake batter and once the pancake is ready, top them with some more blueberry and enjoy.\nTo make this, you need to combine blueberries with red onion, cilantro, lime juice, and a touch of jalapeño and blend them together. This makes for a flavorful and unique salsa that goes well as a topping for sandwiches and other grilled dishes.\nImages Courtesy: istock",
        "authors": "None",
        "publish_date": "2025-12-17 04:00:00",
        "published_at_raw": "2025-12-17T04:00:00Z",
        "meta_site_name": "Times of India",
        "description": "When it comes to berries, blueberries are often considered to be one of the most nutritious ones that are rich in antioxidants, vitamins, and minerals. According to a data report by the USDA, National Nutrient Database for Standard Reference 1 cup of blueberries offer 14.4 mg vitamin C. And it is proven that vitamin C is a powerful antioxidant that plays a key role in strengthening the immune system.t is also said to be important for collagen production for healthy skin and helps with absorption of iron. Here are 8 ways to include blueberries in your breakfast.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]