[
    {
        "id": "36a8c0e3b4be8017ac138b36dfe22472",
        "title": "Corn Starts the Holiday Week with Gains",
        "doc_url": "https://www.barchart.com/story/news/36752840/corn-starts-the-holiday-week-with-gains",
        "all_text": "Corn futures closed the Monday session with contracts 2 to 3 ¼ cents in the green. The CmdtyView national average Cash Corn price is up 3 1/2 cents to $4.03 1/2.\nMonday morning’s Export Inspections report showed a total of 1.744 MMT (68.66 mbu) of corn shipped in the week of 12/18. That was 8.68% above the week prior and 52.07% larger than the same week last year. Mexico was as the largest buyer of 565,416 MT, with 407,179 MT shipped to South Korea, 263,793 MT to Spain and 238,707 MT to Japan. The marketing year total is now 24.27 MMT (955.36 mbu) of corn shipped in under 4 month, which is now 67.57% above the same period last year.\nWe got another USDA Export Sales report update this morning, with sales of 1.479 MMT of corn booked in the week ending on December 4. That was on the lower end of trade estimates of 1.2-2.4 MMT. That was a 4-week low, but still 56.2% above the same week in 2024.\nThe USDA will release another update on Tuesday, with analysts looking for between 0.9-1.8 MMT in corn sales during the week of 12/11.\nMar 26 Corn closed at $4.47, up 3 1/4 cents,\nNearby Cash was $4.03 1/2, up 3 1/2 cents,\nMay 26 Corn closed at $4.54 1/2, up 3 cents,\nJul 26 Corn closed at $4.60, up 2 1/2 cents,",
        "authors": "None",
        "publish_date": "2025-12-22 23:24:15",
        "published_at_raw": "2025-12-22T23:24:15Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Monday session with contracts 2 to 3 ¼ cents in the green. The CmdtyView national average Cash Corn price is up 3 1/2 cents to $4.03 1/2. Monday morning’s Export Inspections report showed a total of 1.744 MMT (68.66 mbu) of c...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "04bfb4b17cbf6f671451d292cfa14581",
        "title": "Can ‘King Corn’ Pull Soybeans, Wheat Out of Their Price Slumps?",
        "doc_url": "https://www.barchart.com/story/news/36749463/can-king-corn-pull-soybeans-wheat-out-of-their-price-slumps",
        "all_text": "The soft red winter wheat (ZWH26), soybean (ZSF26), meal (ZMF26), and soybean oil (ZLF26) markets at present look very heavy and susceptible to more price downside in the near term. However, corn (ZCH26) and hard red winter wheat (KEH26) late last week showed some price strength.\nCorn may be the most important grain market to watch in the near term. My grain-market-reporting days on the floor of the Chicago Board of Trade nearly 40 years ago remind me that veteran grain traders would tell me, “Corn is king.” The corn market’s resilience late last week, in the face of solid selling pressure in the soybean complex and SRW wheat markets, is one potential bright spot in which King Corn may be attempting to pull the other grains out of their price slumps.\nCorn Showing Resilience\nMarch corn futures last week gained 3 cents, so it was not a bad trading week for the bulls. As the calendar year winds down, look for low-volume trade around the holidays and ahead of the USDA’s January crop production report.\nCorn and soybean traders will continue to closely monitor growing conditions for South American crops. In Brazil, a late-planted soybean crop will bring a particular focus on safrinha (second-crop) corn plantings. Weather forecasters say Brazil and Paraguay will see rains through the next two weeks, with enough rain in much of the region to support crop development. In Argentina, a wetter weather pattern will continue in the coming days and benefit crops.\nExport demand for U.S. corn",
        "authors": "None",
        "publish_date": "2025-12-22 20:09:35",
        "published_at_raw": "2025-12-22T20:09:35Z",
        "meta_site_name": "Barchart",
        "description": "Expect lower trading volume during the holiday week.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d3a2b3a147feba3262040d2388f88519",
        "title": "Corn Holding Gains on Monday",
        "doc_url": "https://www.barchart.com/story/news/36748091/corn-holding-gains-on-monday",
        "all_text": "Corn futures are trading with contracts up 2 to 3 cents in the front months. The CmdtyView national average Cash Corn price is up 2 1/2 cents to $4.02 1/2.\nMonday morning’s Export Inspections report showed a total of 1.744 MMT (68.66 mbu) of corn shipped in the week of 12/18. That was 8.68% above the week prior and 52.07% larger than the same week last year. Mexico was as the largest buyer of 565,416 MT, with 407,179 MT shipped to South Korea, 263,793 MT to Spain and 238,707 MT to Japan. The marketing year total is now 24.27 MMT (955.36 mbu) of corn shipped in under 4 month, which is now 67.57% above the same period last year.\nWe got another USDA Export Sales report update this morning, with sales of 1.479 MMT of corn booked in the week ending on December 4. That was on the lower end of trade estimates of 1.2-2.4 MMT. That was a 4-week low, but still 56.2% above the same week in 2024.\nCFTC data as of the week ending on 12/9 was released on Friday afternoon, with spec traders in corn futures and options trimming 13,552 contracts from the net long position in that week to a net long of just 9,718 contracts.\nMar 26 Corn is at $4.46 1/4, up 2 1/2 cents,\nNearby Cash is at $4.02 1/2, up 2 1/2 cents,\nMay 26 Corn is at $4.53 3/4, up 2 1/4 cents,\nJul 26 Corn is at $4.59 3/4, up 2 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-22 18:24:53",
        "published_at_raw": "2025-12-22T18:24:53Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with contracts up 2 to 3 cents in the front months. The CmdtyView national average Cash Corn price is up 2 1/2 cents to $4.02 1/2. Monday morning’s Export Inspections report showed a total of 1.744 MMT (68.66 mbu) of corn sh...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1ec69bd7dfa4beba1c3b3522aa0afe8a",
        "title": "India's rice stocks surge to record high as paddy procurement climbs",
        "doc_url": "https://economictimes.indiatimes.com/news/economy/agriculture/indias-rice-stocks-surge-to-record-high-as-paddy-procurement-climbs/articleshow/126120090.cms",
        "all_text": "Synopsis\nIndia's rice stockpiles have surged to a record high for early December. This increase, driven by government procurement, positions India to boost rice exports. The country, the world's largest rice exporter, is set to increase shipments. This could impact global supplies from rival nations. Wheat stocks are also at comfortable levels, aiding food grain price management.\nMumbai: India's rice inventories in government warehouses climbed ‍nearly 12% from a year ​earlier to a record high for early December after ⁠state-run agencies stepped up procurement of the new-season paddy crop, government data showed.\nThe swelling stockpiles could allow the world's biggest rice exporter to boost shipments, putting pressure on supplies ‌from rivals such ‌as Thailand, Vietnam and Pakistan.\nState reserves of rice, including unmilled paddy, totalled a record 57.57 ‌million metric tons as of December 1, far exceeding the government's target of 7.61 million tons for January 1.\nWheat stocks stood at 29.14 million tons on December 1, up from last year's 20.6 million tons, the data ​showed.\nState-run agencies are being forced to buy ​large quantities from farmers as open-market prices remain below the government-set minimum ‌support price, ‍said a New Delhi based dealer with a global ‍trade house.\nLive Events\n\"Despite the government buying heavily, traders still ‌have plenty of stock for exports,\" he said.\nSince the start of the marketing year on October 1, the government has procured 42.2",
        "authors": "None",
        "publish_date": "2025-12-22 10:11:00",
        "published_at_raw": "2025-12-22T10:11:00Z",
        "meta_site_name": "The Economic Times",
        "description": "India's rice stockpiles have surged to a record high for early December. This increase, driven by government procurement, positions India to boost rice exports. The country, the world's largest rice exporter, is set to increase shipments. This could impact global supplies from rival nations. Wheat stocks are also at comfortable levels, aiding food grain price management.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "97e5f0cab7b710faecbd8d030c50f602",
        "title": "India's Rice Reserves Surge, Setting Stage for Export Dominance",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3738500-indias-rice-reserves-surge-setting-stage-for-export-dominance",
        "all_text": "India's rice reserves have reached unprecedented levels, according to government data, as state-controlled agencies have significantly increased their new-season paddy crop procurement. The largest-ever December inventory rise of nearly 12% positions India, the world's top rice exporter, to potentially heighten export activity, exerting pressure on competitors like Thailand, Vietnam, and Pakistan.\nThe substantial 57.57 million metric tons of rice, inclusive of unmilled paddy, far surpasses the government's forthcoming target. Wheat stocks also show growth, increasing to 29.14 million tons from last year's 20.6 million tons. Market trends reveal state agencies are compelled to purchase ample quantities due to depressed market prices compared to government-fixed minimum prices, a global trade house dealer in New Delhi noted.\nDespite heavy state acquisitions, export-ready stock remains, driven by a devalued rupee enhancing foreign sales profitability. India's removal of export restrictions last March boosted rice shipments by 37% in this year's first 10 months, with expectations from the Rice Exporters Association for a 25% annual rise to 22.5 million tons. This scenario assists India in balancing its food grain pricing strategy effectively.",
        "authors": "None",
        "publish_date": "2025-12-22 10:05:28",
        "published_at_raw": "2025-12-22T10:05:28Z",
        "meta_site_name": "Devdiscourse",
        "description": "India's government rice reserves hit a record high, driven by increased paddy procurement. With 57.57 million tons of rice stockpile, India could expand its export leadership, impacting rival suppliers. Despite weak export demand, a depreciating rupee aids competitive pricing, while wheat reserves also remain substantial.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "876c7b71c4811dd99b47aa11d202945a",
        "title": "Cotton Slips Lower into Monday’s Close",
        "doc_url": "https://www.barchart.com/story/news/36752890/cotton-slips-lower-into-mondays-close",
        "all_text": "Cotton futures were weaker on Monday, with contracts closing 1 to 14 points lower. Crude oil futures are $1.43 per barrel higher at $57.95. The US dollar index was back down $0.317 to $97.935.\nUSDA’s Export Sales report indicated a total of 153,266 RB of cotton sold in the week ending on December 4. That was a 3-week high for sales but 10.19% below the same week last year. Shipments were 101,577 RB in that week, which was a marketing year low.\nThe 12/19 online auction from The Seam showed sales of 18,183 bales at an average price of 59.38 cents/lb. The Cotlook A Index was steady on December 19 at 73.30 cents. ICE certified cotton stocks were unchanged on Friday with the certified stocks level at 12,396 bales. The Adjusted World Price was updated on Thursday to 49.99 cents/lb a 40 point drop from the previous week.\nMar 26 Cotton closed at 63.61, down 14 points,\nMay 26 Cotton closed at 64.78, down 6 points,\nJul 26 Cotton closed at 65.85, down 1 points",
        "authors": "None",
        "publish_date": "2025-12-22 23:24:16",
        "published_at_raw": "2025-12-22T23:24:16Z",
        "meta_site_name": "Barchart",
        "description": "Cotton futures were weaker on Monday, with contracts closing 1 to 14 points lower. Crude oil futures are $1.43 per barrel higher at $57.95. The US dollar index was back down $0.317 to $97.935. USDA’s Export Sales report indicated a total of 153,266...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "36dee3bda1832b4a4ceba0d632a017a0",
        "title": "Hogs Pop Higher to Begin the Holiday Week",
        "doc_url": "https://www.barchart.com/story/news/36752880/hogs-pop-higher-to-begin-the-holiday-week",
        "all_text": "Lean hog futures were up 65 to 85 cents across most contracts on Monday. USDA’s national base hog price was reported at $67.16 on Monday afternoon, down 29 cents from the day prior. The CME Lean Hog Index was down 15 cents on December 18 at $83.73.\nExport Sales data from this morning showed a total of 27,436 MT of pork sold in the week ending on December 4. Shipments were tallied at 31,074 MT.\nUSDA’s pork carcass cutout value from the Monday PM report was $1.35 lower at $98.41 per cwt. The butt and belly were the only primals reported higher. USDA estimated federally inspected hog slaughter for Monday at 496,000 head. That was 17,000 head larger than last Monday and 6,295 head above the same week last year.\nFeb 26 Hogs closed at $85.350, up $0.850,\nApr 26 Hogs closed at $89.875, up $0.750\nMay 26 Hogs closed at $93.600, up $0.675,",
        "authors": "None",
        "publish_date": "2025-12-22 23:24:16",
        "published_at_raw": "2025-12-22T23:24:16Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were up 65 to 85 cents across most contracts on Monday. USDA’s national base hog price was reported at $67.16 on Monday afternoon, down 29 cents from the day prior. The CME Lean Hog Index was down 15 cents on December 18 at $83.73....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5dbc0727ebf9cbaedf1151e5156041bd",
        "title": "U.S. Farm Agency Lost 20,000 Staff in First Five Months of Trump Administration",
        "doc_url": "https://www.agriculture.com/partners-us-farm-agency-lost-20-000-staff-in-first-five-months-of-trump-administration-11874872",
        "all_text": "By Leah Douglas\nMore than 20,300 employees left the U.S. Department of Agriculture in the first five months of the administration of President Donald Trump, about a fifth of staff, according to a report from the agency's inspector general.\nAbout three-quarters of those employees left the USDA through a financial incentive program offered as part of the Trump administration's effort to shrink the size of the federal workforce, said the report from the USDA's Office of Inspector General.\nThe rest left through resignation, retirement, termination or other pathways, said the report, which used pay-period and other data to track departures from January 12 to June 14. At the start of the year, the USDA had more than 110,300 employees, the report said.\nAttrition ranged from below 10% in some sub-agencies to as much as 67% in others, said the report. More than 30% of staff left the National Agricultural Statistics Service, the National Institute of Food and Agriculture and the agency's rural development arm.\nMore than 5,800 employees left the Forest Service (16% of staff), 2,673 left the Natural Resources Conservation Service (22%), 2,105 left the Animal and Plant Health Inspection Service (25%) and 806 left the Farm Service Agency (24%).\n\"Losing nearly 20% of all USDA staff weakens the department's ability to respond to challenges facing our farmers, leaves our food supply chains more vulnerable to threats like New World Screwworm and avian flu, and undermines efforts to drive the r",
        "authors": "None",
        "publish_date": "2025-12-22 22:10:53",
        "published_at_raw": "2025-12-22T22:10:53Z",
        "meta_site_name": "Successful Farming",
        "description": "More than 20,300 employees left the USDA in the first five months of the administration of President Donald Trump, about a fifth of staff, according to a report from the agency's inspector general.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "dbf6cb12ddd5fd3a13b294366cbc59c8",
        "title": "Holiday Sausage Recalled Due to Possible Metal Contamination",
        "doc_url": "https://people.com/thousands-of-pounds-of-holiday-kielbasa-sausage-recalled-due-to-possible-metal-contamination-11874535",
        "all_text": "Approximately 1,930 pounds of ready-to-eat (RTE) holiday kielbasa produced by Olympia Provisions have been recalled due to possible metal contamination.\nOn Dec. 18, the U.S. Department of Agriculture’s Food Safety and Inspection Service (FSIS) announced the recall, following a reported customer complaint.\nThe affected kielbasa was produced on Oct. 14 and shipped to retail locations in Washington, Oregon and California. It was also available nationwide for purchase online.\nGiven the 2-month-long delay between production and recall, the FSIS is concerned that customers have the contaminated product stored in their freezers. They urge consumers to look for the establishment number \"EST. 39928\" and to either throw the sausage out or return it to the store of purchase.\nThe specific product of concern is the 16-oz. vacuum-sealed plastic package containing one, fully cooked \"Olympia Provisions Uncured Holiday Kielbasa\" with the \"best if used by\" date of \"02/19/26.\" Images of the product can be found here.\nThe contamination was first brought to the FSIS's attention after Olympia Provisions received a consumer complaint. The consumer claimed they found metal in their RTE holiday kielbasa. Fortunately, they were not harmed and no consumers have reported injuries since. The FSIS advises all consumers to seek medical attention if any food-related injuries occur.\nThe FSIS has classified the RTE holiday kielbasa contamination as Class I, meaning the risk level is high. According to the Uni",
        "authors": "None",
        "publish_date": "2025-12-22 21:53:59",
        "published_at_raw": "2025-12-22T21:53:59Z",
        "meta_site_name": "People.com",
        "description": "Thousands of pounds of ready-to-eat holiday kielbasa by American charcuterie company Olympia Provisions is recalled by the USDA due to possible metal contamination.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ee20a9c683dd66784238804c3c8a7525",
        "title": "USDA recalls 1,930 pounds holiday kielbasa over metal contamination",
        "doc_url": "https://www.foxbusiness.com/lifestyle/holiday-kielbasa-sausage-recalled-after-consumer-finds-dangerous-metal-strip-over-1-inch-long",
        "all_text": "The Department of Agriculture announced Friday a recall of nearly one ton of holiday kielbasa after a consumer reportedly found metal in the product.\nApproximately 1,930 pounds of ready-to-eat sausage produced by Olympia Provisions may be \"contaminated with foreign material, specifically metal,\" the agency’s Food Safety and Inspection Service (FSIS) said.\nFSIS told Fox News Digital Monday that the pieces of metal found were roughly 1.25-inch strips.\nThe issue was identified after the Portland-based company notified FSIS of the consumer complaint. No confirmed injuries related to the recalled products have been reported.\nPOPULAR SALAD DRESSINGS, SOLD AT COSTCO AND REPORTEDLY PUBLIX, RECALLED OVER ‘FOREIGN OBJECTS’\nThe product was manufactured on Oct. 14 and shipped to retail locations in California, Oregon and Washington. It was also sold nationwide through the company’s direct-to-consumer online sales.\nThe recalled item is packaged in 16-ounce vacuum-sealed plastic casings labeled \"OLYMPIA PROVISIONS UNCURED HOLIDAY KIELBASA,\" with a \"Best If Used By\" date of Feb. 19, 2026. The product subject to recall bears establishment number \"EST. 39928\" inside the USDA mark of inspection.\nOVER 13,000 ABOVE-GROUND POOLS RECALLED OVER DEADLY FLAW THAT KILLED 9 OVER 15 YEARS\nFSIS advised consumers who believe they may have purchased the affected product to check their refrigerators or freezers.\n\"Consumers who have purchased this product are urged not to consume it,\" the agency said. \"The p",
        "authors": "None",
        "publish_date": "2025-12-22 21:42:08",
        "published_at_raw": "2025-12-22T21:42:08Z",
        "meta_site_name": "Fox Business",
        "description": "U.S. Department of Agriculture announces recall of nearly one ton of Olympia Provisions holiday kielbasa after consumer reportedly found metal in ready-to-eat sausage product.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a4df2227800a3d9ff0d3d70190729be5",
        "title": "After two years opting out, Iowa to participate in Summer EBT",
        "doc_url": "https://www.amestrib.com/story/news/2025/12/22/iowa-summer-ebt/87884440007/",
        "all_text": "Iowa will participate in the federal Summer EBT program in 2026 after two years of opting out, according to a Monday, Dec. 22 news release from Gov. Kim Reynolds and the Iowa Department of Health and Human Services.\nThe U.S. Department of Agriculture recently approved the state's waiver to \"align\" the program with Iowa's new SNAP guidelines, including that money can't be used for things like candy and soda, which take effect Jan. 1, the release said.\nThe federal program gives low-income families electronic benefit transfer (EBT) cards worth $40 per child each of the three months in the summer to purchase groceries.\nFor two years, state leaders opted out of the program and instead launched their own. Reynolds, a Republican, previously argued Summer EBT, also known as SUN Bucks, did not promote nutrition.\nIn 2024, the state awarded $900,000 in grants to 38 school districts and organizations that served students healthy meals and snacks at meal sites. This year, through Healthy Kids Iowa, families received boxes that contained $40 worth of nutritious food each month for three months.\nUnder Healthy Kids Iowa, families were given food like eggs, shelf-stable milk, ground beef and fruit. Food banks and pantries served as distribution centers, though some leaders said the additional work was a burden for organizations already dealing with record demand.\n\"Food assistance programs that are nutrition focused do more to help low-income Iowans by addressing both hunger and health,” Reyno",
        "authors": "None",
        "publish_date": "2025-12-22 21:20:19",
        "published_at_raw": "2025-12-22T21:20:19Z",
        "meta_site_name": "Ames Tribune",
        "description": "Iowa now plans to participate in summer EBT in 2026 after the USDA said it could ban card holders from buying candy or soda.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6a509273cd02a9c2a490e39e84e1b891",
        "title": "After two years opting out, Iowa to participate in Summer EBT",
        "doc_url": "https://www.desmoinesregister.com/story/news/2025/12/22/iowa-summer-ebt/87884440007/",
        "all_text": "Iowa will participate in the federal Summer EBT program in 2026 after two years of opting out, according to a news release from Gov. Kim Reynolds and the Iowa Department of Health and Human Services.\nThe U.S. Department of Agriculture recently approved the state's waiver to \"align\" the program with Iowa's new Healthy SNAP guidelines, which exclude candy, soda and some prepared foods and take effect Jan. 1, the Monday, Dec. 22 release said.\nThe federal program gives low-income families electronic benefit transfer (EBT) cards worth $40 per child each of the three months in the summer to purchase groceries.\nFor two years, state leaders opted out of the program and instead launched their own. Reynolds, a Republican, previously argued Summer EBT, also known as SUN Bucks, did not promote nutrition.\nIn 2024, the state awarded $900,000 in grants to 38 school districts and organizations that served students healthy meals and snacks at meal sites. This year, through Healthy Kids Iowa, families received boxes that contained $40 worth of nutritious food each month for three months.\nUnder Healthy Kids Iowa, families were given eggs, shelf-stable milk, ground meat and fruit. Food banks and pantries served as distribution centers, though some leaders said the additional work was a burden for organizations already dealing with record demand.\nMore than 65,000 children were served through the state program, according to Iowa HHS. That is a fraction of the 240,000 children the Iowa Hunger Coali",
        "authors": "None",
        "publish_date": "2025-12-22 21:20:19",
        "published_at_raw": "2025-12-22T21:20:19Z",
        "meta_site_name": "Des Moines Register",
        "description": "Iowa now plans to participate in summer EBT in 2026 after the USDA said it could ban card holders from buying candy or soda.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "27799895162d7c4c737a32fad44b8637",
        "title": "UL Lafayette program receives grant for rural businesses",
        "doc_url": "https://www.theadvocate.com/acadiana/news/education/ul-lafayette-program-receives-usda-grant-help-rural-businesses/article_4fc91c44-4b75-427f-b0cc-cd91ce31aaea.html",
        "all_text": "Rural businesses could receive more technological and expert support with a $200,000 grant.\nThe Louisiana Immersive Technologies Enterprise, or LITE, Center in partnership with the Louisiana Entrepreneurship and Economic Development, or LEED, Center and the Office of Innovation Management at the University of Louisiana Lafayette received the grant from the U.S. Deparetment of Agriculture.\nThe grant will help fund the creation of the Rural Economic Development and Innovation, or REDI, Initiative that will assist in the creation and elevation of small rural businesses and help ensure longevity and success, according to a news release from UL.\nDirector of UL’s Office of Innovation Management Chad Lacomb and his team think the initiative can help reduce barriers that rural entrepreneurs face, according to the release.\n“The business world moves quickly, and without access to advanced resources and technology, innovative rural businesses risk being left behind,” Chad Lacomb, director of UL’s Office of Innovation Management, said in a statement. “Thanks to the USDA Rural Development Grant, we can give them a real chance to compete.”\nThe initiative, Lacomb hopes, will help launch local startups, attract investment and spur job growth, in turn transforming rural communities into hubs of creativity and economic opportunity.",
        "authors": "None",
        "publish_date": "2025-12-22 18:44:00",
        "published_at_raw": "2025-12-22T18:44:00Z",
        "meta_site_name": "Baton Rouge Advocate",
        "description": "The USDA grant will help fund the creation of the Rural Economic Development and Innovation, or REDI, Initiative, which will assist in the creation and elevation of small rural businesses and help ensure longevity and success.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "20a21614ab07571e88c6a9ed42193584",
        "title": "Cotton Steady at Monday’s Midday",
        "doc_url": "https://www.barchart.com/story/news/36748146/cotton-steady-at-mondays-midday",
        "all_text": "Cotton futures are posting 3 to 5 point gains at midday, with March down 3 points. Crude oil futures are $1.30 per barrel higher at $57.84. The US dollar index is back down $0.312 at midday to $97.94.\nUSDA’s Export Sales report indicated a total of 153,266 RB of cotton sold in the week ending on December 4. That was a 3-week high for sales but 10.19% below the same week last year. Shipments were 101,577 RB in that week, which was a marketing year low.\nCFTC data showed managed money trimming 4,774 contracts from their net short in the week ending on 12/9 to 55,013 contracts.\nThe 12/19 online auction from The Seam showed sales of 18,183 bales at an average price of 59.38 cents/lb. The Cotlook A Index was steady on December 19 at 73.30 cents. ICE certified cotton stocks were unchanged on Friday with the certified stocks level at 12,396 bales. The Adjusted World Price was updated on Thursday to 49.99 cents/lb a 40 point drop from last week.\nMar 26 Cotton is at 63.72, down 3 points,\nMay 26 Cotton is at 64.87, up 3 points,\nJul 26 Cotton is at 65.91, up 5 points",
        "authors": "None",
        "publish_date": "2025-12-22 18:24:53",
        "published_at_raw": "2025-12-22T18:24:53Z",
        "meta_site_name": "Barchart",
        "description": "Cotton futures are posting 3 to 5 point gains at midday, with March down 3 points. Crude oil futures are $1.30 per barrel higher at $57.84. The US dollar index is back down $0.312 at midday to $97.94. USDA’s Export Sales report indicated a total of 1...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2b3dcd46d3ffffea916007b927aac3b9",
        "title": "Hogs Posting Gains to Start the Holiday Week",
        "doc_url": "https://www.barchart.com/story/news/36748133/hogs-posting-gains-to-start-the-holiday-week",
        "all_text": "Lean hog futures are up 30 to 65 cents across most contracts at midday. USDA’s national base hog price was not reported this morning due to light volume. The CME Lean Hog Index was down 15 cents on December 18 at $83.73.\nExport Sales data from this morning showed a total of 27,436 MT of pork sold in the week ending on December 4. Shipments were tallied at 31,074 MT.\nSpec traders were busy adding back to their net long in the week ending on December 9, according to CFTC data. The net long was back up 4,821 contracts to 51,471 contracts in that week.\nUSDA’s pork carcass cutout value from the Monday AM report was 74 cents lower at $99.02 per cwt. The loin and ham were the only primals reported lower. USDA estimated federally inspected hog slaughter for last week at 2.683 million head. That was 39,000 head below last week but 97,673 head above the same week last year.\nFeb 26 Hogs are at $85.050, up $0.550,\nApr 26 Hogs are at $89.775, up $0.650\nMay 26 Hogs is at $93.225, up $0.300,",
        "authors": "None",
        "publish_date": "2025-12-22 18:24:53",
        "published_at_raw": "2025-12-22T18:24:53Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are up 30 to 65 cents across most contracts at midday. USDA’s national base hog price was not reported this morning due to light volume. The CME Lean Hog Index was down 15 cents on December 18 at $83.73. Export Sales data from this...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c6ffcad2408b1e67fd9fa6a3abbbbc5f",
        "title": "U.S. Grain Export Inspections Rise From Prior Week",
        "doc_url": "https://www.marketscreener.com/news/u-s-grain-export-inspections-rise-from-prior-week-ce7d50d2d180f326",
        "all_text": "By Kirk Maltais\nExport inspections of U.S. grains are higher across the board from the previous week, the Agriculture Department said in its latest weekly report.\nThe USDA's Grain Export Inspections report published Monday said that for the week ended Dec. 18, corn inspections were 1.74 million metric tons, soybeans totaled 870,199 tons and wheat inspections were 627,443 tons. For corn and wheat, inspections were also higher than they were at this time last year, while soybeans were lower.\nChina was the leading destination for U.S. soybeans, with 326,861 tons shipped there for the week. Mexico was the top destination for both corn and wheat for the week.\nThis morning, the USDA confirmed a new flash sale of soybeans to China, with 396,000 tons sold for delivery across the 2025/26 and 2026/27 marketing years.\nCBOT grain futures are higher in morning trade, with CBOT corn up 0.4%, soybeans up 0.2%, and wheat up 0.9%.\nTo see related data, search \"USDA Grain Inspections for Export in Metric Tons\" in Dow Jones NewsPlus.\nWrite to Kirk Maltais at kirk.maltais@wsj.com\n(END) Dow Jones Newswires\n12-22-25 1208ET",
        "authors": "None",
        "publish_date": "2025-12-22 17:09:21",
        "published_at_raw": "2025-12-22T17:09:21Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\nExport inspections of U.S. grains are higher across the board from the previous week, the Agriculture Department said in its latest weekly report.\nThe USDA's Grain Export...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8d8ff4ae3c3d36094bdddebea6f7710a",
        "title": "Additional farm aid not planned, USDA official says",
        "doc_url": "https://www.desmoinesregister.com/story/money/agriculture/2025/12/22/farm-aid-usda/87882129007/",
        "all_text": "WASHINGTON ― The U.S. Department of Agriculture is not considering issuing more farm aid beyond its recently announced $12 billion package meant to help farmers weather poor economic conditions, says Richard Fordyce, the agency's under secretary for farm production and conservation.\nFarmers are facing low crop prices, high costs of agricultural inputs like fertilizer and the impacts of President Donald Trump's trade war, which has shrunk exports of some crops. While farmers welcomed news of the $12 billion package in early December, they warned that it would not make them whole or rescue the sagging farm economy.\nFarm losses this year could reach $44 billion, according to an estimate from North Dakota State University.\nFordyce said the USDA was aware the aid would fall short, but is not considering further assistance in part due to funding limitations.\n\"At this point, we feel like we’ve kind of done what we can do. I don’t know what next year will bring, but at this point, we’re where we’re going to be,\" Fordyce said.\nTrump administration officials have previously said the aid should serve as a stopgap until new farm supports from Trump's tax and spending bill take effect, like higher reference prices for crops.\nThe aid program allocates $11 billion to row crops like corn, soybeans and wheat, and $1 billion to fruits, vegetables and other \"specialty crops.\"\nFordyce said the agency has still not finalized how that $1 billion will be issued but that it is soliciting data and in",
        "authors": "None",
        "publish_date": "2025-12-22 15:36:30",
        "published_at_raw": "2025-12-22T15:36:30Z",
        "meta_site_name": "Des Moines Register",
        "description": "Though it falls short of the need, aid for farmers hurt by trade wars won't grow beyond the $12 billion already announced, a USDA undersecretary says.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9b11dd32b4210c736b19b484a85b3d44",
        "title": "If you bought this specific holiday meat, the USDA says you should not eat it",
        "doc_url": "https://www.pennlive.com/news/2025/12/if-you-bought-this-specific-holiday-meat-the-usda-says-you-should-not-eat-it.html",
        "all_text": "Olympia Provisions has recalled 1,930 pounds of sausage that may be contaminated with metal.\nThe ready-to-eat holiday kielbasa sausages were produced on Oct. 14, according to the U.S. Department of Agriculture’s Food Safety and Inspection Service.\nThe sausage was shipped to retail locations in California, Oregon and Washington, and was available nationwide through online direct-to-consumer sales.\nThe vacuum-sealed plastic packages are 16 ounces and contain one fully cooked Olympia Provisions uncured holiday kielbasa with a best-by date of Feb. 19, 2026.\nThe problem was discovered after Olympia Provisions notified FSIS that it received a consumer complaint regarding metal found in the product. There have been no confirmed reports of injury.\nPeople who purchased the kielbasa should not eat it. It can be thrown away or returned to the place of purchase.\nFor more information, send an email to Michelle Cairo, the owner of Olympia Provisions, at michelle@olympiaprovisions.com.",
        "authors": "None",
        "publish_date": "2025-12-22 12:46:07",
        "published_at_raw": "2025-12-22T12:46:07Z",
        "meta_site_name": "Mechanicsburg Patriot News ",
        "description": "Olympia Provisions has recalled 1,930 pounds of ready-to-eat holiday kielbasa sausages.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4d805d70f495320cab416ed772998494",
        "title": "U.S. Farm Agency Unlikely to Issue More Farm Aid, Says Official",
        "doc_url": "https://www.agriculture.com/partners-u-s-farm-agency-unlikely-to-issue-more-farm-aid-says-official-11874181",
        "all_text": "By Leah Douglas\nWASHINGTON, Dec. 19 (Reuters) - The U.S. Department of Agriculture is not considering issuing more farm aid beyond its recently announced $12 billion package meant to help farmers weather poor economic conditions, said Richard Fordyce, the agency's under secretary for farm production and conservation.\nFarmers are facing low crop prices, high costs of agricultural inputs like fertilizer and the impacts of President Donald Trump's trade war, which has shrunk exports of some crops. While farmers welcomed news of the $12 billion package earlier this month, they warned that it would not make them whole or rescue the sagging farm economy.\nFarm losses this year could reach $44 billion, according to an estimate from North Dakota State University.\nFordyce said the USDA was aware the aid would fall short, but is not considering further assistance in part due to funding limitations.\n\"At this point, we feel like we’ve kind of done what we can do. I don’t know what next year will bring, but at this point, we’re where we’re going to be,\" Fordyce said.\nTrump administration officials have previously said the aid should serve as a stopgap until new farm supports from Trump's tax and spending bill take effect, like higher reference prices for crops.\nThe aid program allocates $11 billion to row crops like corn, soybeans and wheat, and $1 billion to fruits, vegetables and other \"specialty crops.\"\nFordyce said the agency has still not finalized how that $1 billion will be issued b",
        "authors": "None",
        "publish_date": "2025-12-22 12:16:30",
        "published_at_raw": "2025-12-22T12:16:30Z",
        "meta_site_name": "Successful Farming",
        "description": "The USDA is not considering issuing more farm aid beyond its recently announced $12 billion package meant to help farmers weather poor economic conditions, said Richard Fordyce, the agency's under secretary for farm production and conservation.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d4cdaecc4987634a77254b8a37def8e4",
        "title": "USDA Confirms Bird Flu Case in Wisconsin Dairy Herd as New Wildlife Spillover",
        "doc_url": "https://www.agriculture.com/partners-usda-confirms-bird-flu-case-in-wisconsin-dairy-herd-as-new-wildlife-spillover-11874180",
        "all_text": "By Anjana Anil\nDec. 19 (Reuters) - The United States Department of Agriculture on Friday confirmed that a case of highly pathogenic avian influenza in a Wisconsin dairy herd marked a new spillover event from wildlife to cattle, separate from previous outbreaks.\nThe virus, identified as H5N1 clade 2.3.4.4b genotype D1.1., was confirmed through whole genome sequencing by the National Veterinary Services Laboratories on December 17, USDA’s Animal and Plant Health Inspection Service said in a statement.\nIt said most detections of highly pathogenic avian influenza in U.S. dairy herds have resulted from movements linked to an original spillover event that occurred in Texas in late 2023, involving the B3.13 strain.\nEarlier this year, two isolated spillovers were detected in Nevada and Arizona, involving the D1.1 strain.\nThe Wisconsin case, detected under USDA's National Milk Testing Strategy, has not led to additional herd infections, APHIS said.\nUSDA said the findings do not pose a risk to consumer health or the commercial milk supply, as pasteurization kills the virus and milk from affected animals is diverted or destroyed.\nIt added that the Centers for Disease Control and Prevention continues to consider the risk to the public to be low.\nUSDA urged dairy producers to maintain strict biosecurity and report any livestock showing clinical signs or unusual wildlife deaths.\nA bipartisan group of U.S. senators last week urged the administration of President Donald Trump to finalize a s",
        "authors": "None",
        "publish_date": "2025-12-22 12:13:04",
        "published_at_raw": "2025-12-22T12:13:04Z",
        "meta_site_name": "Successful Farming",
        "description": "The USDA on Friday confirmed that a case of highly pathogenic avian influenza in a Wisconsin dairy herd marked a new spillover event from wildlife to cattle, separate from previous outbreaks.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]