[
    {
        "id": "a1db0826b0f7ab3530d015ffdf87f207",
        "title": "Corn Pull Off Lows to Close Monday with Penny Losses",
        "doc_url": "https://www.barchart.com/story/news/36633450/corn-pull-off-lows-to-close-monday-with-penny-losses",
        "all_text": "Corn futures saw weakness for much of Monday, with contracts down 1 to 2 cents in the nearbys, pulling off early lows. The CmdtyView national average Cash Corn price was down a penny to $3.95.\nA private export sale of 150,320 MT of corn was sold to unknown destinations this morning.\nUSDA tallied corn export shipments at 1.589 MMT (62.32 mbu) during the week ending on December 11. That was 9.07% below the week prior’s revised total and 37.25% larger than the same week in 2024. Mexico was the top destination of 488,231 MT, with 301,240 MT headed to Japan and 219,729 MT to Spain. Marketing year exports for 2025/26 are now 22.501 MMT (885.84 mbu) since September 1, which is now 68.74% larger than the same period last year. USDA also reported 71,917 MT of sorghum to China.\nExport Sales data got another catchup this morning, with a total of 1.84 MMT of corn booked in the week of 11/20. That was on the higher end of traders looking for 1.1-2.2 MMT. That was a drop from the week prior, but still 73.4% larger than the same week last year.\nAnother update to the backlogged CFTC data this afternoon showed managed money flipping back to a net short of 10,872 contracts in the week ending on November 25 a move of 48,999 contracts to the short side.\nMar 26 Corn closed at $4.39 3/4, down 1 cent,\nNearby Cash was $3.95, down 1 cent,\nMay 26 Corn closed at $4.47 3/4, down 1 1/4 cents,\nJul 26 Corn closed at $4.53 3/4, down 1 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-15 21:59:34",
        "published_at_raw": "2025-12-15T21:59:34Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures saw weakness for much of Monday, with contracts down 1 to 2 cents in the nearbys, pulling off early lows. The CmdtyView national average Cash Corn price was down a penny to $3.95. A private export sale of 150,320 MT of corn was sold to...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bf798a51e040498c8a73634d5673d142",
        "title": "Corn Slipping to Start a New Week",
        "doc_url": "https://www.barchart.com/story/news/36628927/corn-slipping-to-start-a-new-week",
        "all_text": "Corn futures are down 2 to 3 cents across most contracts on Monday. The CmdtyView national average Cash Corn price is down 2 1/4 cents at $3.94 1/2.\nA private export sale of 150,320 MT of corn was sold to unknown destinations this morning.\nUSDA tallied corn export shipments at 1.589 MMT (62.32 mbu) during the week ending on December 11. That was 9.07% below the week prior’s revised total and 37.25% larger than the same week in 2024. Mexico was the top destination of 488,231 MT, with 301,240 MT headed to Japan and 219,729 MT to Spain. Marketing year exports for 2025/26 are now 22.501 MMT (885.84 mbu) since September 1, which is now 68.74% larger than the same period last year. USDA also reported 71,917 MT of sorghum to China.\nExport Sales data got another catchup this morning, with a total of 1.84 MMT of corn booked in the week of 11/20. That was on the higher end of traders looking for 1.1-2.2 MMT. That was a drop from the week prior, but still 73.4% larger than the same week last year.\nMar 26 Corn is at $4.38 1/2, down 2 1/4 cents,\nNearby Cash is at $3.94 1/2, down 2 1/4 cents,\nMay 26 Corn is at $4.46 3/4, down 2 1/4 cents,\nJul 26 Corn is at $4.52 3/4, down 2 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-15 17:58:12",
        "published_at_raw": "2025-12-15T17:58:12Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are down 2 to 3 cents across most contracts on Monday. The CmdtyView national average Cash Corn price is down 2 1/4 cents at $3.94 1/2. A private export sale of 150,320 MT of corn was sold to unknown destinations this morning. USDA tall...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "59d619eb40b11f752fac4e3398a9d4fe",
        "title": "Corn Starting Monday with Fractional Losses",
        "doc_url": "https://www.barchart.com/story/news/36623320/corn-starting-monday-with-fractional-losses",
        "all_text": "Corn price action is just fractionally lower this morning. Futures closed the Friday session with contracts down 4 to 6 cents across most nearbys, as December expired. March settled last week with a 4 cent loss. Friday’s open interest was up 17,121 contracts. The CmdtyView national average Cash Corn price was down 5 1/2 cents at $3.96 3/4.\nExport Sales data will get another catchup this morning, with traders looking for 1.1-2.2 MMT in corn sales during the week ending on 11/20.\nCFTC data was released on Friday afternoon showing data for the week ending on November 18, with managed money flipping to a net long of 38,127 contracts. That was a 77,650 contract move on the week. Another update will be released this afternoon.\nNearby Cash was $3.96 3/4, down 5 1/2 cents,\nMar 26 Corn closed at $4.40 3/4, down 5 3/4 cents, currently down 1/2 cent\nMay 26 Corn closed at $4.49, down 5 1/4 cents, currently down 1/4 cent",
        "authors": "None",
        "publish_date": "2025-12-15 13:25:23",
        "published_at_raw": "2025-12-15T13:25:23Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is just fractionally lower this morning. Futures closed the Friday session with contracts down 4 to 6 cents across most nearbys, as December expired. March settled last week with a 4 cent loss. Friday’s open interest was up 17,121 c...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3758d5dfc744d1be1e28319fd1106909",
        "title": "Paris wheat prices continue to fall, under pressure from abundant global supply",
        "doc_url": "https://www.marketscreener.com/news/paris-wheat-prices-continue-to-fall-under-pressure-from-abundant-global-supply-ce7d50d9dc88f123",
        "all_text": "Wheat prices fell again on the European market on Monday, weighed on by persistent pressure from abundant global supply and intensifying export competition. On Euronext, the most-traded contract for March delivery slipped 0.6% to €187.75 per tonne, while in Chicago, futures were down 0.8% at the start of the session. The downward trend that began last week is being confirmed, amid limited international demand and markets largely unresponsive to geopolitical tensions.\nTraders highlight the significant impact of the Argentine harvest, abundant and offered at highly competitive prices. The recent reduction in export taxes in Argentina further adds to this pressure, boosting the appeal of Argentine wheat among Asian and African buyers, despite quality issues linked to weather conditions. China, via the state-owned COFCO International, has launched the first bulk shipment of Argentine wheat bound for the country, confirming the dynamism of this origin on the global market.\nDespite ongoing tensions in the Black Sea, notably Russian attacks on ships in Ukrainian ports, markets remain largely insensitive to the situation. Prospects for a potential cease-fire in Ukraine are deemed too uncertain to influence prices, although a resumption of broader Ukrainian exports could, in theory, add to the pressure on prices. As it stands, the market remains driven by supply fundamentals and competitive pricing on the international stage.",
        "authors": "None",
        "publish_date": "2025-12-15 17:23:35",
        "published_at_raw": "2025-12-15T17:23:35Z",
        "meta_site_name": "MarketScreener",
        "description": "Wheat prices fell again on the European market on Monday, weighed on by persistent pressure from abundant global supply and intensifying export competition. On Euronext, the most-traded contract for...",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "157abadf5a1c9f235d171c4179b849f3",
        "title": "USDA must give states more time to implement new food aid restrictions, judge rules",
        "doc_url": "https://www.marketscreener.com/news/usda-must-give-states-more-time-to-implement-new-food-aid-restrictions-judge-rules-ce7d50d9df8ff024",
        "all_text": "(Corrects day of the week in paragraph 1)\nDec 15 (Reuters) - A federal judge on Monday ordered U.S. President Donald Trump's administration to extend a deadline for states to implement new immigration-related eligibility restrictions on food aid benefits, allowing them to avoid potentially severe financial penalties for failing to do so in time.\nU.S. District Judge Mustafa Kasubhai in Eugene, Oregon, at the behest of a group of Democratic-led states, issued an injunction requiring the U.S. Department of Agriculture to extend the expiration date of a grace period for the states to comply with the new restrictions on Supplemental Nutrition Assistance Program benefits from November 1 to April 9.\nThe judge, who was appointed by Democratic President Joe Biden, said guidance USDA issued on October 31 concerning who is eligible for the SNAP benefits, or food stamps, contributed to \"confusion\" that impeded states' ability to implement the new restrictions.\nThe guidance interpreted a provision in Trump's tax cuts and domestic policy law that restricts SNAP benefits to U.S. citizens and lawful permanent residents, also known as green card holders, aligning with the president's hardline immigration stance.\nGUIDANCE SPARKS LEGAL CHALLENGE\nAttorneys general from 21 states and the District of Columbia in a lawsuit filed last month had said the guidance unlawfully deemed permanent residents who were initially granted asylum or admitted as refugees to the United States as ineligible for SNAP",
        "authors": "None",
        "publish_date": "2025-12-15 22:56:26",
        "published_at_raw": "2025-12-15T22:56:26Z",
        "meta_site_name": "MarketScreener",
        "description": "A federal judge on Monday ordered U.S. President Donald Trump's administration to extend a deadline for states to implement new immigration-related eligibility restrictions on food aid benefits,...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "048a1f1943e619425ac958fb81ebd7b7",
        "title": "USDA must give states more time to implement new food aid restrictions, judge rules",
        "doc_url": "https://www.reuters.com/legal/government/usda-must-give-states-more-time-implement-new-food-aid-restrictions-judge-rules-2025-12-15/",
        "all_text": "Dec 15 (Reuters) - A federal judge on Monday ordered U.S. President Donald Trump's administration to extend a deadline for states to implement new immigration-related eligibility restrictions on food aid benefits, allowing them to avoid potentially severe financial penalties for failing to do so in time.\nU.S. District Judge Mustafa Kasubhai in Eugene, Oregon, at the behest of a group of Democratic-led states, issued an injunction requiring the U.S. Department of Agriculture to extend the expiration date of a grace period for the states to comply with the new restrictions on Supplemental Nutrition Assistance Program benefits from November 1 to April 9.\nSign up here.\nThe judge, who was appointed by Democratic President Joe Biden, said guidance USDA issued on October 31 concerning who is eligible for the SNAP benefits, or food stamps, contributed to \"confusion\" that impeded states' ability to implement the new restrictions.\nThe guidance interpreted a provision in Trump's tax cuts and domestic policy law that restricts SNAP benefits to U.S. citizens and lawful permanent residents, also known as green card holders, aligning with the president's hardline immigration stance.\nGUIDANCE SPARKS LEGAL CHALLENGE\nAttorneys general from 21 states and the District of Columbia in a lawsuit filed last month had said the guidance unlawfully deemed permanent residents who were initially granted asylum or admitted as refugees to the United States as ineligible for SNAP benefits.\nUSDA contended it",
        "authors": "None",
        "publish_date": "2025-12-15 22:56:24",
        "published_at_raw": "2025-12-15T22:56:24Z",
        "meta_site_name": "Reuters",
        "description": "A federal judge on Monday ordered U.S. President Donald Trump's administration to extend a deadline for states to implement new immigration-related eligibility restrictions on food aid benefits, allowing them to avoid potentially severe financial penalties for failing to do so in time.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b8272d5d3cdd391c58dece3d1ea49f6c",
        "title": "USDA Must Give States More Time to Implement New Food Aid Restrictions, Judge Rules",
        "doc_url": "https://www.usnews.com/news/politics/articles/2025-12-15/usda-must-give-states-more-time-to-implement-new-food-aid-restrictions-judge-rules",
        "all_text": "(Corrects day of the week in paragraph 1)\nBy Nate Raymond\nDec ‌15 (Reuters) - ​A federal judge on Monday ordered ‌U.S. President Donald Trump's administration to extend a deadline for states to implement ​new immigration-related eligibility restrictions on food aid benefits, allowing them to avoid potentially severe financial penalties for failing to do ‍so in time.\nU.S. District Judge Mustafa ​Kasubhai in Eugene, Oregon, at the behest of a group of Democratic-led states, issued an injunction requiring the ​U.S. Department of ⁠Agriculture to extend the expiration date of a grace period for the states to comply with the new restrictions on Supplemental Nutrition Assistance Program benefits from November 1 to April 9.\nThe judge, who was appointed by Democratic President Joe Biden, said guidance USDA issued on October 31 concerning who is eligible for the ‌SNAP benefits, or food stamps, contributed to \"confusion\" that impeded states' ability to implement the new restrictions.\nThe guidance ​interpreted a ‌provision in Trump's tax cuts ‍and domestic policy ⁠law that restricts SNAP benefits to U.S. citizens and lawful permanent residents, also known as green card holders, aligning with the president's hardline immigration stance.\nGUIDANCE SPARKS LEGAL CHALLENGE\nAttorneys general from 21 states and the District of Columbia in a lawsuit filed last month had said the guidance unlawfully deemed permanent residents who were initially granted asylum or admitted as refugees to the United ",
        "authors": "None",
        "publish_date": "2025-12-15 22:56:00",
        "published_at_raw": "2025-12-15T22:56:00Z",
        "meta_site_name": "U.S. News & World Report",
        "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c35be6664e7222ee38b0eea22ee6e12f",
        "title": "Highest risk recall: 60,000 pounds of popular breaded chicken product affected",
        "doc_url": "https://www.masslive.com/news/2025/12/highest-risk-recall-60000-pounds-of-popular-breaded-chicken-product-affected.html",
        "all_text": "Over 60,000 pounds of fully cooked, bone-in breaded chicken products are being recalled nationwide for misbranding and an undeclared allergen.\nAccording to the U.S. Department of Agriculture (USDA), this recall is for Suzanna’s Kitchen of Georgia, which said the products contain soy, a known allergen that is not disclosed on the product label.\nThe 8-piece cut, bone-in breaded chicken portions were produced on Oct. 16 and were shipped to restaurant locations nationwide. In total, 62,550 pounds of the chicken products are being recalled.\nThe products were distributed in 18 pound cases that contained four units of “Fully Cooked Breaded Chicken Portions” with the case code “P-1380 126237 B30851 23:11 K04” printed on the side of the packaging.\nThe problem was discovered after the company found the chicken products contained soy that has been mislabeled with a non-allergen containing product code.\nThe USDA classified this recall as a Class I meaning it “involves a health hazard situation where there is a ‘reasonable’ probability that use of the product will cause serious, adverse health consequences or death.”\nThere have been no confirmed reports of adverse reactions after eating these products. However, anyone concerned about an injury or illness should contact their healthcare provider.\nThe department said it’s “concerned” that some of the chicken could still be in restaurant refrigerators or freezers.\nRestaurants are urged by the USDA to not serve this product and instead toss t",
        "authors": "None",
        "publish_date": "2025-12-15 18:44:07",
        "published_at_raw": "2025-12-15T18:44:07Z",
        "meta_site_name": "MassLive",
        "description": "The product is considered hazardous and could cause serious adverse health consequences or death, according to the USDA.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "09a04967c583941d3aa7ff4a237574c4",
        "title": "Hogs Slipping Lower on Monday",
        "doc_url": "https://www.barchart.com/story/news/36628967/hogs-slipping-lower-on-monday",
        "all_text": "Lean hog futures are down 75 cent to $1 across most contracts on Monday. USDA’s national base hog price was up $2.07 in the Monday morning afternoon report at $73.00. The CME Lean Hog Index was up 23 cents on December 11 at $82.80.\nExport Sales data showed a total of 44,900 MT of pork sold for 2025 this morning, with 11,880 MT for 2026. Combined sales were a calendar year high. Shipments were 31,220 MT, a 3-week low.\nCommitment of Traders data showed a total of 13,524 contracts cut from the net long position as of November 18 to 57,988 contracts. We will get another catchup report this afternoon.\nUSDA’s pork carcass cutout value from the Monday AM report was $1.22 higher to $99.43 per cwt. The picnic and ham primals was the only reported lower. USDA estimated federally inspected hog slaughter for last week through Saturday at 2.727 million head. That was 30,000 head above last week and 166,503 head above the same week last year.\nFeb 26 Hogs are at $83.650, down $0.875,\nApr 26 Hogs are at $88.775, down $0.750\nMay 26 Hogs is at $91.925, down $0.975,",
        "authors": "None",
        "publish_date": "2025-12-15 17:58:12",
        "published_at_raw": "2025-12-15T17:58:12Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are down 75 cent to $1 across most contracts on Monday. USDA’s national base hog price was up $2.07 in the Monday morning afternoon report at $73.00. The CME Lean Hog Index was up 23 cents on December 11 at $82.80. Export Sales data...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "193a89f758889152fefa8cc9f4bc36de",
        "title": "Grains in the Red This Morning | Monday, Dec. 15, 2025",
        "doc_url": "https://www.agriculture.com/grains-in-the-red-this-morning-or-monday-dec-15-2025-11869018",
        "all_text": "Ahead of 9 a.m. CT, March corn was down 2½¢ at $4.38¼ per bushel.\nJanuary soybeans were down 9¾¢ at $10.67 per bushel.\nMarch CBOT wheat was down 4½¢ at $5.24¾ per bushel. March Kansas City wheat was down 5¢ at $5.13 per bushel. March Minneapolis wheat was down 3½¢ at $5.72¼.\n“Market focus remains largely on Chinese demand for U.S. soybeans and Brazil’s crop situation, with some attention on the ongoing talks for a potential end to the Russia/Ukraine war,” said the Commstock Report this morning.\nThe Commstock Report also noted: “Widespread rains fell across nearly all of Brazil’s major production areas last week. Conditions remain mostly favorable, though some are starting to talk about potential harvest delays if the heavier rains persist. More rains are in the forecast for Mato Grosso and Goias over the next 10 days to two weeks, while Parana, Sao Paulo, western Mato Grosso do Sul and parts of Minas Gerais will be dry. Any delays for Brazilian soybean harvest would also push back planting of safrinha corn.”\nUSDA announced new export sales this morning:\nUnknown destinations are buying 150,320 metric tons of corn for the 2025/2026 marketing year.\nChina is buying 136,000 metric tons of soybeans for the 2025/2026 marketing year.\nAhead of 9 a.m. CT, March feeder cattle were down 93¢ at $333.15 per hundredweight (cwt). February live cattle were down 50¢ at $229.05 per cwt. February lean hogs were down $1.30 at $83.23 per cwt.\nJanuary crude oil was down 53¢ at $56.91 per barrel.\nTh",
        "authors": "None",
        "publish_date": "2025-12-15 15:33:11",
        "published_at_raw": "2025-12-15T15:33:11Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA announced new export sales this morning.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4cd96a082da12cc18640b9a7575c23e1",
        "title": "Hog Traders Look to Monday Trade",
        "doc_url": "https://www.barchart.com/story/news/36623360/hog-traders-look-to-monday-trade",
        "all_text": "Lean hog futures posted 25 to 35 cent gains across the front months on Friday, with December down 7 cents upon expiration. February was up $2.25 last week. Friday’s open interest was up 889 contracts. USDA’s national base hog price was down 41 cents in the Friday afternoon report at $71.28. The CME Lean Hog Index was up 41 cents on December 10 at $82.57.\nCommitment of Traders data showed a total of 13,524 contracts cut from the net long position as of November 18 to 57,988 contracts. We will get another catchup report this afternoon.\nUSDA’s pork carcass cutout value from the Friday afternoon report was 63 cents lower to $98.21 per cwt. The ham primal was the only reported lower. USDA estimated federally inspected hog slaughter for last week through Saturday at 2.727 million head. That was 30,000 head above last week and 166,503 head above the same week last year.\nDec 25 Hogs closed at $83.325, down $0.075,\nFeb 26 Hogs closed at $84.525, up $0.350\nApr 26 Hogs closed at $89.525, up $0.300,",
        "authors": "None",
        "publish_date": "2025-12-15 13:25:23",
        "published_at_raw": "2025-12-15T13:25:23Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted 25 to 35 cent gains across the front months on Friday, with December down 7 cents upon expiration. February was up $2.25 last week. Friday’s open interest was up 889 contracts. USDA’s national base hog price was down 41 cents...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "481862f7a62c30efe220e3d73238eb50",
        "title": "Company recalls more than 60K pounds of chicken",
        "doc_url": "https://wjla.com/news/nation-world/chicken-recalls-recall-recalled-60k-lbs-pounds-allergen-mislabeling-breaded-soy-refrigerators-freezers-restaurant-stores-product-meat-nationwide",
        "all_text": "(WKRC) - A Georgia-based food company has recalled 62,550 pounds of its fully cooked, eight-piece cut, bone-in breaded chicken, the USDA said.\nSuzanna’s Kitchen issued the nationwide recall due to “misbranding and an undeclared allergen.” The product contains soy, a known allergen that was not listed on the label.\nThe Food Safety and Inspection Service said it is concerned the mislabeled chicken may still be in restaurant refrigerators or freezers. Restaurants are urged to throw away any of the product they have.\nThe issue was discovered after Suzanna’s Kitchen notified FSIS of the labeling error.",
        "authors": "None",
        "publish_date": "2025-12-15 02:36:51",
        "published_at_raw": "2025-12-15T02:36:51Z",
        "meta_site_name": "WJLA",
        "description": "A Georgia-based food company has recalled 62,550 pounds of its fully cooked, eight-piece cut, bone-in breaded chicken, the USDA said.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]