[
    {
        "id": "7313839de9784988dae45cbce105c434",
        "title": "Intestinal macrophages modulate synucleinopathy along the gut–brain axis",
        "doc_url": "https://www.nature.com/articles/s41586-025-09984-y",
        "all_text": "Mice\r\nAll experiments were performed in accordance with the UK Animals (Scientific Procedures) Act 1986 and following local ethical advice. Experimental procedures were approved by the UK Home Office… [+46459 chars]",
        "authors": "Sebastiaan De Schepper, Viktoras Konstantellos, James A. Conway, Dimitra Sokolova, Ludovica Zaccagnini, Matthew V. Cowley, Annerieke Sierksma, Maria Yudina, Marisa Edmonds, Daria Gavriouchkina, Bethany Geary, Amber Wallis, Meral Celikag, Zeynep Baykam, Mónica Vara-Pérez, Gerard Crowley, Fabian Tobias Hager, Mitchell Bijnen, David Posner, Kelvin Luk, Vuk Cerovic, Menna Clatworthy, Elizabeth J. Videlock, Zane Jaunmuktane, Kiavash Movahedi, Melanie Greter, Benny Chain, Dario R. Alessi, Soyon Hong, Tim Bartels",
        "publish_date": "2026-01-28 00:00:00",
        "meta_site_name": "Nature.com",
        "description": "Muscularis macrophages, housekeepers of enteric nervous system integrity and intestinal homeostasis, modulate α-synuclein pathology and neurodegeneration in models of Parkinson’s disease, and understanding the accompanying mechanisms could pave the way for ea…",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-01-29 02:08:03",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c29dd5bca2be0497abf684dfafee5c91",
        "title": "Natural variation in Phosphatidylinositol 4-Kinase OsPI4Kγ7 and its interaction with OsLIC balance rice yield and latitudinal adaptation",
        "doc_url": "https://www.nature.com/articles/s41467-026-68814-5",
        "all_text": "<li>Tilman, D. et al. Global food demand and the sustainable intensification of agriculture. Proc. Natl. Acad. Sci. USA.108, 2026020264 (2011).\r\nGoogle Scholar \r\n</li><li>Sweeney, M. &amp; McCouch, S… [+10836 chars]",
        "authors": "Rui Zhu, Tao Yang, Shichen Han, Qianfeng Hu, Jianyin Xie, Ningjia Jiang, An Zeng, Jianxin Liang, Yanlin Qin, Haixia Liu, Chenyu Xia, Zhanying Zhang, Jinjie Li, Xingming Sun, Zichao Li, Hongliang Zhang",
        "publish_date": "2026-01-28 00:00:00",
        "meta_site_name": "Nature.com",
        "description": "High yield and wide adaptation rice are crucial for grain supply and food security. Here the authors report OsPI4Kγ7 which contributes to different “adaptability-yield” trade-offs in japonica and indica, and provides an alternative breeding strategy for raisi…",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-01-29 02:08:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "76f278b914f4508810ebbce7bfc2a1f0",
        "title": "Can you slaughter a pig at home?",
        "doc_url": "https://www.lifesciencesworld.com/can-you-slaughter-a-pig-at-home/",
        "all_text": "Can You Slaughter a Pig at Home? A Comprehensive Guide\r\nSlaughtering a pig at homeis, in many places, legally permissible, but it requires adherence to specific regulations, ethical considerations, a… [+9434 chars]",
        "authors": "Noah Whitman",
        "publish_date": "2026-01-28 00:04:23",
        "meta_site_name": "Lifesciencesworld.com",
        "description": "Can You Slaughter a Pig at Home? A Comprehensive Guide Slaughtering a pig at home is, in many places, legally permissible, but it requires adherence to specific regulations, ethical considerations, and a commitment to humane and safe practices. It is essentia…",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-01-29 02:08:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3a732c5fac2e6ffa567aee7ceeb1ca07",
        "title": "The Real Reason Your Arteries, Kidneys, and Bones Age Too Fast",
        "doc_url": "https://articles.mercola.com/sites/articles/archive/2026/01/28/phosphate-additives-health-risks.aspx",
        "all_text": "Mercola proudly supports these charities and organizations. View All \r\nDisclaimer: The entire contents of this website are based upon the opinions of Dr. Mercola, unless otherwise noted. Individual a… [+1007 chars]",
        "authors": "Dr. Mercola",
        "publish_date": "2026-01-28 00:00:00",
        "meta_site_name": "Mercola.com",
        "description": "Most people have learned, one way or another, to be cautious about refined sugar. They know it drives insulin resistance, weight gain, inflammation, and fatty liver disease. They also know fructose is especially dangerous when separated from the fiber and nut…",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-01-29 02:08:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]