[
    {
        "id": "f9f4f3722fa7509494fa933f0fc92fc2",
        "title": "Trump administration launches animal cruelty crackdown with new strike force",
        "doc_url": "https://www.foxnews.com/media/trump-administration-launches-multi-agency-strike-force-crack-down-animal-abuse",
        "all_text": "Senior officials in President Donald Trump’s administration say they are cracking down on animal cruelty, rolling out coordinated actions across the Justice Department, the Department of Agriculture (USDA) and the Department of Health and Human Services (HHS) to target dogfighting, puppy mills and animal testing.\n\"We are forming a strike force... and we're going to have designated U.S. attorneys in every state to prosecute these [animal abuse] cases,\" said Attorney General Pam Bondi on \"My View with Lara Trump\" on Saturday.\nBondi appeared with Agriculture Secretary Brooke Rollins and Health and Human Services Secretary Robert F. Kennedy Jr. to discuss their interagency animal welfare initiative.\nHHS UNLEASHES SWEEPING CRACKDOWN ON CHILD ‘SEX-REJECTING PROCEDURES,’ THREATENS HOSPITAL, MEDICAID FUNDING\nBondi said her department would work with the USDA to conduct special training for prosecutors and law enforcement agents on executing search warrants in animal abuse cases.\n\"We just last week convicted someone, for the first time ever, of using a firearm in a violent crime, and the violent crime was dogfighting,\" Bondi said.\nIn another example that shows \"no one is above the law,\" Bondi told host Lara Trump that 190 dogs were seized from former NFL player LeShon Johnson.\n\"That was the most seized from one single defendant. So we're coming after you if you're going after these babies,\" she said, holding a small black puppy named Guru in her lap.\nRFK JR. ANNOUNCES 'HISTORIC CRACKD",
        "authors": "None",
        "publish_date": "2025-12-21 16:41:22",
        "published_at_raw": "2025-12-21T16:41:22Z",
        "meta_site_name": "Fox News",
        "description": "Trump administration officials launched a coordinated animal welfare initiative across the Justice Department, USDA and HHS to combat dogfighting, puppy mills and animal testing.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]