[
    {
        "id": "d2edc88136cbb2cc11e39190023c586b",
        "title": "Corn Closes Slightly Higher on Thursday",
        "doc_url": "https://www.barchart.com/story/news/37310221/corn-closes-slightly-higher-on-thursday",
        "all_text": "Corn futures posted fractional to 2 cent gains on Thursday. The CmdtyView national average Cash Corn price was up 1 3/4 cents at $3.95 1/4.\nExport Sales data from this morning showed 1.649 MMT of corn sales in the week of January 22. That was back down from the previous week, but still 21.4% above the same week last year. Japan was the top buyer of 365,100 MT, with 350,800 MT to Mexico and 339,500 MT to Colombia.\nCensus trade data showed a total of 7.305 MMT (287.6 mbu) of corn shipped during November. That was the second largest total for the month on record and the largest monthly total since last April.\nDistillers exports were down from a year ago at 933,557 MT. Ethanol exports were a record for November at 211.33 million gallons, which was also the second largest monthly total for any month on record.\nMar 26 Corn closed at $4.30 3/4, up 3/4 cent,\nNearby Cash was $3.95 1/4, up 1 3/4 cents,\nMay 26 Corn closed at $4.39, up 1 cent,\nJul 26 Corn closed at $4.45 3/4, up 1 3/4 cents,",
        "authors": "None",
        "publish_date": "2026-01-29 23:18:23",
        "published_at_raw": "2026-01-29T23:18:23Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted fractional to 2 cent gains on Thursday. The CmdtyView national average Cash Corn price was up 1 3/4 cents at $3.95 1/4. Export Sales data from this morning showed 1.649 MMT of corn sales in the week of January 22. That was back d...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4d9ddc8f19ee9bf62619196b1020d642",
        "title": "Is Weather the Only Hope for Higher Corn and Soybean Prices?",
        "doc_url": "https://www.agriculture.com/is-weather-the-only-hope-for-higher-corn-and-soybean-prices-11895714",
        "all_text": "A surprise bearish January USDA WASDE report has weighed on corn and soybean futures. While there has been some modest price recovery since the Jan. 12 report, the perception of abundant U.S. and global supplies of soybeans and corn may keep prices in check for the short term.\nRecord Soybean Carryout\nIn the January WASDE report, USDA increased planted soybean acres to 81.2 million acres, up from 81.1 in December's report. Yield was unchanged at 53 bushels per acre. That means total production for the 2025/2026 crop year is now pegged at 4.262 billion bushels, up from 4.253 billion in the December WASDE.\nDemand for soybean exports was reduced to 1.575 billion bushels, while demand for crush was increased to 2.570 billion bushels. Ultimately, U.S. ending stocks for soybeans are now pegged at 350 million bushels, up from 290 billion in December.\nLooking at global estimates, USDA increased the potential size of the Brazil soybean crop to 178 million metric tons (mmt), an increase of 3 mmt. The Argentina crop is marked at 48.50. Between ample U.S. and South American supplies, global carryout for soybeans was increased to 124.41 mmt, up from 122.37 mmt. It is a record large carryout amount.\nRecord Corn Crop Expected\nCorn received negative news on the production side. Between an increase in harvested acres to 91.3 million and a higher than expected yield forecast of 186.5 bushels per acre, estimates for the 2025/2026 crop year are now pegged at a record 17.02 billion bushels.\nThankf",
        "authors": "None",
        "publish_date": "2026-01-29 22:41:40",
        "published_at_raw": "2026-01-29T22:41:40Z",
        "meta_site_name": "Successful Farming",
        "description": "Markets analyst Naomi Blohm breaks down how record corn supplies and massive global soybean stocks leave weather as a key price driver, and offers insights into marketing grain in 2026.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2c204f32f985a40f29bd9531a8764ad9",
        "title": "CoBank data reveals farmers were aggressive sellers of soybeans in fall 2025",
        "doc_url": "https://www.manilatimes.net/2026/01/30/tmt-newswire/globenewswire/cobank-data-reveals-farmers-were-aggressive-sellers-of-soybeans-in-fall-2025/2268243",
        "all_text": "Late year market rally spurred soybeans sales, but farmers remain reluctant to sell corn and wheat at current price lows\nDENVER, Jan. 29, 2026 (GLOBE NEWSWIRE) -- U.S. farmers were aggressive sellers of soybeans last fall as prices climbed after trade relations eased between the U.S. and China. With higher prices and a swifter pace of sales, commercial ownership of soybeans rose sharply while use of delayed pricing programs and basis contracts fell. Meanwhile, corn and wheat markets saw the opposite trend amid depressed prices. Farmers increased their use of DP programs and basis contracts for corn and wheat, leaving pricing open in hopes of future market recoveries.\nAccording to a new report from CoBank’s Knowledge Exchange, off-farm grain storage hit record levels last fall with farmers shifting more soybeans and wheat to commercial storage to free up on-farm space for the record corn harvest. The report draws on CoBank’s proprietary data set, which includes grain companies from around the U.S. that provide monthly borrowing base position reports. The surveys do not include farmers’ marketing positions for commodities stored on farm.\n\"CoBank’s data reveals that farmers have been patient sellers of corn and wheat,” said Tanner Ehmke, lead grains and oilseeds economist with CoBank. \"Any material increase in corn and wheat prices will likely be met with heavier selling pressure compared to soybeans, which already experienced a higher level of farmer selling last fall. The incr",
        "authors": "None",
        "publish_date": "2026-01-29 20:37:45",
        "published_at_raw": "2026-01-29T20:37:45Z",
        "meta_site_name": "The Manila Times",
        "description": "Late year market rally spurred soybeans sales, but farmers remain reluctant to sell corn and wheat at current price lows",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0c9ae0174b45e8418cf4482611eceb07",
        "title": "Corn Holding onto Gains at Midday",
        "doc_url": "https://www.barchart.com/story/news/37304170/corn-holding-onto-gains-at-midday",
        "all_text": "Corn futures are trading with fractional to penny gains so far on Thursday. The CmdtyView national average Cash Corn price is up 1 1/4 cents at $3.95 3/4.\nExport Sales data from this morning showed 1.649 MMT of corn sales in the week of January 22, near the middle of estimates of at 1 to 2.5 MMT in the week of January 22. That was back down from the previous week, but still 21.4% above the same week last year.\nCensus trade data showed a total of 7.305 MMT (287.6 mbu) of corn shipped during November. That was the second largest total for the month on record and the largest monthly total since last April.\nDistillers exports were down from a year ago at 933,557 MT. Ethanol exports were a record for November at 211.33 million gallons, which was also the second largest monthly total for any month on record.\nMar 26 Corn is at $4.30 1/4, up 1/4 cent,\nNearby Cash is at $3.95 3/4, up 1 1/4 cents,\nMay 26 Corn is at $4.38 1/4, up 1/4 cent,\nJul 26 Corn is at $4.45, up 1 cent,",
        "authors": "None",
        "publish_date": "2026-01-29 18:23:50",
        "published_at_raw": "2026-01-29T18:23:50Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are trading with fractional to penny gains so far on Thursday. The CmdtyView national average Cash Corn price is up 1 1/4 cents at $3.95 3/4. Export Sales data from this morning showed 1.649 MMT of corn sales in the week of January 22,...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d39fa4c620a21e0f5aa8346882c26d9f",
        "title": "Corn Trading Higher Ahead of Export Sales Release",
        "doc_url": "https://www.barchart.com/story/news/37295923/corn-trading-higher-ahead-of-export-sales-release",
        "all_text": "Corn price action is up 1 to 3 cents so far on Thursday morning. Futures got some spillover strength from gains in wheat and recent weakness in the US dollar index, as contracts closed with 1 ¼ to 3 ½ cent gains across the board. Preliminary open interest was up 20,796 contracts, suggesting new buying interest. The CmdtyView national average Cash Corn price was up 3 3/4 cents at $3.94 1/2.\nEIA data from Wednesday morning showed ethanol production slipping 5,000 barrels per day to 1.114 million bpd in the week of January 23. Stocks did see a draw of 339,000 barrels to 25.4 million barrels. Exports were down 61,000 bpd in that week to 157,000 bpd, with refiner inputs of ethanol rising 31,000 bpd to 883,000 bpd.\nExport Sales data will be released on Thursday, with traders looking for 2025/26 corn bookings in the range of 1 to 2.5 MMT in the week of January 22. Sales for 2026/27 are seen in between 0 and 200,000 MT.\nMar 26 Corn closed at $4.30, up 3 1/2 cents, currently up 2 1/2 cents\nNearby Cash was $3.94 1/2, up 3 3/4 cents,\nMay 26 Corn closed at $4.38, up 3 1/4 cents, currently up 2 1/4 cents\nJul 26 Corn closed at $4.44, up 3 1/4 cents, currently up 2 cents",
        "authors": "None",
        "publish_date": "2026-01-29 13:18:20",
        "published_at_raw": "2026-01-29T13:18:20Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is up 1 to 3 cents so far on Thursday morning. Futures got some spillover strength from gains in wheat and recent weakness in the US dollar index, as contracts closed with 1 ¼ to 3 ½ cent gains across the board. Preliminary open int...",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "895681cf1fddc28c401ed2fedf78cc02",
        "title": "Soybean Meal Is Heating Up. How Much Higher Can Prices Go?",
        "doc_url": "https://www.barchart.com/story/news/37300236/soybean-meal-is-heating-up-how-much-higher-can-prices-go",
        "all_text": "May soybean meal futures (ZMK26) present a buying opportunity on more price strength.\nSee on the daily bar chart for May soybean meal futures that prices have rebounded from the January low. See, too, at the bottom of the chart that the moving average convergence divergence (MACD) indicator is in a bullish posture as the blue MACD line is above the red trigger line and both lines are trending up. Chart history shows that meal prices below $300.00 are a value-buying opportunity.\nFundamentally, the recent slump in the U.S. dollar index ($DXY) to a four-year low this week is price-friendly for U.S. grains and the soy complex — making then more price-competitive on the world trade markets. Also, there are some emerging dry pockets in South American soybean-growing regions that have the attention of grain market bulls.\nA move in May soybean meal futures above chart resistance at this week’s high of $304.10 would give the bulls more power and it would also become a buying opportunity. The upside price objective would be $327.50, or above. Technical support, for which to place a protective sell stop just below, is located at $295.00.\nIMPORTANT NOTE: I am not a futures broker and do not manage any trading accounts other than my own personal account. It is my goal to point out to you potential trading opportunities. However, it is up to you to: (1) decide when and if you want to initiate any trades and (2) determine the size of any trades you may initiate. Any trades I discuss are hyp",
        "authors": "None",
        "publish_date": "2026-01-29 15:29:26",
        "published_at_raw": "2026-01-29T15:29:26Z",
        "meta_site_name": "Barchart",
        "description": "May soybean meal futures present a buying opportunity on more price strength.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "10d371ddc545cedf55dc9acdfd6073fb",
        "title": "Soybeans Pulling Back at Midday",
        "doc_url": "https://www.barchart.com/story/news/37304180/soybeans-pulling-back-at-midday",
        "all_text": "Soybeans are down 2 to 4 ¼ cents at midday. The cmdtyView national average Cash Bean price is 4 1/4 cents lower at $10.04 1/2. Soymeal futures were $0.90 to $1.50 lower, with Soy Oil futures 40 to 45 points lower.\nUSDA released Export Sales data for the week ending on 1/23 this morning, with a total of 818,972 MT of soybean sold that week, within estimates of 0.4 to 1.8 MMT in old crop soybean sales. That was just a third of the previous week’s sales, but still more than double the same week last year.\nSoybean meal sales were tallied at 464,297 MT, on the higher side of estimates between 225,000 and 500,000 MT. Soybean oil sales were at 22,052 MT, in the higher end of trade ideas of a range of 0 to 26,000 MT.\nCensus trade data showed November soybean exports at just 4.29 MMT (157.73 mbu), which was the lowest total for the month since 2007. Meal shipments were back down from last year’s record at 1.34 MMT for November, with bean oil at 45,810 MT.\nMar 26 Soybeans are at $10.70 3/4, down 4 1/4 cents,\nNearby Cash is at $10.04 1/2, down 4 1/4 cents,\nMay 26 Soybeans are at $10.84 1/4, down 3 1/2 cents,\nJul 26 Soybeans are at $10.98 1/4, down 2 3/4 cents,",
        "authors": "None",
        "publish_date": "2026-01-29 18:23:50",
        "published_at_raw": "2026-01-29T18:23:50Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans are down 2 to 4 ¼ cents at midday. The cmdtyView national average Cash Bean price is 4 1/4 cents lower at $10.04 1/2. Soymeal futures were $0.90 to $1.50 lower, with Soy Oil futures 40 to 45 points lower. USDA released Export Sales data for...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]