[
    {
        "id": "e3eb93146b2241f1151c32393404166f",
        "title": "USDA May Trim U.S. Soy Export Outlook in Key Crop Reports, Analysts Say",
        "doc_url": "https://www.agriculture.com/partners-usda-may-trim-u-s-soy-export-outlook-in-key-crop-reports-analysts-say-11883093",
        "all_text": "by Julie Ingwersen\nGrain analysts expect the U.S. Department of Agriculture may trim what some believe were overly optimistic estimates for soybean export demand in the current crop year, especially given lower sales to China, when it releases closely watched crop reports on Monday.\nThey also expect lower estimates for U.S. corn and soybean harvests, in part reflecting dry autumn weather, although global supplies are expected to remain plentiful with large South American harvests imminent.\nThe monthly report's view of demand for U.S. grains will get particular scrutiny as farmers grapple with low prices and a hit to exports - especially for soybeans - from global tariff wars, which compelled the Trump administration to announce a $12 billion aid program for growers.\n\"The day of reckoning is coming for USDA to have to reflect lower soybean exports,\" said Randy Mittelstaedt, an analyst with brokerage R.J. O'Brien, a StoneX company.\nThe USDA will release several major reports in its biggest data dump of the year on Monday at 11 a.m. CST (1700 GMT), including a monthly world supply/demand report, a U.S. crop production report, a quarterly rundown of U.S. grain stockpiles and a winter wheat seedings report.\nSoybean Exports Hit by China Tensions, Brazil Competition\nWhile export sales of U.S. corn for the current season are projected at a record high, soybean exports are projected to fall amid trade tensions with top global buyer China and competition from Brazil, where farmers are ",
        "authors": "None",
        "publish_date": "2026-01-11 14:40:07",
        "published_at_raw": "2026-01-11T14:40:07Z",
        "meta_site_name": "Successful Farming",
        "description": "Grain analysts expect the U.S. Department of Agriculture may trim what some believe were overly optimistic estimates for soybean export demand in the current crop year, especially given lower sales to China, when it releases closely watched crop reports on Monday.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:43",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "48318abbe38308638c5765703250bb84",
        "title": "Mitch Albom: Constantly flipping food pyramid can make your tummy ache",
        "doc_url": "https://www.freep.com/story/sports/columnists/mitch-albom/2026/01/11/mitch-albom-food-pyramid/88105203007/",
        "all_text": "When we were kids, we used to pull open the refrigerator and moan, “There’s nothing to eat.”\nThe shelves weren’t empty. There was plenty to choose. What we meant by “nothing to eat” was nothing we wanted to eat.\nWhich brings us to the American diet.\nLast week, the Department of Agriculture released a fresh set of guidelines for what we should and shouldn’t consume. It contained a new “food pyramid,” a relic from the last century in which recommended foods make up the wide part and foods to be minimalized make up the narrow point.\nThis new pyramid flipped the script from pyramids past. The one from the 1990s recommended grains and starches — including bread, cereal and pasta — as the highest intake, with fats and oils at the bottom.\nThe 2026 version puts protein, dairy, healthy fats and vegetables at the top, and grains in the basement.\nRobert F. Kennedy Jr., the new Health and Human Services secretary, apparently had major input on this list. He told the media it represented “the most significant reset of federal nutrition policy in history.”\nMaybe. But when I read it, it only confirms what I have long believed:\nNothing generates more opinions in this country than what you should eat.\nA generational thing\nRemember the Woody Allen film “Annie Hall” where he says, “Everything our parents said was good is bad. Sun, milk, red meat ... college.”\nThat’s kind of how it is with food. Every generation has its strong beliefs about what’s good for you, and the next generation says: “You",
        "authors": "None",
        "publish_date": "2026-01-11 05:01:15",
        "published_at_raw": "2026-01-11T05:01:15Z",
        "meta_site_name": "Detroit Free Press",
        "description": "The USDA just released new dietary guidelines that flip the script on food pyramids past.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:02",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]