[
    {
        "id": "a758da6b3701000d4ea49baed62cb3f6",
        "title": "The Number and Composition of Legal Entities Engaged in Farming: Initial Evidence from FSA Payment Files",
        "doc_url": "https://www.agriculture.com/partners-the-number-and-composition-of-legal-entities-engaged-in-farming-initial-evidence-from-fsa-payment-files-11878272",
        "all_text": "By J.R. Glenn and Joe Janzen\nNote: This article was written by University of Illinois Agricultural and Consumer Economics M.S. student J.R. Glenn and edited by Joe Janzen. It is one of several excellent articles written by graduate students in Prof. Janzen’s ACE 527 class in advanced agricultural price analysis this fall.\nFarm payments are intended to aid farmers by supporting incomes, reducing risk, and achieving conservation goals. However, payments may change farmer behavior in ways that are market distorting (Zulauf 2013). Such changes may include the choice of an individual to farm and the choice of the business structure or legal entity by which that individual engages in farming.\nFarm program payments made by USDA’s Farm Service Agency (FSA) are paid to individuals and other legal entities engaged in farming. These may include partnerships, corporations, and trusts. However, farm program payments have generally included payment limits that cap the amount paid to individuals (not legal entities, but the individuals who own them) under each program in each year. These caps may incentivize individuals to create legal entities to become “producers” to evade payment limits. FSA regulations specifically prohibit the adoption of entity ownership schemes to avoid payment limitations to individuals under federal farm subsidy payment programs (Farm Service Agency, 2021), but there have been instances where farming operations have been alleged to use a multiple entity farm struct",
        "authors": "None",
        "publish_date": "2026-01-01 22:53:56",
        "published_at_raw": "2026-01-01T22:53:56Z",
        "meta_site_name": "Successful Farming",
        "description": "This article seeks to demystify the complex connections between farms, farmers, legal entities, and farm payments using data from the USDA’s Farm Service Agency Payment Files.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "187ad65cbfbafe9d41041df456d9f13a",
        "title": "Oklahoma’s Ban on Chinese-Owned Farmland Made an Exception for Smithfield Foods",
        "doc_url": "https://www.agriculture.com/partners-oklahoma-s-ban-on-chinese-owned-farmland-made-an-exception-for-smithfield-foods-11878056",
        "all_text": "by Juan Vassallo\nOklahoma lawmakers have passed measures limiting foreign ownership of farmland in response to concerns about Chinese nationals and companies buying agricultural land in the state.\nWhile approximately 4.3% of Oklahoma farmland is foreign-owned, according to the USDA’s most recent filings, most of that is held by Canadian and European companies for renewable energy projects. Less than 1% of that share is Chinese.\nStill, anti-China rhetoric has largely driven legislation, and a recent poll shows Republicans nationwide are concerned about Chinese ownership of U.S. farmland. Despite that concern, this new state legislation includes exemptions for Chinese-owned food supply companies.\nThe carve-outs specifically exempt Smithfield Foods, the only Chinese-owned company with farmland in Oklahoma. Smithfield Foods, owned by China’s WH Group, is not affected by the restrictions and continues to raise hogs on roughly 2,575 acres in northwest Oklahoma.\nOklahoma’s restrictions mirror a broader national movement in mostly Republican states to curb foreign farmland ownership, driven by security concerns over countries the government deems “hostile.” Yet, unlike states such as Arkansas, Oklahoma lawmakers have shown little interest in forcing Chinese-owned companies already operating in the state to divest or limit their ability to expand.\nIn 2023, Arkansas Attorney General Tim Griffin ordered the agri-chemical firm Syngenta, owned by the Chinese conglomerate ChemChina, to sel",
        "authors": "None",
        "publish_date": "2026-01-01 14:01:35",
        "published_at_raw": "2026-01-01T14:01:35Z",
        "meta_site_name": "Successful Farming",
        "description": "While approximately 4.3% of Oklahoma farmland is foreign-owned, according to the USDA’s most recent filings, most of that is held by Canadian and European companies for renewable energy projects. Less than 1% of that share is Chinese.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a798a58623829f97bb4d856d42b9c1cc",
        "title": "SNAP benefits change: Beneficiaries can’t use funds to buy soda and candy in these states",
        "doc_url": "https://www.financialexpress.com/world-news/us-news/snap-benefits-change-beneficiaries-cant-use-funds-to-buy-soda-and-candy-in-these-states/4094693/",
        "all_text": "Millions of Supplemental Nutrition Assistance Program (SNAP) recipients are about to face new limitations on what they can use the federal assistance program to buy, including bans on soda, energy drinks and candy, according to the US Department of Agriculture.\nWhich states will implement the changes?\nAt least 18 states will implement changes to the federal Supplemental Nutrition Assistance Program in the new year, according to the USDA. Indiana, Iowa, Nebraska, Utah and West Virginia will implement the changes in January.\nThe remaining 13 states will make changes later in the year.\n“The Trump Administration is leading bold reform to strengthen integrity and restore nutritional value within the Supplemental Nutrition Assistance Program,” the USDA said in a statement about the upcoming changes.\nThe five state waivers take effect on January 1 and will affect about 1.4 million people. Utah and West Virginia will ban the use of SNAP to buy soda and soft drinks, while Nebraska will prohibit soda and energy drinks.\nIndiana will target soft drinks and candy. In Iowa, which has the most restrictive rules to date, the SNAP limits affect taxable foods, including soda and candy, but also certain prepared foods, according to PBS.\n“The items list does not provide enough specific information to prepare a SNAP participant to go to the grocery store,” Gina Plata-Nino, SNAP director for the anti-hunger advocacy group Food Research & Action Center.\n“Many additional items, including certain pre",
        "authors": "None",
        "publish_date": "2026-01-01 13:51:26",
        "published_at_raw": "2026-01-01T13:51:26Z",
        "meta_site_name": "The Financial Express",
        "description": "\"The Trump Administration is leading bold reform to strengthen integrity and restore nutritional value within the Supplemental Nutrition Assistance Program,\" the USDA said in a statement about the upcoming changes.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6ffa90306fbe3ab0abf3034e13288d2b",
        "title": "USDA details aid to farmers from package",
        "doc_url": "https://www.arkansasonline.com/news/2026/jan/01/usda-details-aid-to-farmers-from-package/",
        "all_text": "The U.S. Department of Agriculture on Wednesday detailed how much aid per acre farmers can expect for each row crop from the $12 billion package that President Donald Trump announced in December.\nThe details arrived after most farmers have already met with their bankers to arrange financing for 2026 crops and placed orders for the seed and fertilizer they will need. But officials have promised that the payments should arrive by the end of February.\nSoybean farmers have been hit especially hard by Trump's trade war with China, which stopped buying any American crops after Trump announced his tariffs this spring. China is the world's largest buyer of soybeans. This aid package is expected to help farmers weather the trade disruptions until China buys more soybeans under an agreement announced in October and until provisions of Trump's huge budget bill take effect later this year.\nSoybean farmers will get $30.88 per acre while corn farmers will receive $44.36. Another crop hit hard when China stopped buying was sorghum, and those farmers will get $48.11 per acre. The amounts are based on a USDA formula on the cost of production.\nThe aid payments will be capped at $155,000 per farmer or entity, and only farms that make less than $900,000 in adjusted gross income will be eligible. During the first Trump administration, a number of large farms found ways around payment limits and collected millions of dollars.\nThe USDA said it would use a formula that estimates production costs to ",
        "authors": "None",
        "publish_date": "2026-01-01 09:16:00",
        "published_at_raw": "2026-01-01T09:16:00Z",
        "meta_site_name": "Arkansas Online",
        "description": "The U.S. Department of Agriculture on Wednesday detailed how much aid per acre farmers can expect for each row crop from the $12 billion package that President Donald Trump announced in December.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ffe9ac465506c805f0ad24347701c852",
        "title": "USDA details $12 billion farm aid payouts; soybean growers say relief inadequate",
        "doc_url": "https://www.thehindubusinessline.com/economy/agri-business/usda-details-12-billion-farm-aid-package-favouring-rice-cotton-soy-farmers-warn-of-strain/article70459319.ece",
        "all_text": "CHICAGO The U.S. Department of Agriculture released details on Wednesday about how ​much row crop farmers will receive next year from a $12 billion aid program, ‌but soybean growers say such payments fall short of helping those ​hurt by low crop prices and trade disputes.\nThe Farmer Bridge Assistance program is expected to distribute $11 billion in one-time payments to farmers, who will be paid on a per-acre rate if they planted one of the 19 commodity crops identified as being eligible for the program, USDA said in a statement on Wednesday.\nU.S. farmers produced massive corn and soybean harvests this fall amid a global glut of grain, and ​lost billions of dollars amid falling crop prices. Soybean farmers were particularly ⁠hard hit by the loss of soybean sales to China, by far the world's top buyer, when it turned to South American suppliers during stalled trade talks.\nWhile the aid is expected to help farmers prepare ​for the next planting season, growers and ⁠agricultural economists say the payments are a fraction of farm losses and will not rescue the sagging U.S. farm economy.\nThe highest per-acre payments will be paid to rice farmers, who could receive $132.89 an acre; cotton farmers, at $117.35 an acre; and oat ‌farmers, at $81.75 an acre. Meanwhile, farmers are eligible for a payment of $44.36 ‌per corn acre, $30.88 per soybean acre and $39.35 per wheat acre. The payments are calculated using 2025 planted acres, cost-of-production data, and market conditions, USDA sai",
        "authors": "None",
        "publish_date": "2026-01-01 02:15:23",
        "published_at_raw": "2026-01-01T02:15:23Z",
        "meta_site_name": "The Hindu Business Line",
        "description": "USDA releases per-acre payouts under a $12 billion farm aid plan, but soybean growers say payments fall short amid low prices and trade-related losses.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]