[
    {
        "id": "3e581383a4575811dc62ee73ad4db4e6",
        "title": "Corn Falls Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/36485985/corn-falls-lower-on-friday",
        "all_text": "Corn futures posted losses of a penny to 2 ½ cents on Friday, with March closing the week with a 3 cent loss. The CmdtyView national average Cash Corn price was down 2 ¼ cents on the day at $3.99 1/4.\nCommitment of Traders data from Friday afternoon showed managed money slashing 71,479 contracts from their net short position as of October 28. That took the position to 89,506 contracts. Commercials were trimming longs and adding shorts, increasing their net short by 77,722 contracts to 128,585 contracts\nUSDA will release another catchup report for Export Sales data on Monday, with traders looking for 1-2 MMT of corn bookings in the week ending on November 6.\nThe monthly WASDE report will be out on Tuesday, with analysts surveyed by Bloomberg looking for 2.145 bbu of US corn ending stocks, a 9 mbu drop from the November report if realized.\nThe Buenos Aires Grains Exchange estimates the Argentina corn crop at 44% planted, lagging the 46% pace from last year.\nDec 25 Corn closed at $4.36 3/4, down 1 cent,\nNearby Cash was $3.99 1/4, down 2 1/4 cents,\nMar 26 Corn closed at $4.44 3/4, down 2 1/2 cents,\nMay 26 Corn closed at $4.52 1/4, down 2 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-05 23:28:45",
        "published_at_raw": "2025-12-05T23:28:45Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted losses of a penny to 2 ½ cents on Friday, with March closing the week with a 3 cent loss. The CmdtyView national average Cash Corn price was down 2 ¼ cents on the day at $3.99 1/4. Commitment of Traders data from Friday afternoon...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7e938af02dc99dcf7a1ecc6f38453ccd",
        "title": "Corn Heading Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/36481118/corn-heading-lower-on-friday",
        "all_text": "Corn futures are showing 3 cent losses across most contracts on Friday, with December down just ¾ cent and thin and in deliveries. The CmdtyView national average Cash Corn price is down 3 cents on the day at $3.99 3/4.\nUSDA will release another catchup report for Export Sales data on Monday, with traders looking for 1-2 MMT of corn bookings in the week ending on November 6.\nThe monthly WASDE report will be out on Tuesday, with analysts surveyed by Bloomberg looking for 2.145 bbu of US corn ending stocks, a 9 mbu drop from the November report if realized.\nActual Brazilian trade ministry data for November tallied exports at 5.03 MMT, a 6.48% increase from last year but a 22.58% drop from last month.\nDec 25 Corn is at $4.37, down 3/4 cent,\nNearby Cash is at $3.99 3/4, down 3 cents,\nMar 26 Corn is at $4.44 1/4, down 3 cents,\nMay 26 Corn is at $4.51 1/2, down 3 cents,",
        "authors": "None",
        "publish_date": "2025-12-05 18:19:13",
        "published_at_raw": "2025-12-05T18:19:13Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are showing 3 cent losses across most contracts on Friday, with December down just ¾ cent and thin and in deliveries. The CmdtyView national average Cash Corn price is down 3 cents on the day at $3.99 3/4. USDA will release another catc...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b3f6b2450c7258ca36651862e1d43d16",
        "title": "Corn Slipping Back on Friday Morning",
        "doc_url": "https://www.barchart.com/story/news/36475767/corn-slipping-back-on-friday-morning",
        "all_text": "Corn price action is steady to 2 ¼ cents lower across most contracts to start Friday. Futures posted gains on Thursday, with contracts up 3 to 4 cents in most front months, as December was up 6 ¼. Open interest was up 11,560 contracts on Thursday, suggesting new buying interest. The CmdtyView national average Cash Corn price was up 4 cents on the day at $4.02 3/4.\nExport Sales data for the week of October 30 was out this morning, with a total of 1.99 MMT of corn sold. That was on the higher side of trade ideas looking for 0.8-2.5 MMT in corn sales during that week. That was back above the week prior and the third largest total for the marketing year.\nActual Brazilian trade ministry data for November tallied exports at 5.03 MMT, a 6.48% increase from last year but a 22.58% drop from last month. Corn shipments are estimated at 4.99 MMT for December according to ANEC, which would be above the 3.62 MMT from the same period last year.\nStatistics Canada estimates the 2025 corn production for the country at 14.867 MMT, down 3.1% from the same week last year.\nDec 25 Corn closed at $4.37 3/4, up 6 1/4 cents, currently down 2 1/4 cents\nNearby Cash was $4.02 3/4, up 4 cents,\nMar 26 Corn closed at $4.47 1/4, up 3 3/4 cents, currently down 1 1/4 cents\nMay 26 Corn closed at $4.54 1/2, up 3 3/4 cents, currently down 1 cent",
        "authors": "None",
        "publish_date": "2025-12-05 13:34:28",
        "published_at_raw": "2025-12-05T13:34:28Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is steady to 2 ¼ cents lower across most contracts to start Friday. Futures posted gains on Thursday, with contracts up 3 to 4 cents in most front months, as December was up 6 ¼. Open interest was up 11,560 contracts on Thursday, su...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ea239e2f0bfce779a159466b057141e3",
        "title": "Brazil Soy Exports Jump 64% in November Ahead of Chinese Shift to U.S.",
        "doc_url": "https://www.agriculture.com/partners-brazil-soy-exports-jump-64-in-november-ahead-of-chinese-shift-to-u-s-11862714",
        "all_text": "By Roberto Samora and Fernando Cardoso\nSAO PAULO, Dec. 4 (Reuters) - Brazil's soybean exports jumped 64% in November from a year ago to 4.2 million metric tons, the government said on Thursday, with good local supply allowing elevated shipments before the world's largest importer China shifts to United States' beans.\nBrazil soy exports normally fall towards the end of the year as the country approaches the new harvest late on January or early February, but a record crop in 2025 means there are still enough supplies to keep foreign sales going, grain exports lobby Anec said on Thursday.\nAnec projects December shipments to also increase sharply, around 90%, to 2.8 million tons. The industry group sees total Brazilian soy exports at 110 million tons in 2025 from 97.3 million tons in 2024.\nChina bought several vessels of soybeans from the U.S. recently, with loadings expected already in December. The Chinese buying is part of its trade deal with the U.S.\nCorn Exports\nBrazilian corn exports, however, are expected to fall short of expectations, Anec said.\nThe group reduced its corn shipment projection by 1 million tons for 2025, to 41 million tons, citing increasingly higher domestic demand.\nBrazil's booming corn ethanol and meat industries are boosting internal demand for the cereal, according to Anec.\nOn Wednesday, an association representing pork and chicken processors, which uses corn as feed, projected a rise in output and exports for both meat types, indicating strong demand ",
        "authors": "None",
        "publish_date": "2025-12-05 12:36:49",
        "published_at_raw": "2025-12-05T12:36:49Z",
        "meta_site_name": "Successful Farming",
        "description": "Brazil’s soybean exports jumped 64% in November from a year ago to 4.2 million metric tons, the government said on Thursday, with good local supply allowing elevated shipments before the world’s largest importer China shifts to United States’ beans.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6ddf38529bdc58f66de0ffc85acce473",
        "title": "Hogs Close Out the Week with Gains",
        "doc_url": "https://www.barchart.com/story/news/36486025/hogs-close-out-the-week-with-gains",
        "all_text": "Lean hog futures posted nearby gains of 40 cents to $1 on Friday, as December was up $1.05 this week. USDA’s national base hog price was reported at $71.53 on Friday afternoon, down $1.12 from the day prior. The CME Lean Hog Index was up 16 cents on December 3 at $81.83.\nCommitment of Traders data from Friday afternoon showed managed money slashing 22,070 contracts from their net long in lean hog futures and options as of October 28. That took the net long to 95,161 contracts.\nUSDA’s pork carcass cutout value from the Friday PM report was up $3.06 to $96.39 per cwt. All primals were reported higher. USDA estimated federally inspected hog slaughter for this week at 2.702 million head. That was 98,210 head above the week last year.\nDec 25 Hogs closed at $81.650, up $0.525,\nFeb 26 Hogs closed at $82.275, up $0.425\nApr 26 Hogs closed at $86.775, up $1.000,",
        "authors": "None",
        "publish_date": "2025-12-05 23:28:46",
        "published_at_raw": "2025-12-05T23:28:46Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted nearby gains of 40 cents to $1 on Friday, as December was up $1.05 this week. USDA’s national base hog price was reported at $71.53 on Friday afternoon, down $1.12 from the day prior. The CME Lean Hog Index was up 16 cents on...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "72a07ee5c8c4159bec05d53108fe9f5f",
        "title": "Hogs Pushing Higher to Close Out the Week",
        "doc_url": "https://www.barchart.com/story/news/36481158/hogs-pushing-higher-to-close-out-the-week",
        "all_text": "Lean hog futures are trading with 57 cent to $1.15 gains at midday. USDA’s national base hog price was reported at $72.52 on Friday morning, up $0.44 from the day prior. The CME Lean Hog Index was up 16 cents on December 3 at $81.83.\nUSDA’s pork carcass cutout value from the Friday AM report was up $3.50 to $96.83 per cwt. All primals were reported higher. USDA estimated federally inspected hog slaughter for Thursday was 490,000 head, with the week to date total at 1.943 million head. That was 10,127 head above the week last year.\nDec 25 Hogs are at $81.700, up $0.575,\nFeb 26 Hogs are at $82.650, up $0.800\nApr 26 Hogs is at $86.925, up $1.150,",
        "authors": "None",
        "publish_date": "2025-12-05 18:19:13",
        "published_at_raw": "2025-12-05T18:19:13Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are trading with 57 cent to $1.15 gains at midday. USDA’s national base hog price was reported at $72.52 on Friday morning, up $0.44 from the day prior. The CME Lean Hog Index was up 16 cents on December 3 at $81.83. USDA’s pork carc...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ac2c65ff868a07e6129e08b6e31d4d7f",
        "title": "10 protein- and fiber-rich broccoli and egg dishes under 20 minutes for bachelors",
        "doc_url": "https://timesofindia.indiatimes.com/life-style/food-news/10-protein-and-fiber-rich-broccoli-and-egg-dishes-under-20-minutes-for-bachelors/photostory/125790914.cms",
        "all_text": "With winters taking shape around us, the comfort of enjoying warm dishes has its own benefits. And if you are a bachelor, simple, healthy, and easy-to-make dishes will always grab your attention. With the same intent, here we have curated a list of 10 protein- and fiber-rich broccoli and egg dishes that can be easily made in under 20 minutes at home. For the unversed, broccoli is rich in vitamin C, known for its immune-boosting properties, and vitamin K, which is crucial for bone health. Also, it is rich in fiber that helps promote digestive health. As per a study published by the National Library of Medicine, broccoli also supports cardiovascular health. A Phase 1 clinical trial demonstrated that consuming 100 grams of fresh broccoli sprouts daily over a week provided cardiovascular benefits. It has also been shown to contain bioactive compounds such as glucosinolates, sulforaphane, and indole-3-carbinol, all of which have been shown to have significant health-promoting effects. According to the United States Department of Agriculture (USDA), a cup of broccoli contains 3% to 3.5% of a person’s daily need for calcium, 45–54% of daily need for vitamin C, and 64–86% of their daily need for vitamin K. It is also rich in an antioxidant called sulforaphane, which is said to contribute to reducing inflammation and combating oxidative stress. As per experts, broccoli also offers protection against certain cancers, supports heart health, and contributes to overall well-being. And the",
        "authors": "None",
        "publish_date": "2025-12-05 16:30:00",
        "published_at_raw": "2025-12-05T16:30:00Z",
        "meta_site_name": "Times of India",
        "description": "With winters taking shape around us, the comfort of enjoying warm dishes has its own benefits. And if you are a bachelor, simple, healthy, and easy-to-make dishes will always grab your attention. With the same intent, here we have curated a list of 10 protein- and fiber-rich broccoli and egg dishes that can be easily made in under 20 minutes at home. For the unversed, broccoli is rich in vitamin C, known for its immune-boosting properties, and vitamin K, which is crucial for bone health. Also, it is rich in fiber that helps promote digestive health. As per a study published by the National Library of Medicine, broccoli also supports cardiovascular health. A Phase 1 clinical trial demonstrated that consuming 100 grams of fresh broccoli sprouts daily over a week provided cardiovascular benefits. It has also been shown to contain bioactive compounds such as glucosinolates, sulforaphane, and indole-3-carbinol, all of which have been shown to have significant health-promoting effects. According to the United States Department of Agriculture (USDA), a cup of broccoli contains 3% to 3.5% of a person’s daily need for calcium, 45–54% of daily need for vitamin C, and 64–86% of their daily need for vitamin K. It is also rich in an antioxidant called sulforaphane, which is said to contribute to reducing inflammation and combating oxidative stress. As per experts, broccoli also offers protection against certain cancers, supports heart health, and contributes to overall well-being. And the study titled Health Functions of Egg Protein states that egg protein is a remarkably abundant source of protein, with an amino acid score of 100 and the highest net protein utilization rate. It is also said that it contains approximately the same amount of branched-chain amino acids as milk protein. It also has more sulfur-containing amino acids than other protein sources. The amino acid score for EWP is 100, and its net protein utilization is reported to be higher than that of whey protein. Proteins are also present in eggshell membranes. It is mentioned that egg white is a good source of protein that can be utilized to increase body protein, i.e., muscle mass. Overall, eggs provide a nutrient-dense, bioavailable protein source that supports metabolic health, muscle function, and antioxidant defense.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e2f3a72cb5954f8137e9804318a5c8a8",
        "title": "Hogs Look to Round out the Week",
        "doc_url": "https://www.barchart.com/story/news/36475807/hogs-look-to-round-out-the-week",
        "all_text": "Lean hog futures closed the Thursday session with contracts 57 cents to $1.05 higher. Open interest suggested short covering, down 1,592 contracts. USDA’s national base hog price was reported at $72.65 on Thursday afternoon, up $0.56 from the day prior. The CME Lean Hog Index was back up 6 cents on December 2 at $81.67.\nUSDA’s Export Sales report showed 28,526 MT of pork bookings in the week of October 31, down 26.5% from the week prior. Export shipments were 31,203 MT, slightly below the week prior.\nUSDA’s pork carcass cutout value from the Thursday PM report was down 69 cents to $93.33 per cwt. The picnic and ham were the only primals reported higher. USDA estimated federally inspected hog slaughter for Wednesday was 490,000 head, with the week to date total at 1.943 million head. That was 10,127 head above the week last year.\nDec 25 Hogs closed at $81.125, up $0.575,\nFeb 26 Hogs closed at $81.850, up $0.850\nApr 26 Hogs closed at $85.775, up $1.050,",
        "authors": "None",
        "publish_date": "2025-12-05 13:34:28",
        "published_at_raw": "2025-12-05T13:34:28Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures closed the Thursday session with contracts 57 cents to $1.05 higher. Open interest suggested short covering, down 1,592 contracts. USDA’s national base hog price was reported at $72.65 on Thursday afternoon, up $0.56 from the day pri...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]