[
    {
        "id": "beea73996a78de6df00bad60123e3fa2",
        "title": "Corn Falls to Close the Week",
        "doc_url": "https://www.barchart.com/story/news/36602302/corn-falls-to-close-the-week",
        "all_text": "Corn futures closed the Friday session with contracts down 4 to 6 cents across most nearbys, as December expired. March settled the week with a 4 cent loss. The CmdtyView national average Cash Corn price was down 5 1/2 cents at $3.96 3/4.\nUSDA reported private export sales of 250,000 MT of corn during the reporting period to unknown destinations this morning.\nCFTC data was released this afternoon showing data for the week ending on November 18, with managed money flipping to a net long of 38,127 contracts. That was a 77,650 contract move on the week.\nExport Sales data will get another catchup on Monday, with traders looking for 1.1-2.2 MMT in corn sales during the week ending on 11/20.\nDec 25 Corn closed at $4.31 1/2, down 3 3/4 cents,\nNearby Cash was $3.96 3/4, down 5 1/2 cents,\nMar 26 Corn closed at $4.40 3/4, down 5 3/4 cents,\nMay 26 Corn closed at $4.49, down 5 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-12 23:12:57",
        "published_at_raw": "2025-12-12T23:12:57Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Friday session with contracts down 4 to 6 cents across most nearbys, as December expired. March settled the week with a 4 cent loss. The CmdtyView national average Cash Corn price was down 5 1/2 cents at $3.96 3/4. USDA repor...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0e7d0dc7c2d6aea0aef63cf7313e3c60",
        "title": "Corn Easing Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/36597724/corn-easing-lower-on-friday",
        "all_text": "Corn futures are down 4 to 5 cents in the front months on Friday. December futures expire today, with 6 deliveries issued overnight. The CmdtyView national average Cash Corn price is down 4 3/4 cents at $3.97 3/4.\nUSDA reported private export sales of 250,000 MT of corn during the reporting period to unknown destinations this morning.\nExport Sales data will get another catchup on Monday, with traders looking for 1.1-2.2 MMT in corn sales during the week ending on 11/20.\nDec 25 Corn is at $4.32 1/2, down 2 3/4 cents,\nNearby Cash is at $3.97 3/4, down 4 3/4 cents,\nMar 26 Corn is at $4.41 3/4, down 4 3/4 cents,\nMay 26 Corn is at $4.49 3/4, down 4 1/2 cents,",
        "authors": "None",
        "publish_date": "2025-12-12 18:15:02",
        "published_at_raw": "2025-12-12T18:15:02Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are down 4 to 5 cents in the front months on Friday. December futures expire today, with 6 deliveries issued overnight. The CmdtyView national average Cash Corn price is down 4 3/4 cents at $3.97 3/4. USDA reported private export sales...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "10e7c8952053d585d6445304cc09d7d9",
        "title": "Corn Starting Friday with Slight Losses",
        "doc_url": "https://www.barchart.com/story/news/36592657/corn-starting-friday-with-slight-losses",
        "all_text": "Corn price action is down 1 to 2 cents in the front months on Friday morning. Futures posted higher Thursday trade, with contracts up fractionally to 2 ½ cents in the nearby contracts. December futures expire today, with 6 deliveries issued overnight. The CmdtyView national average Cash Corn price was up 1 1/2 cents at $4.01 1/2.\nExport Sales data was updated again on Thursday, showing a 4-week high 2.38 MMT of corn sold in the week ending on 11/13. That was 59.3% larger than the same week last year. Total export sale commitments were 29.7% above the same November week last year at 40.7 MMT (1.6 bbu), a record buying pace.\nDelayed Census data showed September corn exports at a record 6.978 MMT (274.7 mbu). That was 9.09% larger than August and 60.93% larger than the same month last year. Distiller exports were 1.47% above last year at 1.059 MMT, with ethanol shipments at 148.4 million gallons during that month.\nDec 25 Corn closed at $4.35 1/4, up 1/2 cent, currently up ¾ cent\nNearby Cash was $4.01 1/2, up 2 1/2 cents,\nMar 26 Corn closed at $4.46 1/2, up 2 1/4 cents, currently down 1 1/4 cents\nMay 26 Corn closed at $4.54 1/4, up 2 1/2 cents, currently down 1 1/2 cents",
        "authors": "None",
        "publish_date": "2025-12-12 13:39:12",
        "published_at_raw": "2025-12-12T13:39:12Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is down 1 to 2 cents in the front months on Friday morning. Futures posted higher Thursday trade, with contracts up fractionally to 2 ½ cents in the nearby contracts. December futures expire today, with 6 deliveries issued overnight...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3058d559f8b1904cd4118639f858bb21",
        "title": "Bailed-out farmers don't want to live on Trump welfare: 'they don’t want to go to the mailbox and get a check from the government'",
        "doc_url": "https://fortune.com/2025/12/12/trump-farmer-bailout-12-billion-welfare-soybeans-china-tariffs-trade-reaction/",
        "all_text": "A little more than a year later, Stehly said his fears have become a reality, and Trump’s latest promise of federal assistance is insufficient to cover American farmers’ losses.\n“Maybe this will all come out to be better at the end, but I can tell you right now, it certainly isn’t the case at the moment,” Stehly said.\nTrump announced Monday that his Republican administration would distribute $12 billion in one-time payments to farmers, who have suffered from persistently low commodity prices, rising costs and declining sales after China cut off all agricultural purchases from America during the trade war.\nWhile rural areas remain conservative bastions, farmers’ patience with Washington is wearing thin. Several of them described the government bailout, an echo of similar policies during Trump’s first term, as a welcome stopgap but one that will not solve the agricultural industry’s problems.\n“It’s a bridge. It’s not the ultimate solution we’re looking for,” said Charlie Radman, a fourth-generation farmer who grows corn and soybeans on the land his family has owned near Randolph, Minnesota, since 1899. “What we really want to have is a little more certainty and not have to rely on these ad hoc payments.”\nBut farmers support for Trump remains steadfast.\nKansas sorghum farmer Garrett Love, who was at the White House when the aid was announced, said farmers know that securing fair trade deals is a “hard process,” and farmers “appreciate lowering tax burdens, lowering regulations, ",
        "authors": "None",
        "publish_date": "2025-12-12 13:26:20",
        "published_at_raw": "2025-12-12T13:26:20Z",
        "meta_site_name": "Fortune",
        "description": "\"That’s not why we farm,” said Dan Keitzer, a soybean and corn farmer in southeast Iowa. “We need more demand for our product.”",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "527f902e943ed4f7555441d0997d671e",
        "title": "Farmers’ soybean rejected as ministerial staff allegedly demand Rs 3 lakh to open purchase centers, says Congress leader Vijay Wadettiwar",
        "doc_url": "https://timesofindia.indiatimes.com/city/nagpur/farmers-soybean-rejected-as-ministerial-staff-allegedly-demand-rs-3-lakh-to-open-purchase-centers-says-congress-leader-vijay-wadettiwar/articleshow/125928533.cms",
        "all_text": "Congress leader Vijay Wadettiwar alleged in the Assembly that high-quality soybean from Nanded and Yavatmal is being rejected. He claimed ministerial OSDs and a private individual are demanding hefty bribes to open purchase centers, leaving farmers in distress. Speaker Rahul Narwekar has ordered an inquiry into these serious allegations.\nNAGPUR: Congress Legislative Party leader Vijay Wadettiwar on Friday made startling allegations in the state Assembly, claiming that farmers’ soybean from Nanded and Yavatmal districts is being rejected despite having good quality. According to Wadettiwar, ministerial OSDs Abhijit Patil and Garje are allegedly demanding Rs 3 lakh each to initiate soybean purchase centers, while a private individual named Akhil in Beed is reportedly collecting the money. During a point of information in the Assembly, Wadettiwar directly raised the issue of rejected soybean, highlighting the plight of farmers before the Speaker Rahul Narwekar and the ministers present. He questioned, if even high-quality soybean is being refused at purchase centers, are farmers expected to live or die? Wadettiwar criticized the government for not taking farmers’ concerns seriously, even as the Vidarbha session is underway, and demanded urgent justice for the affected farmers. The Assembly Speaker, Rahul Narvekar, took note of the allegations and directed an inquiry into the claims that money is being extorted to open purchase centers. He instructed that corrective measures be i",
        "authors": "None",
        "publish_date": "2025-12-12 07:22:00",
        "published_at_raw": "2025-12-12T07:22:00Z",
        "meta_site_name": "Times of India",
        "description": "Congress leader Vijay Wadettiwar alleged in the Assembly that high-quality soybean from Nanded and Yavatmal is being rejected. He claimed ministerial",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "61a4dde8c6c18e6ae22d9bfec661a51c",
        "title": "Wheat Facing Friday AM Weakness",
        "doc_url": "https://www.barchart.com/story/news/36592678/wheat-facing-friday-am-weakness",
        "all_text": "Wheat price action is lower to start Friday. Futures saw mixed action on Thursday, with the hard red contracts the weakest. December futures expire on Friday. Chicago SRW futures were up 3 to 4 cents Thursday. Open interest was up 4,003 contracts. KC HRW futures saw penny losses in the front months. OI was up 3,610 contracts on Thursday MPLS spring wheat was slightly higher in the front months.\nThe weekly Export Sales report from Thursday USDA showed 850,418 MT of wheat sold in the week ending on 11/13. That was a 6-week high and 54.73% larger than the same week last year. Accumulated wheat sale commitments are now 18.12 MMT, up 22.4% from last year and the largest total for that week since 2013/14.\nCensus data was reported on Wednesday, with 3.23 MMT (118.68 mbu) of wheat shipped in September. That was the largest total for that month in 12 years and 19.97% larger than August.\nA South Korean importer purchased a total of 65,000 MT of wheat in a private purchased overnight.\nDec 25 CBOT Wheat closed at $5.34 1/2, up 3 1/4 cents, currently unch\nMar 26 CBOT Wheat closed at $5.33 1/2, up 4 cents, currently down 4 cents\nDec 25 KCBT Wheat closed at $5.15 1/2, down 1 cent, currently unch\nMar 26 KCBT Wheat closed at $5.22 1/4, down 1 cent, currently down 2 3/4 cents\nDec 25 MGEX Wheat closed at $5.82 1/2, unch, currently unch\nMar 26 MGEX Wheat closed at $5.76 1/4, up 1 cent, currently down 2 1/4 cents",
        "authors": "None",
        "publish_date": "2025-12-12 13:39:12",
        "published_at_raw": "2025-12-12T13:39:12Z",
        "meta_site_name": "Barchart",
        "description": "Wheat price action is lower to start Friday. Futures saw mixed action on Thursday, with the hard red contracts the weakest. December futures expire on Friday. Chicago SRW futures were up 3 to 4 cents Thursday. Open interest was up 4,003 contracts. KC...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ba9234513214154b20f735f4c8255854",
        "title": "How Can Farmers Use Their USDA Bridge Payments Wisely?",
        "doc_url": "https://www.agriculture.com/how-can-farmers-use-their-usda-payments-wisely-11868331",
        "all_text": "About one-third of lottery winners end up in bankruptcy court, according to the American Bankruptcy Institute. For individual farmers, the $12 billion bridge payments USDA announced Monday will hardly amount to Powerball riches, yet, may still prove tricky to manage. Just before this latest announcement of USDA help, a group of Kansas State University economists released suggestions on managing such payments.\nThe group’s “Top 5 Considerations for Managing Large, One-Time Government Payments” suggests paying down debt and thinking long-term.\nThey advise: “While it’s tempting to focus on short-term needs, overdue upgrades, or immediate tax strategies, the most strategic use of a large payment may be to reinforce your farm’s long-term financial position.” That might mean trying to build working capital. “Rebuilding this cushion should be a top priority,” they said.\nThe other three tips: Use good cash flow planning, evaluate equipment purchases carefully, and avoid letting the payment boost cash rent expected by landlords.\nIn addition, they said, “Talk with your tax advisor early to avoid surprises.”\nYou should know before the end of this month an estimate of your bridge payment, which is expected in February of next year.\nThat may give you just enough time for tax planning before the end of 2025, in case your operation needs to juggle expenses or receipts from one year to the other.\n“Some operations may hold grain, due to improved cash flow,” the economists said. “This decision ",
        "authors": "None",
        "publish_date": "2025-12-12 21:11:33",
        "published_at_raw": "2025-12-12T21:11:33Z",
        "meta_site_name": "Successful Farming",
        "description": "Kansas State University economists share practical tips to manage large government payments and strengthen your farm’s long-term financial position.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ccdc6c80ce2b982ef0261ff28fa77a66",
        "title": "South Carolina to block SNAP purchases of soda, candy and energy drinks under new USDA waiver",
        "doc_url": "https://www.wltx.com/article/life/food/south-carolina-snap-benefits-changes/101-f06fcea0-780f-4f35-b56a-08fe1d94e3bb",
        "all_text": "COLUMBIA, S.C. — Low-income families in South Carolina who rely on SNAP benefits will soon see major changes in what they can buy.\nThe USDA has approved Gov. Henry McMaster’s request to restrict SNAP purchases of candy, soft drinks, high-caffeine energy drinks and most sweetened beverages, making South Carolina one of 18 states granted similar waivers.\nThe new rules, part of a waiver the governor’s office says aligns with President Donald Trump’s national nutrition initiative, tighten the definition of what qualifies as a SNAP-eligible food item. The restrictions include:\nCandy, though, protein bars, baked goods and baking ingredients remain allowed.\nEnergy drinks with more than 65 milligrams of caffeine per eight ounces.\nSoft drinks with more than five grams of added sugar.\nMost sweetened beverages, unless they contain milk, at least 50% fruit or vegetable juice, are infant formula, sports drinks, carbonated water or medically necessary nutrition products.\nDr. Danielle Krobath, an epidemiology professor at the University of South Carolina, said there is no research showing that SNAP food restrictions improve health outcomes or change purchasing habits.\n\"There is really no evidence to show or support improvements,” she said, adding that such policies can place “a negative light and excess speculation on the behavior and purchases of people experiencing poverty.”\nThe waiver notes that the USDA will guide retailers through the approval process, and once stores are authorized, t",
        "authors": "None",
        "publish_date": "2025-12-12 19:43:00",
        "published_at_raw": "2025-12-12T19:43:00Z",
        "meta_site_name": "WLTX.com",
        "description": "Low-income families using SNAP in South Carolina will face new limits on candy, soft drinks and high-caffeine energy drinks, with enforcement starting Aug. 31, 2026.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "9a391573d634d1240fbbaf7fc1d29fa4",
        "title": "Hogs Posting Gains on Friday",
        "doc_url": "https://www.barchart.com/story/news/36597768/hogs-posting-gains-on-friday",
        "all_text": "Lean hog futures are trading with slight 7 cent losses in expiring December, with other contracts 30 to 50 cents higher. USDA’s national base hog price was down $1.11 in the Friday morning report at $70.93. The CME Lean Hog Index was up 41 cents on December 10 at $82.57.\nUSDA’s pork carcass cutout value from the Friday morning report was 30 cents lower to $98.54 per cwt. The loin, butt, and belly primals were reported higher. USDA estimated federally inspected hog slaughter for Thursday at 494,000 head, taking the week to date total to 1.965 million head. That was 22,000 head above last week and 37,121 head above the same week last year.\nDec 25 Hogs are at $83.325, down $0.075,\nFeb 26 Hogs are at $84.525, up $0.350\nApr 26 Hogs is at $89.600, up $0.375,",
        "authors": "None",
        "publish_date": "2025-12-12 18:15:02",
        "published_at_raw": "2025-12-12T18:15:02Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are trading with slight 7 cent losses in expiring December, with other contracts 30 to 50 cents higher. USDA’s national base hog price was down $1.11 in the Friday morning report at $70.93. The CME Lean Hog Index was up 41 cents on...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "fab8c6307f116cf2f9bdf18488fe6da4",
        "title": "Indiana risked federal funds if it didn't redistrict, Beckwith says",
        "doc_url": "https://www.southbendtribune.com/story/news/politics/2025/12/12/indiana-redistricting-donald-trump-federal-funding-micah-beckwith/87731721007/",
        "all_text": "Lt. Gov. Micah Beckwith appeared to confirm Dec. 11 that President Donald Trump's administration threatened to withhold federal funding to the state if it did not deliver on mid-decade redistricting.\nBut those claims contradict what some Republican lawmakers have publicly insisted in recent weeks — that they never felt uncomfortable with the level of pressure coming from the Trump administration.\nHours after the Indiana Senate soundly rejected a proposed congressional map favored by the White House, Beckwith responded to an X post mentioning a warning by Heritage Action, a pro-redistricting group, that \"all federal funding will be stripped from the state\" if Indiana does not redistrict.\nThe original post, by IndyStar columnist Jacob Stewart, quoted the Heritage Action post to say that no legislators Stewart had spoken to could confirm that the threats happened.\n\"The Trump admin was VERY CLEAR about this,\" Beckwith responded in a now-deleted post. \"They told many lawmakers, cabinet members and the Gov and I that this would happen.\"\nHe continued that by voting against redistricting, the Senate essentially said it does not want to be \"partners\" with the administration, and that the administration \"made it clear to them that they'd oblige.\"\nA spokesperson for Beckwith did not immediately respond to a request for comment. A spokesperson for the governor also did not respond by publication.\nIn a follow-up conversation with Politico, Beckwith reiterated that those conversations occu",
        "authors": "None",
        "publish_date": "2025-12-12 16:50:48",
        "published_at_raw": "2025-12-12T16:50:48Z",
        "meta_site_name": "South Bend Tribune",
        "description": "The recently announced USDA hub could be on the chopping block, Beckwith told Politico.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cc86ec12bc53ee4b9d700b1c16e81738",
        "title": "Hogs Traders Look to Round Out the Week Following Thursday Gains",
        "doc_url": "https://www.barchart.com/story/news/36592700/hogs-traders-look-to-round-out-the-week-following-thursday-gains",
        "all_text": "Lean hog futures saw strength on Thursday with contracts up 85 cents to $1.85. USDA’s national base hog price was reported at $71.69 on Thursday afternoon, up $1.64 from the day prior. The CME Lean Hog Index was up 27 cents on December 8 at $82.16.\nUSDA’s Export Sales report for the week ending on November 13 showed pork sales of 23,606 MT for 2025 and 3,947 MT for 2026. Export shipments were 32,132 MT, which was the highest since June.\nCensus data converted to a carcass basis showed 545.28 million lbs of pork exports in September. That was down 0.8% from last year’s September record and 0.5% above the August total.\nUSDA’s pork carcass cutout value from the Thursday PM report was $1.57 higher to $98.84 per cwt. All primals were reported higher, led by the butt and belly. USDA estimated federally inspected hog slaughter for Thursday at 494,000 head, taking the week to date total to 1.965 million head. That was 22,000 head above last week and 37,121 head above the same week last year.\nDec 25 Hogs closed at $83.400, up $0.950,\nFeb 26 Hogs closed at $84.175, up $1.750\nApr 26 Hogs closed at $89.225, up $1.850,",
        "authors": "None",
        "publish_date": "2025-12-12 13:39:12",
        "published_at_raw": "2025-12-12T13:39:12Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw strength on Thursday with contracts up 85 cents to $1.85. USDA’s national base hog price was reported at $71.69 on Thursday afternoon, up $1.64 from the day prior. The CME Lean Hog Index was up 27 cents on December 8 at $82.16....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "945452316d83fd03eef1cb8a5ca2e810",
        "title": "SNAP benefits in Missouri will ban these foods, drinks in 2026",
        "doc_url": "https://www.news-leader.com/story/news/local/missouri/2025/12/12/snap-benefits-missouri-waiver-restricts-candy-pop-2026/87717801007/",
        "all_text": "Missourians who rely on the Supplemental Nutrition Assistance Program, or SNAP, may soon see new restrictions on what they can buy with the federal benefit.\nThe U.S. Department of Agriculture said in a news release that it approved Missouri's waiver request to make certain foods and beverages no longer eligible for purchase under SNAP. Missouri Gov. Mike Kehoe's office announced in September it wanted to alter the state's SNAP program to have it focus more on healthier food.\n\"We are incredibly thankful for Secretary Rollins' approval of our waiver,\" Kehoe said. \"Missouri is proud to partner with the Trump Administration on the Make America Healthy Again movement as we refocus SNAP to maximize nutritional health for families while also supporting the abundant agricultural output of our state.\"\nMissouri joins 11 other states that have had similar waiver requests approved by the USDA.\nWhat items are excluded from SNAP benefits in Missouri?\nMissouri's SNAP waiver request asked to exclude these items:\nCandy\nPrepared desserts\nCarbonated and noncarbonated soft drinks\nDrinks or punches with 50% or less natural fruit or vegetable juice\nBeverage mixes\nConcentrates with 50% or less natural fruit or vegetable juice\nEnergy drinks\nWhen do SNAP restrictions start in Missouri?\nThe Missouri Department of Social Services anticipates the SNAP changes will take effect in October 2026.",
        "authors": "None",
        "publish_date": "2025-12-12 11:07:18",
        "published_at_raw": "2025-12-12T11:07:18Z",
        "meta_site_name": "Springfield News-Leader",
        "description": "Missouri received a USDA waiver to put new limits on SNAP benefits to \"maximize nutritional health.\" See which foods you won't be able to buy.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]