[
    {
        "id": "75ac93d5d8d92095bb78684fab1c76fd",
        "title": "Corn Holding Steady on Friday",
        "doc_url": "https://www.barchart.com/story/news/36972341/corn-holding-steady-on-friday",
        "all_text": "Corn futures are showing steady trade on Friday, with some contracts fractionally lower at midday. The CmdtyView national average Cash Corn price is steady at $4.07 1/2.\nAfter Thursday’s Export Sales report, US corn export commitments are now 50.895 MMT as of January 1, a 30% increase from last year. That is also 63% of the current USDA export projection for the marketing year and ahead of the 61% average sales pace. Actual shipments are 27.414 MMT, which is 34% of USDA’s forecast and ahead of the 24% normal shipping pace.\nA couple South Korean importers purchased a total of 339,000 MT of corn in tenders overnight.\nUSDA’s WASDE report will be out on Monday, with a Bloomberg survey showing analysts looking for stocks to be tallied at 1.985 bbu, a 44 mbu reduction if realized.\nMar 26 Corn is at $4.46, unch,\nNearby Cash is at $4.07 1/2, down 0 cent,\nMay 26 Corn is at $4.53 3/4, down 1/4 cent,\nJul 26 Corn is at $4.60 1/4, down 1/4 cent,",
        "authors": "None",
        "publish_date": "2026-01-09 18:23:40",
        "published_at_raw": "2026-01-09T18:23:40Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are showing steady trade on Friday, with some contracts fractionally lower at midday. The CmdtyView national average Cash Corn price is steady at $4.07 1/2. After Thursday’s Export Sales report, US corn export commitments are now 50.895...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bb1df916451d124883c33cd35801779b",
        "title": "No Bull's Five Spot | Five Charts to Put 2025/26 U.S. Corn Demand in Perspective",
        "doc_url": "https://www.barchart.com/story/news/36971512/no-bull-s-five-spot-five-charts-to-put-2025-26-u-s-corn-demand-in-perspective",
        "all_text": "Five Charts to Put 2025/26 U.S. Corn Demand in Perspective\n5 | Off the Charts\nU.S. corn export inspections remain off the charts in 2025/26, with a record 1,056 mbu (26.8 mmt) shipped in the first four months of the marketing year.\n4 | Time to Shine\nThe surge has been driven by the PNW, where shipments continue to shatter records as U.S. corn remains highly competitive into Asia. Sales to Japan are up 45% year over year, while South Korea’s commitments have jumped an incredible 260% from this point in 2024/25.\n3 | Front-loaded\nTypically, U.S. corn shipments build into the winter and peak in the spring — after the bulk of the U.S. soybean export program is complete.\nThis year, that window was pulled forward, as exporters filled PNW capacity left open by China’s absence from the soybean market during the first three months of the marketing year.\n2 | A slowdown ahead?\nThe question now is whether this pace can be sustained as we move deeper into what is traditionally the heart of the U.S. corn shipment window.\nWhile total export commitments topping 2.0 billion bushels in the week ending January 1 — up 460 mbu year over year — shipments are outpacing new sales, a dynamic that suggests the current export pace is likely to cool in the weeks ahead.\nEven so, with tight exporter stocks elsewhere the U.S. is likely to remain the dominant supplier in the global corn market until Ukraine can find its footing or Argentine new crop becomes available later this spring.\n1 | King Corn\nThe soyb",
        "authors": "None",
        "publish_date": "2026-01-09 17:23:35",
        "published_at_raw": "2026-01-09T17:23:35Z",
        "meta_site_name": "Barchart",
        "description": "Five Charts to Put 2025/26 U.S. Corn Demand in Perspective 5 | Off the Charts U.S. corn export inspections remain off the charts in 2025/26, with a record 1,056 mbu (26.8 mmt) shipped in the first four months of the marketing year. 4 | Time to Shine...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8cff3f7752928763b4771c63eba6fa4d",
        "title": "No Bull's Five Spot | Five Charts to Put 2025/26 U.S. Corn Demand in Perspective",
        "doc_url": "https://www.barchart.com/story/news/36971511/no-bull-s-five-spot-five-charts-to-put-2025-26-u-s-corn-demand-in-perspective",
        "all_text": "Five Charts to Put 2025/26 U.S. Corn Demand in Perspective\n5 | Off the Charts\nU.S. corn export inspections remain off the charts in 2025/26, with a record 1,056 mbu (26.8 mmt) shipped in the first four months of the marketing year.\n4 | Time to Shine\nThe surge has been driven by the PNW, where shipments continue to shatter records as U.S. corn remains highly competitive into Asia. Sales to Japan are up 45% year over year, while South Korea’s commitments have jumped an incredible 260% from this point in 2024/25.\n3 | Front-loaded\nTypically, U.S. corn shipments build into the winter and peak in the spring — after the bulk of the U.S. soybean export program is complete.\nThis year, that window was pulled forward, as exporters filled PNW capacity left open by China’s absence from the soybean market during the first three months of the marketing year.\n2 | A slowdown ahead?\nThe question now is whether this pace can be sustained as we move deeper into what is traditionally the heart of the U.S. corn shipment window.\nWhile total export commitments topping 2.0 billion bushels in the week ending January 1 — up 460 mbu year over year — shipments are outpacing new sales, a dynamic that suggests the current export pace is likely to cool in the weeks ahead.\nEven so, with tight exporter stocks elsewhere the U.S. is likely to remain the dominant supplier in the global corn market until Ukraine can find its footing or Argentine new crop becomes available later this spring.\n1 | King Corn\nThe soyb",
        "authors": "None",
        "publish_date": "2026-01-09 17:23:35",
        "published_at_raw": "2026-01-09T17:23:35Z",
        "meta_site_name": "Barchart",
        "description": "Five Charts to Put 2025/26 U.S. Corn Demand in Perspective 5 | Off the Charts U.S. corn export inspections remain off the charts in 2025/26, with a record 1,056 mbu (26.8 mmt) shipped in the first four months of the marketing year. 4 | Time to Shine...",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "665070b4806e08737d8e26bc262ce2ad",
        "title": "3 Big Things Today, Jan. 9, 2026",
        "doc_url": "https://www.agriculture.com/3-big-things-today-jan-9-2026-11882181",
        "all_text": "1. Soybean Futures Higher Overnight on China Purchases\nSoybean futures were higher in overnight trading after USDA confirmed another purchase by China.\nThe Asian nation bought 132,00 metric tons of U.S. soybeans for delivery in the 2025-2026 marketing year that ends on Aug. 31, the agency said in a report yesterday.\nThat follows sales of 336,000 metric tons to China, which was announced on Wednesday.\nSales to China have been ramping up since the end of October when presidents Donald Trump and Xi Jinping signed a trade agreement under which Beijing would resume purchases of U.S. soybeans.\nPrior to the agreement, China shunned U.S. soybeans and instead opted to make purchases from other sources including Brazil and Argentina.\nWheat futures were lower as snow moves into the southern Plains where hard-red winter varieties are overwintering.\nThe snow will provide a protective blanket against harsh weather and is likely to improve soil moisture.\nSoybean futures for March delivery rose 5¢ to $10.66 1/4 a bushel overnight on the Chicago Board of Trade. Soy meal added $1.30 to $304.90 a short ton, and soy oil gained 0.22¢ to 49.67¢ a pound.\nCorn for March delivery was down 1/4¢ to $4.45 3/4 a bushel.\nWheat futures lost 1 1/2¢ to $5.16 1/2 a bushel, and Kansas City futures declined 1 3/4¢ to $5.28 1/2 a bushel.\n2. Corn Sales Drop to Marketing-Year Low in Week Through Jan. 1\nSales of corn for overseas delivery hit a marketing-year low and soybean sales plunged in the week that ran from ",
        "authors": "None",
        "publish_date": "2026-01-09 12:17:39",
        "published_at_raw": "2026-01-09T12:17:39Z",
        "meta_site_name": "Successful Farming",
        "description": "3 Big Things Today: Soybean futures were higher overnight on Chinese demand. Corn sales for export dropped to a marketing-year low. Winter weather expected in the U.S. southern Plains.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "467eecf1f8eb85f2380816857922f597",
        "title": "Corn Futures Decline After USDA Export Figures Miss Forecast",
        "doc_url": "https://scanx.trade/stock-market-news/commodities/corn-futures-decline-after-usda-export-figures-miss-forecast/29488577",
        "all_text": "Corn futures registered a decline following the release of USDA export data that failed to meet market forecasts. The disappointing figures have contributed to downward pressure on agricultural commodity prices, reflecting concerns about demand conditions in the corn market.\nExport Performance Impact\nThe USDA export figures came in below market expectations, signaling potential challenges in international demand for corn. Export data serves as a critical indicator of market health and global demand patterns for agricultural commodities.\nMarket Response\nThe futures market responded negatively to the weaker-than-expected export numbers. Agricultural commodity markets are particularly sensitive to official trade data, as export performance directly impacts supply-demand dynamics and pricing mechanisms.\nAgricultural Commodity Outlook\nThe decline in corn futures following the USDA data release underscores the importance of export performance in determining market direction. Traders and market participants closely monitor these official figures as they provide insights into global demand trends and market fundamentals for agricultural products.\nOverview\nCoral Newsprints Limited disclosed its unaudited financial results for the half-year ending September 30, 2025, revealing severe financial challenges. The company reported zero revenue and a net loss of ₹16.79 lakhs. Total expenses amounted to ₹16.79 lakhs, primarily from employee benefits, depreciation, and other expenses. The bala",
        "authors": "None",
        "publish_date": "2026-01-09 07:16:17",
        "published_at_raw": "2026-01-09T07:16:17Z",
        "meta_site_name": "scanx.trade",
        "description": "Corn futures declined after USDA export figures missed market forecasts, indicating weaker demand conditions. The disappointing export data contributed to downward pressure on agricultural commodity prices, highlighting the market's sensitivity to official trade statistics and export performance metrics.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:09",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "09b0fe7d42db26c916c30a6b9cab4301",
        "title": "USDA suspends all federal funds to Minnesota after fraud scandal uncovered",
        "doc_url": "https://www.foxnews.com/politics/usda-immediately-suspends-all-federal-funding-minnesota-amid-fraud-investigation",
        "all_text": "NEWYou can now listen to Fox News articles!\nThe Trump administration announced on Thursday it is suspending all U.S. Department of Agriculture (USDA) funding to Minnesota, effective immediately, as a large-scale fraud investigation is underway.\n\"Enough is enough! The Trump administration has uncovered MASSIVE fraud in Minnesota and Minneapolis—billions siphoned off by fraudsters. And those in charge have ZERO plan to fix it,\" Agriculture Secretary Brooke Rollins wrote in a social media post.\nThe USDA will suspend federal financial awards to the state \"until sufficient proof has been provided that the fraud has stopped,\" according to Rollins.\n\"No more handouts to thieves!\" she wrote in the post. \"Time to drain the Minnesota swamp and put American taxpayers first.\"\nEarlier this week, the Department of Health and Human Services' (HHS) froze funding for several childcare grant programs in the state, including the Child Care and Development Fund, Temporary Assistance for Needy Families and Social Services Block Grant programs.\nCLICK HERE TO DOWNLOAD THE FOX NEWS APP\nTreasury Secretary Scott Bessent on Friday said Minnesota tax dollars may have been filtered to terrorist group al-Shabab.",
        "authors": "None",
        "publish_date": "2026-01-09 23:47:16",
        "published_at_raw": "2026-01-09T23:47:16Z",
        "meta_site_name": "Fox News",
        "description": "The USDA is suspending all federal funding to Minnesota after a fraud scandal was uncovered involving several childcare grant programs in the state.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "1e4c6746540e9c5cb1e69e74d36efabc",
        "title": "USDA immediately suspends all federal funding to Minnesota amid fraud investigation",
        "doc_url": "https://www.newsbreak.com/fox-news-510075/4434048116459-usda-immediately-suspends-all-federal-funding-to-minnesota-amid-fraud-investigation",
        "all_text": "My Social Security Is $1,680. My Rent Just Hit $1,550\nI worked 42 years and this is what I get. $1,680 monthly from Social Security. My landlord just raised rent to $1,550. That leaves me $130 for everything else — utilities, medication, food. I was eating oatmeal twice a day and skipping dinner.\nOtherworldly beings reported on Earth: The four main types and common traits\nThe author used artificial intelligence in the crafting of this article and the creation of the images. A UFO whistleblower pushing to have information about otherworldly beings released to the public recently said that four types of extraterrestrials have been reported on Earth.\nHow Often Do You Actually Need to Shower? Experts Weigh In\nIf you grew up thinking \"daily shower = good hygiene,\" you are not alone. But dermatologists and pediatric experts generally agree there is no single magic number -- the right cadence depends on sweat, skin type, age, and what you did that day.\nI'm 72 on Social Security and Just Found Out My Neighborhood Is Full of Free Food\nI’ve lived in the same spot for 30 years, but lately, my Social Security check is gone before the month ends. I was literally eating toast for dinner to save money. Then a friend at the senior center showed me Food Radar. I honestly couldn't believe my eyes. The map showed five different spots within 2 miles of my apartment giving away food today. I drove to the closest pin—a local church pantry. They filled my trunk with fresh vegetables, milk, and cann",
        "authors": "None",
        "publish_date": "2026-01-09 23:47:16",
        "published_at_raw": "2026-01-09T23:47:16Z",
        "meta_site_name": "NewsBreak",
        "description": "The Trump administration suspended all USDA funding to Minnesota over an alleged massive fraud investigation involving billions of dollars in taxpayer doll",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b56544c40651301ce9f99a61e7d29d56",
        "title": "\"No More Handouts to Thieves!\" - BREAKING: USDA Suspends all Federal Financial Rewards to Minnesota",
        "doc_url": "https://www.thegatewaypundit.com/2026/01/no-more-handouts-thieves-usda-suspends-all-federal/",
        "all_text": "On Friday evening, Brooke Rollins, Secretary of Agriculture, announced that the USDA has suspended all federal financial rewards to Minnesota.\n“Enough is enough! The Trump administration has uncovered MASSIVE fraud in Minnesota and Minneapolis—billions siphoned off by fraudsters. And those in charge have ZERO plan to fix it,” Rollins said on X.\n“Today, the USDA is SUSPENDING FEDERAL FINANCIAL AWARDS to Minnesota and Minneapolis, effective immediately, until sufficient proof has been provided that the fraud has stopped,” she said.\n“No more handouts to thieves! Time to drain the Minnesota swamp and put American taxpayers first,” Rollins said.\n“The widespread and systemic fraud associated with federal benefit programs in the State of Minnesota and the City of Minneapolis demonstrate an inability to handle federal resources without additional oversight and accountability measures in place,” Rollins said in a letter to Minnesota Governor Walz and Minneapolis Mayor Jacob Frey.\nRollins accused the Democrat leaders of refusing to provide basic information or take common sense measures to stop the fraud.\nDEVELOPING…",
        "authors": "None",
        "publish_date": "2026-01-09 23:40:10",
        "published_at_raw": "2026-01-09T23:40:10Z",
        "meta_site_name": "The Gateway Pundit",
        "description": "On Friday evening, Brooke Rollins, Secretary of Agriculture, announced that the USDA has suspended all federal financial rewards to Minnesota.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "114f4801d5c571a377af3e4da7ad4086",
        "title": "Hogs Slip Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/36976225/hogs-slip-lower-on-friday",
        "all_text": "Lean hog futures were weaker on Friday, with contracts down a dime to 57 cents on the day, as February was $1.20 lower this week. USDA’s national base hog price was reported at $68.08 on Friday afternoon, which was down $1.29 from the day prior. The CME Lean Hog Index was down 27 cents on Jan 7 at $80.98.\nCFTC data from Friday afternoon showed managed money adding back 2,937 contracts to their net long in lean hog futures and options as of January 6. That took the net long to 81,858 contracts.\nUSDA’s pork carcass cutout value from the Friday PM report was $1.53 higher at $92.32 per cwt. All primals reported higher. USDA estimated federally inspected hog slaughter for this week at 2.683 million head. That is 149,191 head above the same week last year.\nFeb 26 Hogs closed at $85.300, down $0.575,\nApr 26 Hogs closed at $91.775, down $0.150\nMay 26 Hogs closed at $95.850, down $0.100,",
        "authors": "None",
        "publish_date": "2026-01-09 23:10:31",
        "published_at_raw": "2026-01-09T23:10:31Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were weaker on Friday, with contracts down a dime to 57 cents on the day, as February was $1.20 lower this week. USDA’s national base hog price was reported at $68.08 on Friday afternoon, which was down $1.29 from the day prior. The...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2f2f76cfe8bb9dc7eb30b3052bf9d38d",
        "title": "Wheat Squares Up Ahead of USDA data to Close Friday",
        "doc_url": "https://www.barchart.com/story/news/36976205/wheat-squares-up-ahead-of-usda-data-to-close-friday",
        "all_text": "The wheat complex spent the Friday session squaring up ahead of the Monday USDA reports. Chicago SRW futures were fractionally lower, with March up 10 ¾ cents this week. KC HRW futures closed with steady action, as March was 15 ¼ cents higher on the week. MPLS spring wheat was down 3 to 4 cents on the day, as that pushed the March contracts down 3 ¼ cents lower on the week.\nExport sales data, now updated just January 1 has wheat export commitments of shipped and unshipped sales at 20.228 MMT, 18% above a year ago. That is also 83% of the USDA estimate and in line with the average sales pace. Export shipments are at 15.16 MMT, which is 21% above last year. That is 61% of USDA’s export number and ahead of the 57% average shipping pace.\nUSDA’s Grain Stocks report will be out on Monday, with a Reuters survey of analysts showing an average guess of 1.636 bbu of wheat on hand as of December 1. The range of estimates is 1.59 to 1.696 bbu.\nNow up to date Commitment of Traders data showed managed money increasing their net short in CBT wheat futures and options as of January 6, taking the total to 107,165 contracts. In KC wheat, spec traders were heading the opposite direction, cutting 2,664 contracts from their net short to 15,655 contracts, the smallest since November 2024.\nMar 26 CBOT Wheat closed at $5.17 1/4, down 3/4 cent,\nMay 26 CBOT Wheat closed at $5.28 3/4, down 1/4 cent,\nMar 26 KCBT Wheat closed at $5.30 1/4, unch,\nMay 26 KCBT Wheat closed at $5.43, unch,\nMar 26 MIAX Wheat ",
        "authors": "None",
        "publish_date": "2026-01-09 23:10:31",
        "published_at_raw": "2026-01-09T23:10:31Z",
        "meta_site_name": "Barchart",
        "description": "The wheat complex spent the Friday session squaring up ahead of the Monday USDA reports. Chicago SRW futures were fractionally lower, with March up 10 ¾ cents this week. KC HRW futures closed with steady action, as March was 15 ¼ cents higher on the...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8aa2280e209e84cd17f7e3c8b25254a7",
        "title": "Cotton Closes Friday with Slight Weakness",
        "doc_url": "https://www.barchart.com/story/news/36976237/cotton-closes-friday-with-slight-weakness",
        "all_text": "Cotton futures rounded out the Friday session with contracts steady to 5 points lower, as March was 40 points higher this week. Crude oil futures were back up $1.02 per barrel at $58.78. The US dollar index was up $0.212 at $98.900.\nUSDA’s Export Sales now has upland cotton export commitments at 6.598 million RB, which is down 15% from the same week last year. That is 57% of USDA’s export forecast and behind the 77% average sales pace. Shipments are 2.986 million RB and 26% of the USDA number (behind the 30% average pace).\nCommitment of Traders data showed a total of 1,306 contracts cut from the managed money net short position in the week ending on January 6. That took their net short to 47,772 contracts.\nThe Thursday online auction from The Seam showed sales of 61.10 cents/lb on 10,864 bales. The Cotlook A Index was down 25 points on January 8 at 74.80 cents. ICE certified cotton stocks were steady on 1/8 with the certified stocks level at 11,510 bales. The Adjusted World Price was updated to 50.97 cents/lb on Thursday afternoon, up 21 points from the week prior.\nMar 26 Cotton closed at 64.41, down 5 points,\nMay 26 Cotton closed at 65.91, down 2 points,\nJul 26 Cotton closed at 67.31, unch",
        "authors": "None",
        "publish_date": "2026-01-09 23:10:31",
        "published_at_raw": "2026-01-09T23:10:31Z",
        "meta_site_name": "Barchart",
        "description": "Cotton futures rounded out the Friday session with contracts steady to 5 points lower, as March was 40 points higher this week. Crude oil futures were back up $1.02 per barrel at $58.78. The US dollar index was up $0.212 at $98.900. USDA’s Export Sal...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5b11113eb7487ef7b0cf950c39f873fd",
        "title": "Corn Sees Slight Losses on Friday",
        "doc_url": "https://www.barchart.com/story/news/36976185/corn-sees-slight-losses-on-friday",
        "all_text": "Corn futures rounded out the Friday session with contracts fractionally lower, as March managed to close the week with an 8 ¼ cent gain. Futures spent the session squaring up ahead of Monday’s USDA report. The CmdtyView national average Cash Corn price was down ¼ cent at $4.07 1/4.\nAfter Thursday’s Export Sales report, US corn export commitments are now 50.895 MMT as of January 1, a 30% increase from last year. That is also 63% of the current USDA export projection for the marketing year and ahead of the 61% average sales pace. Actual shipments are 27.414 MMT, which is 34% of USDA’s forecast and ahead of the 24% normal shipping pace.\nA couple South Korean importers purchased a total of 339,000 MT of corn in tenders overnight.\nUSDA will release their quarterly Grain Stocks report on Monday, with a Reuters survey of analysts looking for December 1 corn stocks at 12.962 bbu, with a range of estimates from 12.05 to 13.31 bbu.\nCFTC data from this afternoon showed managed money trimming 7,158 contracts from their net short in corn futures and options as of January 6, taking it to 16,426 contracts.\nMar 26 Corn closed at $4.45 3/4, down 1/4 cent,\nNearby Cash was $4.07 1/4, down 1/4 cent,\nMay 26 Corn closed at $4.53 3/4, down 1/4 cent,\nJul 26 Corn closed at $4.60 1/4, down 1/4 cent,",
        "authors": "None",
        "publish_date": "2026-01-09 23:10:30",
        "published_at_raw": "2026-01-09T23:10:30Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures rounded out the Friday session with contracts fractionally lower, as March managed to close the week with an 8 ¼ cent gain. Futures spent the session squaring up ahead of Monday’s USDA report. The CmdtyView national average Cash Corn pri...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "5afcdccfc3158752f6241f0a1e7330df",
        "title": "Grain Futures Change Little Ahead of WASDE -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/grain-futures-change-little-ahead-of-wasde-daily-grain-highlights-ce7e59d3dd88f62d",
        "all_text": "By Paulo Trevisani\n--Soybeans for March delivery rose 0.1% on the Chicago Board of Trade Friday, to $10.62 1/2 a bushel, as markets braced for rising estimates in Monday's USDA supply and demand projections.\n--Corn for March delivery fell 0.1% to $4.45 3/4 a bushel.\n--Wheat for March delivery fell 0.1% to $5.17 1/2 a bushel.\nHIGHLIGHTS\nExpensive Soybeans: Future soybean contracts recovered some ground while markets worried about elevated global supplies. Attention turned to Monday's update of USDA projections. \"It seems that the market is now more concerned about big supplies coming soon from South America with the soybeans harvest there just weeks away,\" Price Group's Jack Scoville wrote. He added that U.S. prices \"are currently too high to complete many new sales.\" There were also talks that Brazilian soy growers could be holding on to their crops waiting for better prices. Meanwhile, the USDA reported flash export sales of 198,000 metric tons of soybeans to unknown destinations in the current marketing year.\nEU-Mercosur Deal: Commodity markets didn't seem too impressed by news that EU member states approved a trade deal with the Mercosur group of South American countries, which includes agricultural powerhouses Brazil and Argentina. The news broke ahead of the U.S. trading session and was quickly swamped by robust economic indicators, as traders braced for potential increases in production projections by the USDA on Monday.\nINSIGHT\nRising Supply: Monday's WASDE report \"wil",
        "authors": "None",
        "publish_date": "2026-01-09 20:01:15",
        "published_at_raw": "2026-01-09T20:01:15Z",
        "meta_site_name": "MarketScreener",
        "description": "By Paulo Trevisani\n--Soybeans for March delivery rose 0.1% on the Chicago Board of Trade Friday, to $10.62 1/2 a bushel, as markets braced for rising estimates in Monday's USDA supply and demand...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "67a18bdc0d956ffbadc607c1fb5ca285",
        "title": "Cotton Slipping Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/36972393/cotton-slipping-lower-on-friday",
        "all_text": "Cotton futures are trading with 5 to 10 point losses at midday. Crude oil futures are back up $1.42 per barrel at $59.18. The US dollar index is up $0.232 at $98.920.\nUSDA’s Export Sales now has upland cotton export commitments at 6.598 million RB, which is down 15% from the same week last year. That is 57% of USDA’s export forecast and behind the 77% average sales pace. Shipments are 2.986 million RB and 26% of the USDA number (behind the 30% average pace).\nThe Thursday online auction from The Seam showed sales of 61.10 cents/lb on 10,864 bales. The Cotlook A Index was down 25 points on January 8 at 74.80 cents. ICE certified cotton stocks were steady on 1/8 with the certified stocks level at 11,510 bales. The Adjusted World Price was updated to 50.97 cents/lb on Thursday afternoon, up 21 points from the week prior.\nMar 26 Cotton is at 64.37, down 9 points,\nMay 26 Cotton is at 65.84, down 9 points,\nJul 26 Cotton is at 67.23, down 8 points",
        "authors": "None",
        "publish_date": "2026-01-09 18:23:40",
        "published_at_raw": "2026-01-09T18:23:40Z",
        "meta_site_name": "Barchart",
        "description": "Cotton futures are trading with 5 to 10 point losses at midday. Crude oil futures are back up $1.42 per barrel at $59.18. The US dollar index is up $0.232 at $98.920. USDA’s Export Sales now has upland cotton export commitments at 6.598 million RB, w...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "12d3f7975676386843d79250aabc84d8",
        "title": "Hogs Slipping Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/36972383/hogs-slipping-lower-on-friday",
        "all_text": "Lean hog futures are showing 10 to 60 cent losses so far on Friday. USDA’s national base hog price was reported at $68.56 on Friday morning. The CME Lean Hog Index was down 27 cents on Jan 7 at $80.98.\nUSDA’s pork carcass cutout value from the Fri AM report was $4.94 higher at $95.73 per cwt. All primals reported higher, with the belly up $12.17. USDA estimated federal inspected hog slaughter for Thursday at 496,000 head, taking the total to 1.977 million head. That is 73,159 head above the same week last year.\nFeb 26 Hogs are at $85.300, down $0.575,\nApr 26 Hogs are at $91.750, down $0.175\nMay 26 Hogs are at $95.775, down $0.175,",
        "authors": "None",
        "publish_date": "2026-01-09 18:23:40",
        "published_at_raw": "2026-01-09T18:23:40Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are showing 10 to 60 cent losses so far on Friday. USDA’s national base hog price was reported at $68.56 on Friday morning. The CME Lean Hog Index was down 27 cents on Jan 7 at $80.98. USDA’s pork carcass cutout value from the Fri A...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "48ee71749ae6e82d1ee923abe5a80dde",
        "title": "Cotton Showing Marginal Gains on Friday",
        "doc_url": "https://www.barchart.com/story/news/36966918/cotton-showing-marginal-gains-on-friday",
        "all_text": "Cotton price action is up 3 to 5 points across the front months on Friday morning. Futures posted losses of 30 to 40 points on Thursday. Crude oil futures were back up $2.41 per barrel at $58.40. The US dollar index was up $0.183 at $98.605.\nUSDA’s Export Sales report from Thursday indicated 98,031 RB of 25/26 upland cotton sold in the week of 1/1. That was a 9-week low. Vietnam was the buyer of 38,700 RB, with 14,400 RB sold to Pakistan. Sales for 2026/27 were 22,491 RB. Export shipments were tallied at 154,036 RB, a 10-week high. Of that total, 47,800 RB was headed to Vietnam, with 28,800 RB to Pakistan.\nCensus data showed 781,641 bales of cotton exports (excluding linters) , which was a 5-year high, and 31.99% above September.\nThe Wednesday online auction from The Seam showed sales of 60.02 cents/lb on 17,239 bales. The Cotlook A Index was up 35 points on January 7 at 75.05 cents. ICE certified cotton stocks were steady on 1/7 with the certified stocks level at 11,510 bales. The Adjusted World Price was updated to 50.76 cents/lb last week, up 74 points from the week prior.\nMar 26 Cotton closed at 64.46, down 39 points, currently up 3 points\nMay 26 Cotton closed at 65.93, down 34 points, currently up 5 points\nJul 26 Cotton closed at 67.31, down 30 points, currently up 4 points",
        "authors": "None",
        "publish_date": "2026-01-09 13:25:21",
        "published_at_raw": "2026-01-09T13:25:21Z",
        "meta_site_name": "Barchart",
        "description": "Cotton price action is up 3 to 5 points across the front months on Friday morning. Futures posted losses of 30 to 40 points on Thursday. Crude oil futures were back up $2.41 per barrel at $58.40. The US dollar index was up $0.183 at $98.605. USDA’s E...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "6c1c49143d8ba24d0866b117d8320ee4",
        "title": "Hogs Look to Friday Folling Thursday Rally",
        "doc_url": "https://www.barchart.com/story/news/36966908/hogs-look-to-friday-folling-thursday-rally",
        "all_text": "Lean hog futures posted Thursday gains of $1.07 to $1.65 at the close. Preliminary open interest was up 3,520 contracts on Thursday, suggesting new buying interest. USDA’s national base hog price was reported at $69.37 on Thursday afternoon, down $3.24 from the day prior. The CME Lean Hog Index was down 29 cents on Jan 6 at $81.25.\nA USDA Export Sales report from Thursday showed 27,700 MT of pork sold in the week that ended on January 1. Mexico was the largest buyer of 12,800 MT, with 8,700 MT sold to Japan. Shipments were 25,750 MT for 2025 and 394 MT for 2026.\nCensus data converted to a carcass basis showed a monthly record 632.2 million lbs of pork shipped in October, which was also 15.9% above September.\nUSDA’s pork carcass cutout value from the Thursday PM report was $1.50 lower at $90.79 per cwt. The loin was the only primal reported higher. USDA estimated federal inspected hog slaughter for Thursday at 496,000 head, taking the total to 1.977 million head. That is 73,159 head above the same week last year.\nFeb 26 Hogs closed at $85.875, up $1.075,\nApr 26 Hogs closed at $91.925, up $1.650\nMay 26 Hogs closed at $95.950, up $1.350,",
        "authors": "None",
        "publish_date": "2026-01-09 13:25:20",
        "published_at_raw": "2026-01-09T13:25:20Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures posted Thursday gains of $1.07 to $1.65 at the close. Preliminary open interest was up 3,520 contracts on Thursday, suggesting new buying interest. USDA’s national base hog price was reported at $69.37 on Thursday afternoon, down $3....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "15b8f1053531100887a2e18ef6360afd",
        "title": "USDA Beef Labels: Prime, Choice or Select. How to choose",
        "doc_url": "https://eu.delawareonline.com/story/grocery/shopping/tips-advice/2026/01/09/how-usda-prime-choice-or-select-quality-labels-explained-and-how-to-prepare-beef-cuts/87960661007/",
        "all_text": "USDA beef grades like Prime, Choice and Select help shoppers understand the quality of meat.\nBeef grading is optional and paid for by producers, unlike mandatory safety inspections.\nKnowing what the grades mean can help determine the cooking method needed to achieve the desired flavor and tenderness for beef.\nShoppers scanning the meat case often see labels such as Prime, Choice and Select. The labels are grades assigned by the U.S. Department of Agriculture, designed to help shoppers compare beef before it reaches the checkout line. What the grades actually mean – and how they affect flavor, tenderness and price – is not always obvious.\nAll beef sold in the United States is inspected for safety, but grading is optional. After meat is inspected for wholesomeness, producers and processors may also pay for a USDA Agricultural Marketing Service inspector to assess the beef, a cost that is typically passed along to consumers in the final retail price.\nUSDA grading evaluates both quality and yield, but quality grades are generally the most relevant to shoppers.\nThe grades offer insight about how a cut is likely to taste and perform in the kitchen, making them a useful tool for balancing cooking method, flavor expectations and budget.\nWhat makes a cut of beef high quality\nUSDA Prime is the highest quality beef grade. Its defining characteristic is abundant marbling – the white streaks of fat within the muscle contributing to enhanced flavor, juiciness and tenderness. Because of its",
        "authors": "None",
        "publish_date": "2026-01-09 10:22:51",
        "published_at_raw": "2026-01-09T10:22:51Z",
        "meta_site_name": "Wilmington News Journal",
        "description": "Beef prices differ by cut. Learn what USDA labels mean so you can choose the best beef for your next hearty meal.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:04",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]