[
    {
        "id": "a97762c84579dd761cebc46dee6d0a70",
        "title": "Corn Slips Lower to Close Out January",
        "doc_url": "https://www.barchart.com/story/news/37332088/corn-slips-lower-to-close-out-january",
        "all_text": "Corn futures closed the Friday session with contracts pulling off midday lows but still down 2 to 4 cents. March was down 2 ¼ cents this week. The CmdtyView national average Cash Corn price was down 2 cents at $3.93 1/4. Outside markets played a role on Friday, with the dollar index up $0.893.\nCommitment of Traders data from CFTC showed managed money speculators in corn futures and options trimming 9,274 contracts from their net short in the week ending on January 27. That mainly came via new longs, as the net short was at 72,050 contracts. Commercials saw some long reduction, with the net short rising 17,381 contracts to 187,342 contracts.\nExport Sales data now has corn commitments at 57.694 MMT, which is 33% above the same period last year. That is also 71% of the USDA export projection, ahead of the 67% average sales pace.\nThe Buenos Aires Grains Exchange estimates the Argentina corn crop at 46% good/excellent, lagging the 52% from last week but still better than the 31% rating last year.\nMar 26 Corn closed at $4.28 1/4, down 2 1/2 cents,\nNearby Cash was $3.93 1/4, down 2 cents,\nMay 26 Corn closed at $4.35 3/4, down 3 1/4 cents,\nJul 26 Corn closed at $4.42, down 3 3/4 cents,",
        "authors": "None",
        "publish_date": "2026-01-30 23:17:06",
        "published_at_raw": "2026-01-30T23:17:06Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed the Friday session with contracts pulling off midday lows but still down 2 to 4 cents. March was down 2 ¼ cents this week. The CmdtyView national average Cash Corn price was down 2 cents at $3.93 1/4. Outside markets played a role...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8b1d7838a7ec128f54a911924ba9e61f",
        "title": "Corn Facing Pressure to Close Out January",
        "doc_url": "https://www.barchart.com/story/news/37326863/corn-facing-pressure-to-close-out-january",
        "all_text": "Corn futures are falling back lower on Friday, with contracts down 5 to 5 ½ cents in the front months at midday. The CmdtyView national average Cash Corn price is down 5 cents at $3.90 1/2. The outside markets are playing a role, with the dollar index up $0.703 and crude oil down 94 cents/barrel.\nExport Sales data now has corn commitments at 57.694 MMT, which is 33% above the same period last year. That is also 71% of the USDA export projection, ahead of the 67% average sales pace.\nMar 26 Corn is at $4.25 3/4, down 5 cents,\nNearby Cash is at $3.90 1/2, down 5 cents,\nMay 26 Corn is at $4.33 3/4, down 5 1/4 cents,\nJul 26 Corn is at $4.40 1/2, down 5 1/4 cents,",
        "authors": "None",
        "publish_date": "2026-01-30 18:22:19",
        "published_at_raw": "2026-01-30T18:22:19Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are falling back lower on Friday, with contracts down 5 to 5 ½ cents in the front months at midday. The CmdtyView national average Cash Corn price is down 5 cents at $3.90 1/2. The outside markets are playing a role, with the dollar inde...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "171c50e2779c3d94cbdd9631f045e544",
        "title": "Hogs Close January with Weakness",
        "doc_url": "https://www.barchart.com/story/news/37332128/hogs-close-january-with-weakness",
        "all_text": "Lean hog futures saw weaker Friday trade, with contracts down 30 to 45 cents in the nearbys. February was down $1.10 this week. USDA’s national base hog price was reported at $83.57 on Friday afternoon, down 81 cents from the previous day. The CME Lean Hog Index was up another 50 cents on Jan 28 at $85.72.\nCFTC data indicated managed money increasing their net long in lean hog futures and options by 16,388 contracts, taking it to 113,806 contracts as of Tuesday.\nUSDA’s pork carcass cutout value from the Friday afternoon report was 79 cents higher to $94.22 per cwt. The loin and rib were the only primals reported lower. USDA estimated federally inspected hog slaughter this week at 2.522 million head. That was 54,000 head above last week but 37,861 head below the same week last year.\nFeb 26 Hogs closed at $87.250, down $0.450,\nApr 26 Hogs closed at $95.150, down $0.300\nMay 26 Hogs closed at $98.925, down $0.375,",
        "authors": "None",
        "publish_date": "2026-01-30 23:17:06",
        "published_at_raw": "2026-01-30T23:17:06Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw weaker Friday trade, with contracts down 30 to 45 cents in the nearbys. February was down $1.10 this week. USDA’s national base hog price was reported at $83.57 on Friday afternoon, down 81 cents from the previous day. The CME Le...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f7adbec1709e9f07c8c226dd61d1412b",
        "title": "U.S. Cattle Herd Dwindles to 75-Year Low, USDA Says",
        "doc_url": "https://www.agriculture.com/partners-u-s-cattle-herd-dwindles-to-75-year-low-usda-says-11896685",
        "all_text": "By Tom Polansek\nCHICAGO, Jan. 30 (Reuters) - The U.S. cattle herd dwindled to its smallest size since 1951, the U.S. Department of Agriculture said on Friday, signaling that beef prices will stay high for consumers after setting records last year.\nThe nation had 86.2 million cattle and calves as of Jan. 1, the USDA said in a biannual report, after a persistent drought drove ranchers to slash their herds. That was down 0.4% from a year earlier, when the herd also hit its lowest level since 1951.\nBeef prices will likely stay elevated for another two years because that is how long it would take to raise cattle that are ready to be slaughtered, if ranchers start to rebuild their herds, said Rich Nelson, chief strategist for Allendale.\n\"There is no sign of serious rebuilding,\" he said.\nHigh food prices contributed to knocking U.S. consumer confidence in January to the lowest level in more than 11-1/2 years, pressuring Republican President Donald Trump to address the issue of affordability which helped propel Democratic candidates to several electoral victories in 2025.\nIn October, Trump pledged to make beef more affordable. Yet prices have kept rising for hamburger meat and steaks. Retail prices for ground beef reached a record $6.69 per pound in December, up more than 2% from a month earlier and 19% from a year earlier, according to the Bureau of Labor Statistics.\nThe herd of cows raised for beef has declined continuously since 2019 as the drought in the western states burned pas",
        "authors": "None",
        "publish_date": "2026-01-30 22:00:36",
        "published_at_raw": "2026-01-30T22:00:36Z",
        "meta_site_name": "Successful Farming",
        "description": "The U.S. cattle herd dwindled to its smallest size since 1951, the USDA said on Friday, signaling that beef prices will stay high for consumers after setting records last year.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "aa054223f49a27d16501e1ae5bfc1d30",
        "title": "Hogs Slipping Lower on Friday",
        "doc_url": "https://www.barchart.com/story/news/37326903/hogs-slipping-lower-on-friday",
        "all_text": "Lean hog futures are down 10 to 35 cents at midday. USDA’s national base hog price was reported at $83.89 on Friday morning, down 49 cents from the previous day. The CME Lean Hog Index was up another 50 cents on Jan 28 at $85.72.\nUSDA’s pork carcass cutout value from the Friday AM report was $2.67 higher to $96.10 per cwt. The loin and ham were the only primals reported lower, with the belly up $11.22. USDA estimated federally inspected hog slaughter for Thursday at 495,000 head, which takes the weekly total to 1.877 million head. That is 9,000 head below last week and 56,348 head below the same week last year.\nFeb 26 Hogs are at $87.375, down $0.325,\nApr 26 Hogs are at $95.100, down $0.350\nMay 26 Hogs are at $99.200, down $0.100,",
        "authors": "None",
        "publish_date": "2026-01-30 18:22:19",
        "published_at_raw": "2026-01-30T18:22:19Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are down 10 to 35 cents at midday. USDA’s national base hog price was reported at $83.89 on Friday morning, down 49 cents from the previous day. The CME Lean Hog Index was up another 50 cents on Jan 28 at $85.72. USDA’s pork carcass...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f027fe072856343135555b009a0e5c8a",
        "title": "Hogs Traders Look to Round Out the Week",
        "doc_url": "https://www.barchart.com/story/news/37320968/hogs-traders-look-to-round-out-the-week",
        "all_text": "Lean hog futures were mixed on Thursday, with nearby February down 25 cents and other contracts 30 to 45 points higher. Preliminary open interest was up 3,476 contracts on Thursday. USDA’s national base hog price was reported at $84.38 on Thursday afternoon, down $1.90 from the previous day. The CME Lean Hog Index was up another 79 cents on Jan 27 at $85.22.\nUSDA’s Export Sales report showed pork sales at 55,980 MT in the week ending on January 22. Sales to Mexico totaled 28,300 MT, with 15,900 MT sold to China. Shipments were tallied at 35,923 MT for that week. Mexico was the destination of 17,400 MT, with 4,100 MT to Japan.\nPork exports in November totaled 613.1 million lbs according to Census data converted to a carcass basis. That was 4.9% below last year.\nUSDA’s pork carcass cutout value from the Thursday PM report was $1.62 lower to $93.43 per cwt. The loin was the only primal reported higher. USDA estimated federally inspected hog slaughter for Thursday at 495,000 head, which takes the weekly total to 1.877 million head. That is 9,000 head below last week and 56,348 head below the same week last year.\nFeb 26 Hogs closed at $87.700, down $0.250,\nApr 26 Hogs closed at $95.450, up $0.300\nMay 26 Hogs closed at $99.300, up $0.450,",
        "authors": "None",
        "publish_date": "2026-01-30 13:26:43",
        "published_at_raw": "2026-01-30T13:26:43Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were mixed on Thursday, with nearby February down 25 cents and other contracts 30 to 45 points higher. Preliminary open interest was up 3,476 contracts on Thursday. USDA’s national base hog price was reported at $84.38 on Thursday af...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f1542bc7d0e352caa5e5d8b7a3123416",
        "title": "Meat Delivery Los Angeles: Don Peter’s Carniceria Online",
        "doc_url": "https://www.latimes.com/b2b/consumer-goods-retail/story/2026-01-30/don-peters-carniceria-meat-delivery-los-angeles",
        "all_text": "Don Peter’s Carniceria, a long-time Southern California brick-and-mortar butcher shop known for premium meats and friendly customer service, has officially launched a new e-commerce website supporting home delivery in the Los Angeles area. The new platform marks a milestone for the business, allowing customers to access products that were once available only in-store, now delivered directly to their homes.\nFamily-owned and operated, Don Peter’s Carniceria has earned a loyal following with its offerings of USDA Prime beef, premium cuts, Australian-certified MS8 Wagyu and Japanese-certified A5 Wagyu.\nThe launch of the butcher’s new delivery service was designed to extend the core values of Don Peter’s Carniceria beyond its physical location. Customers throughout the Los Angeles area can now browse, select and order premium meats online, knowing that every product reflects the same standards that built the shop’s reputation.\nOrders are cut fresh, hand-prepared and shipped frozen to preserve peak quality. Customers looking for convenient, regular deliveries can also subscribe to receive curated meat delivery boxes from Don Peter’s Carniceria. Meat lovers can sign up for weekly, bi-weekly or monthly deliveries, and additional discounts are available for purchases of $120 or more.\n“Our new website is about giving more customers access to our quality products and exceptional service,” said co-owner David Contreras. “We’ve built our business by focusing on selling the finest cuts of ",
        "authors": "None",
        "publish_date": "2026-01-30 13:00:00",
        "published_at_raw": "2026-01-30T13:00:00Z",
        "meta_site_name": "Los Angeles Times",
        "description": "Don Peter’s Carniceria now delivers to Los Angeles! Shop USDA Prime, Wagyu, and custom cuts from the legacy butcher shop. Order online today.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "56b882a79395bc4ae9131238c501a0ad",
        "title": "Financial News Today",
        "doc_url": "https://www.barchart.com/news/financials",
        "all_text": "ProShares Ultra Pro (UPRO) and GameStop (GME) lead the Bull Strangle watch list for this week Bull Strangle Newsletter - Sat Jan 31, 1:32PM CST\nUPRO continues to trade in a strong uptrend, consolidating recent gains after a powerful multi-month advance. GameStop has recently shown strong signs of stabilization following a prolonged downtrend\nHow to Build a Low-Stress Options Income Portfolio With a 25% Cash Reserve Bull Strangle Newsletter - Sat Jan 31, 1:21PM CST\nHow disciplined capital structure matters more than timing in options income trading.\nThe Saturday Spread: Letting the Smart Money Act as an Early Warning Sign Barchart - Sat Jan 31, 9:15AM CST\nSince the most sophisticated market participants have access to resources that regular folks lack, their posture can clue us into potential sentiment swings.\nNEM : 112.35 (-11.49%)\nRIVN : 14.75 (-2.77%)\nTEVA : 34.08 (+3.05%)\nStocks Settle Lower on Weakness in Chip Stocks and Miners Barchart - Fri Jan 30, 3:32PM CST\nThe S&P 500 Index ($SPX ) (SPY ) on Friday closed down -0.43%, the Dow Jones Industrials Index ($DOWI ) (DIA ) closed down -0.36%, and the Nasdaq 100 Index ($IUXX ) (QQQ ) closed down -1.28%. March E-mini...\nAMAT : 322.32 (-5.57%)\nB : 45.79 (-12.03%)\nHL : 22.52 (-14.44%)\nVZ : 44.52 (+11.83%)\nSNDK : 576.25 (+6.85%)\nCDE : 20.44 (-16.81%)\n$IUXX : 25,552.39 (-1.28%)\nLITE : 391.84 (+2.73%)\nSNDR : 26.84 (-9.66%)\nZNH26 : 111-265s (-0.03%)\nOLN : 20.81 (-6.85%)\nESH26 : 6,965.75s (-0.39%)\n2 Ways to Trade Falling Bitcoin Pric",
        "authors": "None",
        "publish_date": "2026-01-30 11:00:00",
        "published_at_raw": "2026-01-30T11:00:00Z",
        "meta_site_name": "Barchart",
        "description": "Commodity News and Commentary from InsideFutures Market Specialists, USDA, Brugler Ag, more.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "aba516ebed701e49d8cc981f257567ae",
        "title": "Trump Administration Knew About Minnesota Fraud And Did Nothing",
        "doc_url": "https://www.huffpost.com/entry/minnesota-fraud-feeding-our-future-trump-usda_n_697bc72ee4b04b6f3b7f3b34",
        "all_text": "LOADINGERROR LOADING\nThe Trump administration justified its deadly immigration crackdown in Minnesota as necessary to combat fraud by Somali residents, some of whom are accused of defrauding the federal government through a food nonprofit.\nPresident Donald Trump even claimed Gov. Tim Walz (D) declined to run for reelection because he’d been “caught” stealing billions with Rep. Ilhan Omar (D-Minn.) and “others of his Somali friends.”\nAdvertisement\nBut in 2020, the first Trump administration was warned by the state that the nonprofit in question, Feeding Our Future, was likely engaged in fraud, and the administration declined to get involved.\nThat year, the Minnesota Department of Education asked the U.S. Department of Agriculture for support as it considered taking action against the nonprofit, which had contracts to provide meals for children and adults with disabilities. Minnesota told the USDA about startling growth in Feeding Our Future’s reimbursements, which increased 252% from 2019. While pandemic-driven changes could explain some of the increase, Minnesota’s overall reimbursements for the federal programs in question had only gone up 14%.\nA 2024 audit report by the Minnesota legislature examining the Feeding Our Future scandal said officials with the Education Department complained that the USDA was unresponsive when they asked about how to deal with problems presented by the nonprofit.\nAdvertisement\n“For example, one MDE official told us that in communications between",
        "authors": "None",
        "publish_date": "2026-01-30 10:45:17",
        "published_at_raw": "2026-01-30T10:45:17Z",
        "meta_site_name": "HuffPost",
        "description": "A former USDA official tells HuffPost that his superiors ignored the case that would inspire today’s deadly immigration crackdown.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:56",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]