[
    {
        "id": "cf1748167b8d2e1cd5845d97a028c1e2",
        "title": "Corn Closes with Thursday Strength",
        "doc_url": "https://www.barchart.com/story/news/36583708/corn-closes-with-thursday-strength",
        "all_text": "Corn futures posted higher Thursday trade, with contracts up fractionally to 2 ½ cents in the nearby contracts. December futures expire on Friday. The CmdtyView national average Cash Corn price was up 1 1/2 cents at $4.01 1/2.\nUSDA reported a private export sale of 186,000 MT of corn to unknown destinations this morning. Export Sales data was updated again this morning, showing a 4-week high 2.38 MMT of corn sold in the week ending on 11/13. That exceeded the 0.8-2 MMT range of estimates and was 59.3% larger than the same week last year.\nDelayed Census data showed September corn exports at a record 6.978 MMT (274.7 mbu). That was 9.09% larger than August and 60.93% larger than the same month last year. Distiller exports were 1.47% above last year at 1.059 MMT, with ethanol shipments at 148.4 million gallons during that month.\nA Taiwan importers purchased 65,000 MT of US corn in a tender overnight. CONAB released updated data this morning, showing Brazilian corn production at 138.88 MMT, up 0.04 MMT from their previous number.\nDec 25 Corn closed at $4.35 1/4, up 1/2 cent,\nNearby Cash was $4.01 1/2, up 2 1/2 cents,\nMar 26 Corn closed at $4.46 1/2, up 2 1/4 cents,\nMay 26 Corn closed at $4.54 1/4, up 2 1/2 cents,",
        "authors": "None",
        "publish_date": "2025-12-11 23:06:27",
        "published_at_raw": "2025-12-11T23:06:27Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted higher Thursday trade, with contracts up fractionally to 2 ½ cents in the nearby contracts. December futures expire on Friday. The CmdtyView national average Cash Corn price was up 1 1/2 cents at $4.01 1/2. USDA reported a privat...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "fe0a3f37b1ac56d032faff8a9374bdb3",
        "title": "Corn Bouncing Higher on Thursday",
        "doc_url": "https://www.barchart.com/story/news/36578505/corn-bouncing-higher-on-thursday",
        "all_text": "Corn futures are up 1 to 2 cents at Thursday’s midday. There were another 22 deliveries issued against December corn overnight. The CmdtyView national average Cash Corn price is up 1 3/42 cents at $4.01 3/4.\nUSDA reported a private export sale of 186,000 MT of corn to unknown destinations this morning. Export Sales data was updated again this morning, showing a 4-week high 2.38 MMT of corn sold in the week ending on 11/13. That exceeded the 0.8-2 MMT range of estimates and was 59.3% larger than the same week last year.\nDelayed Census data showed September corn exports at a record 6.978 MMT (274.7 mbu). That was 9.09% larger than August and 60.93% larger than the same month last year. Distiller exports were 1.47% above last year at 1.059 MMT, with ethanol shipments at 148.4 million gallons during that month.\nNASS released their backed up Grain Crushings report on Wednesday afternoon, showing September corn grind at 435.36 million bushels, down 2.66% from last year. October corn grind was also released, with 476.4 mbu of corn usage, up 2.76% vs. last year. In the first two months of the marketing year, corn used for ethanol was up 1 million bushel from last year.\nA Taiwan importers purchased 65,000 MT of US corn in a tender overnight. CONAB released updated data this morning, showing Brazilian corn production at 138.88 MMT, up 0.04 MMT from their previous number.\nDec 25 Corn is at $4.36 3/4, up 2 cents,\nNearby Cash is at $4.01 3/4, up 1 3/4 cents,\nMar 26 Corn is at $4.46, up 1 ",
        "authors": "None",
        "publish_date": "2025-12-11 18:23:08",
        "published_at_raw": "2025-12-11T18:23:08Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures are up 1 to 2 cents at Thursday’s midday. There were another 22 deliveries issued against December corn overnight. The CmdtyView national average Cash Corn price is up 1 3/42 cents at $4.01 3/4. USDA reported a private export sale of 18...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "949590f0b045d7a49ff34bc60714e400",
        "title": "French Corn Market Trends",
        "doc_url": "https://www.argusmedia.com/en/news-and-insights/market-opinion-and-analysis-blog/french-corn-market-trends",
        "all_text": "French corn: Competing for growth in a shifting market\nFrance’s corn export market is adapting to structural changes in the sector, as well as short-term market drivers. The 2025-26 marketing year could become a defining one for French corn as production in Europe falls, yields prove increasingly volatile and competition builds between exporters. Here are the key trends to watch out for.\nEuropean production in decline\nCorn production in Europe has been falling compared with historical norms for the past four years. Production in 2025 stands at 54.8mn t according to Argus, versus an average of 62mn-63mn t over the past 10 years. This decline is explained by:\nRecurring weather incidents: Droughts and heatwaves in eastern Europe (Bulgaria, Romania, Hungary).\nReduction in acreage: Spring crops are increasingly abandoned by many European producing countries (especially in eastern Europe) owing to high volatility in yields from one year to the next.\nUkrainian competition: Despite logistical difficulties this year, imported Ukrainian corn remains a major competitor.\nThe EU has retained its position as the world’s second-largest corn importer, behind Mexico, with a total of 22mn t to import in 2025-26. A precarious situation for the EU’s own production should keep the bloc in need of imports for years to come.\nFrance: Between stability and fragility\nFrench corn production has fluctuated between 10.1mn t and 14.4mn t over the past 10 years. In 2025, it stands at around 12mn t, but the",
        "authors": "None",
        "publish_date": "2025-12-11 00:00:00",
        "published_at_raw": "2025-12-11T00:00:00Z",
        "meta_site_name": "Argus Media",
        "description": "Explore French corn market trends, price updates, and production challenges. Learn how exports and animal feed demand shape the sector.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "13a89d94f49ea6ea22bda4cefc303e65",
        "title": "Oppn stages noisy walkout in Maha Assembly over cotton, soybean price issues",
        "doc_url": "https://www.lokmattimes.com/national/oppn-stages-noisy-walkout-in-maha-assembly-over-cotton-soybean-price-issues/",
        "all_text": "Nagpur, Dec 11 Opposition members on Thursday staged a noisy walkout to protest against the Mahayuti government, alleging apathy towards cotton and soybean growers and anomalies in procurement, especially amidst a rising gap between the purchase price and the guaranteed rate.\nOpposition expressed serious displeasure over the reply of Minister Jayakumar Rawal during question hour and raised slogans against the state government.\nThe opposition aggressively cornered the government over the non-initiation of official cotton procurement centres in many parts of the state and the failure to provide Minimum Support Price (MSP) for soybean. The opposition members, infuriated by the perfunctory answers given by Minister Rawal on farmers' issues, ultimately staged a walkout. Congress Legislative Party leader Vijay Wadettiwar accused the government of responding with a \"mockery of the farmers\".\nDuring the Question Hour in the Assembly, Wadettiwar highlighted the situation of farmers. He pointed out that cotton procurement is not happening due to conditions imposed by the Cotton Corporation of India (CCI), and the procurement limit is also low.\nHe further criticised the government, stating that the import duty on cotton, which was 12 per cent, has been reduced to zero, which will cause cotton prices to fall in India due to increased imports.\" Out of 50 cotton-laden vehicles, 40 are being sent back. What will the farmer do?\" he questioned.\nWadettiwar and other opposition members claimed t",
        "authors": "None",
        "publish_date": "2025-12-11 07:32:19",
        "published_at_raw": "2025-12-11T07:32:19Z",
        "meta_site_name": "Lokmat Times",
        "description": "Oppn stages noisy walkout in Maha Assembly over cotton, soybean price issues - Nagpur, Dec 11 Opposition members on Thursday staged a noisy walkout to protest against the Mahayuti government, alleging ... Get Latest News on National only on lokmattimes.com",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a3426a80cfe93b7493ad4d5e307d6967",
        "title": "Soybeans End Thursday on a Slightly Higher Note",
        "doc_url": "https://www.barchart.com/story/news/36583718/soybeans-end-thursday-on-a-slightly-higher-note",
        "all_text": "Soybeans saw slight gains of 1 to 2 1/4 cents in the nearbys on Thursday. The cmdtyView national average Cash Bean price was 1 3/4 cents higher at $10.22 1/2. Soymeal futures were up 30 to 90 cents, with Soy Oil futures 23 to 29 points lower.\nUSDA reported private export sales of 264,000 MT of soybeans to China and 226,000 MT to unknown destinations in another flash sale announcement this week. Export Sales data for the week ending on November 13 was out on Thursday morning, with bean bookings totaling 695,598 MT, which was on the lower side of 0.6-1.4 MMT estimates. That was an improvement from last week but still 61% below the same week last year.\nSoybean meal sales were 357,861 MT, on the higher side of the 50,000 to 450,000 MT estimated range. Bean oil sales were tallied at net reductions of 13,345 MT, below estimates of net sale of 5,000 to 25,000 MT.\nSeptember soybean shipments were released this morning, with exports totaling 2.856 MMT (104.94 mbu). That was down 8.29% from last year but still the 2nd largest in the last 5 years. Meal sales continued the streak of monthly record, with the 7th monthly record in a row at 1.32 MMT shipped in September. Soy oil shipments were the lowest since October 2024 at 17,617 MT.\nSoybean production for Brazil was updated to 177.12 MMT according to CONAB, down 0.48 MMT from their November estimate. Sinograin, China’s state stockpiler, sold 397,000 MT of imported beans in an auction on Thursday.\nJan 26 Soybeans closed at $10.93 1/2, up",
        "authors": "None",
        "publish_date": "2025-12-11 23:06:27",
        "published_at_raw": "2025-12-11T23:06:27Z",
        "meta_site_name": "Barchart",
        "description": "Soybeans saw slight gains of 1 to 2 1/4 cents in the nearbys on Thursday. The cmdtyView national average Cash Bean price was 1 3/4 cents higher at $10.22 1/2. Soymeal futures were up 30 to 90 cents, with Soy Oil futures 23 to 29 points lower. USDA r...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "97f89108c63cce77d687c4563f5fb51e",
        "title": "Hogs Show Gains on Thursday",
        "doc_url": "https://www.barchart.com/story/news/36583748/hogs-show-gains-on-thursday",
        "all_text": "Lean hog futures saw strength on Thursday with contracts up 85 cents to $1.85. USDA’s national base hog price was reported at $71.69 on Thursday afternoon, up $1.64 from the day prior. The CME Lean Hog Index was up 27 cents on December 8 at $82.16.\nUSDA’s Export Sales report for the week ending on November 13 was released this morning, with pork sales of 23,606 MT for 2025 and 3,947 MT for 2026. Export shipments were 32,132 MT, which was the highest since June.\nCensus data converted to a carcass basis showed 545.28 million lbs of pork exports in September. That was down 0.8% from last year’s September record and 0.5% above the August total.\nUSDA’s pork carcass cutout value from the Thursday PM report was $1.57 higher to $98.84 per cwt. All primals were reported higher, led by the butt and belly. USDA estimated federally inspected hog slaughter for Thursday at 494,000 head, taking the week to date total to 1.965 million head. That was 22,000 head above last week and 37,121 head above the same week last year.\nDec 25 Hogs closed at $83.400, up $0.950,\nFeb 26 Hogs closed at $84.175, up $1.750\nApr 26 Hogs closed at $89.225, up $1.850,",
        "authors": "None",
        "publish_date": "2025-12-11 23:06:27",
        "published_at_raw": "2025-12-11T23:06:27Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw strength on Thursday with contracts up 85 cents to $1.85. USDA’s national base hog price was reported at $71.69 on Thursday afternoon, up $1.64 from the day prior. The CME Lean Hog Index was up 27 cents on December 8 at $82.16....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "75045f06b569561558fb16a6bafac0e2",
        "title": "Senators Urge Action on Bird Flu Amid Rising Cases",
        "doc_url": "https://www.devdiscourse.com/article/health/3728137-senators-urge-action-on-bird-flu-amid-rising-cases",
        "all_text": "A bipartisan cohort of U.S. senators is pressing President Trump's administration to finalize a comprehensive, science-driven strategy for bird flu vaccination for livestock. This call comes as the virus continues to ravage poultry populations, with over 180 million affected since last year.\nThe U.S. Department of Agriculture's potential vaccination plan remains under wraps. However, 23 senators, including key figures from both parties, emphasized the incorporation of scientific input and expert opinions in their letter to Agriculture Secretary Brooke Rollins.\nDespite the poultry industry's hesitations over export-related concerns, the USDA has committed substantial funding towards vaccine research. Yet, the agency's efforts to collaborate with international partners on a cohesive strategy are still in development, according to recent reports.",
        "authors": "None",
        "publish_date": "2025-12-11 19:21:45",
        "published_at_raw": "2025-12-11T19:21:45Z",
        "meta_site_name": "Devdiscourse",
        "description": "A bipartisan group of U.S. senators has urged the Trump administration to finalize a science-based bird flu vaccine plan for livestock, amid ongoing outbreaks that have killed millions of poultry. The USDA has yet to release details but is encouraged to incorporate feedback from stakeholders and experts.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ce0da37dcaec6b1c05024b42865839d9",
        "title": "USDA Invests to Expand Southwest Iowa Water Systems, Rural Health Care",
        "doc_url": "https://www.agriculture.com/partners-usda-invests-to-expand-southwest-iowa-water-systems-rural-health-care-11867100",
        "all_text": "By Cami Koons\nThe USDA Rural Development announced nearly $5 million in grants to help improve water access and health care facilities in rural Iowa communities.\nFayette, Wayne, Taylor, Crawford and Pottawattamie counties are recipients of the grants announced Wednesday by Iowa Rural Development Director Mike Sexton.\n“At Rural Development, we believe our Iowa farms and small towns are part of the bedrock that supports our country,” Sexton said in a statement. “Under the leadership of President Trump and Secretary Rollins, USDA is helping to deliver more reliable water supplies and healthcare facilities to make rural Iowa a better place to live and work.”\nThe water system grants for Denison Municipal Utilities and the City of Macedonia follow several summers of water shortages, boil orders and water conservation orders in the southwestern municipalities.\nDenison received a $1 million grant to help construct a rock riffle dam to help “recharge” the utility’s well field, according to a news release. A rock riffle dam places rocks in a stream, in this case the East Boyer River, to control the grade of the stream. According to the release, the dam will help provide a more consistent water supply for the community, “especially during drought conditions.”\nAnother grant, in the amount of $580,000, was awarded to the City of Macedonia for the construction of a new well into the city’s existing well field. Currently, according to the release, the city has to reduce the pumping rate of ",
        "authors": "None",
        "publish_date": "2025-12-11 18:45:46",
        "published_at_raw": "2025-12-11T18:45:46Z",
        "meta_site_name": "Successful Farming",
        "description": "The USDA Rural Development announced nearly $5 million in grants to help improve water access and health care facilities in rural Iowa communities.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a476012d0230519052ca4a80d9afa20d",
        "title": "USDA grants Missouri request to bar junk foods from SNAP",
        "doc_url": "https://www.stltoday.com/news/local/government-politics/article_baef5641-e277-4b21-af0d-1c06fdc43cbb.html",
        "all_text": "Get Government & Politics updates in your inbox!\nStay up-to-date on the latest in local and national government and political topics with our newsletter.\n* I understand and agree that registration on or use of this site constitutes agreement to its user agreement and privacy policy.\nKurt Erickson | Post-Dispatch\nJefferson City reporter\nGet email notifications on {{subject}} daily!\nYour notification has been saved.\nThere was a problem saving your notification.\n{{description}}\nEmail notifications are only sent once a day, and only if there are new matching items.\nFollowed notifications\nPlease log in to use this feature\nLog In\nDon't have an account? Sign Up Today",
        "authors": "None",
        "publish_date": "2025-12-11 17:45:00",
        "published_at_raw": "2025-12-11T17:45:00Z",
        "meta_site_name": "St. Louis Post-Dispatch",
        "description": "One in 10 Missourians receive food stamp benefits.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d4d278fe00b7dbac2944f20f82ceb0b4",
        "title": "Soybeans Down More Than 4¢ This Morning | Thursday, Dec. 11, 2025",
        "doc_url": "https://www.agriculture.com/soybeans-down-more-than-4cent-this-morning-or-thursday-dec-11-2025-11866800",
        "all_text": "Ahead of 9:15 a.m. CT, March corn was up 1¼¢ at $4.45½ per bushel.\nJanuary soybeans were down 4½¢ at $10.86¾ per bushel.\nMarch CBOT wheat was unchanged at $5.29½ per bushel. March Kansas City wheat was down 2¢ at $5.21¼ per bushel. March Minneapolis wheat was up 1¾¢ at $5.77.\nUSDA announced several new export sales this morning:\nChina is buying 264,000 metric tons of soybeans for the 2025/2026 marketing year.\nUnknown destinations are buying 186,000 metric tons of corn for the 2025/2026 marketing year.\nUnknown destinations are buying 226,000 metric tons of soybeans for the 2025/2026 marketing year.\nAhead of 9:15 a.m. CT, January feeder cattle were up $4.30 at $342.68 per hundredweight (cwt). February live cattle were up $2.30 at $230.83 per cwt. February lean hogs were up $1.20 at $83.63 per cwt.\nJanuary crude oil was down $1.06 at $57.40 per barrel.\nThe U.S. Dollar Index December contract was down to 98.23.\nThe S&P 500 Index was down 29.79 points, and the Dow Jones Industrial Average was up 271.42 points.\nPublished: 9:43 a.m. CT",
        "authors": "None",
        "publish_date": "2025-12-11 15:43:44",
        "published_at_raw": "2025-12-11T15:43:44Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA announced export sales again today.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ac969da2abfb7985e62a4e9d270b2606",
        "title": "Farm Groups React as USDA Invests $700 Million in Regenerative Agriculture",
        "doc_url": "https://www.agriculture.com/farm-groups-react-as-usda-invests-usd700-million-in-regenerative-agriculture-11866635",
        "all_text": "USDA is set to spend $700 million to support regenerative agriculture, Secretary of Agriculture Brooke Rollins and Health and Human Services Secretary Robert F. Kennedy Jr. announced in a joint press event Wednesday. The new Regenerative Pilot Program leverages existing programs, the Environmental Quality Incentives Program (EQIP), and the Conservation Stewardship Program (CSP), to advance regenerative practices.\nHere’s a closer look at industry groups’ reaction to the news.\nAmerican Farm Bureau Federation\nThe American Farm Bureau Federation (AFBF) is the nation’s largest farmer-run organization and serves farmers in all 50 states.\nIn response to USDA’s announcement, AFBF President Zippy Duval said, “We value USDA’s acknowledgement that farmers have long practiced regenerative agriculture on their farms, both through federal conservation programs and on their own. Building on these efforts by leveraging existing voluntary and incentive-based programs to advance additional regenerative goals sounds like smart government to me, especially when farmers remain in the driver’s seat.”\nThe statement continued, “The public trusts farmers more than anyone — including government — to lead on regenerative agriculture, based on national polling. We don’t take that trust for granted. Farmers rely on healthy land to grow nutritious crops, raise healthy animals, and ensure our farms thrive for future generations. So, we take seriously our responsibility to care for the land.\nLooking ahead, ",
        "authors": "None",
        "publish_date": "2025-12-11 14:27:12",
        "published_at_raw": "2025-12-11T14:27:12Z",
        "meta_site_name": "Successful Farming",
        "description": "On Wednesday USDA announced it will spend $700 million to support regenerative agriculture. Here’s a closer look at reactions to the news from across the industry.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "d7f7f7cc54cb1493769cfc707292f1e8",
        "title": "Hogs Look to Thursday, as Pork Cutout Bounces",
        "doc_url": "https://www.barchart.com/story/news/36571981/hogs-look-to-thursday-as-pork-cutout-bounces",
        "all_text": "Lean hog futures were down a nickel in the soon to expire December contracts, with other contracts up 55 to 85 cents. USDA’s national base hog price was reported at $70.05 on Wednesday afternoon, down $1.38 from the day prior. The CME Lean Hog Index was up 5 cents on December 8 at $81.89.\nCommitment of Traders data showed a total of 7,306 contracts cut from the managed money net long in the week of 11/10 at 71,512 contracts in lean hog futures and options.\nUSDA’s pork carcass cutout value from the Wednesday PM report was 83 cents higher to $97.27 per cwt. The picnic and ham primals were the only reported higher. USDA estimated federally inspected hog slaughter for Wednesday at 490,000 head, taking the week to date total to 1.471 million head. That was 28,000 head above last week and 16,264 head above the same week last year.\nDec 25 Hogs closed at $82.450, down $0.050,\nFeb 26 Hogs closed at $82.425, up $0.550\nApr 26 Hogs closed at $87.375, up $0.850,",
        "authors": "None",
        "publish_date": "2025-12-11 13:38:03",
        "published_at_raw": "2025-12-11T13:38:03Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures were down a nickel in the soon to expire December contracts, with other contracts up 55 to 85 cents. USDA’s national base hog price was reported at $70.05 on Wednesday afternoon, down $1.38 from the day prior. The CME Lean Hog Index...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:14",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8dedf3f42b95c50e51c6a7aed1b1ae9e",
        "title": "Wheat Posting Slight Thursday Morning Gains",
        "doc_url": "https://www.barchart.com/story/news/36571959/wheat-posting-slight-thursday-morning-gains",
        "all_text": "The wheat complex is showing stronger trade on Thursday morning. Wheat posted Wednesday weakness, as futures saw a delayed response to USDA’s added world production from Tuesday. Chicago SRW futures posted losses of a nickel in the front months on the midweek session. Open interest suggested new selling, down 6,592 contracts. KC HRW futures saw losses of 3 to 4 cents on Wednesday. There were 5 deliveries issued against December KC wheat. MPLS spring wheat as steady to a penny lower.\nThe weekly Export Sales report will get another catch-up release on Thursday morning. Analysts are looking for between 200,000 to 600,000 MT in sales for the week ending on 11/13.\nThe quarterly Flour Milling report from NASS was released on Wednesday, with the July-September wheat ground for flour totaling 231.4 million bushels. That was 8.5 million bushels above the April-June total, but down 1 mbu vs. the same period last year.\nCFTC released another update to the Commitment of Traders report on Wednesday, indicating managed money cutting 11,852 contracts from their net short in CBT wheat to 58,761 contracts as of 11/10. In KC wheat, speculators trimmed 9,237 contracts from their net short to 33,217 contracts.\nA couple South Korean importers purchased a total of 130,000 MT wheat overnight.\nDec 25 CBOT Wheat closed at $5.31 1/4, down 5 cents, currently unch\nMar 26 CBOT Wheat closed at $5.29 1/2, down 5 cents, currently up 1 1/2 cents\nDec 25 KCBT Wheat closed at $5.16 1/2, down 3 3/4 cents, current",
        "authors": "None",
        "publish_date": "2025-12-11 13:38:03",
        "published_at_raw": "2025-12-11T13:38:03Z",
        "meta_site_name": "Barchart",
        "description": "The wheat complex is showing stronger trade on Thursday morning. Wheat posted Wednesday weakness, as futures saw a delayed response to USDA’s added world production from Tuesday. Chicago SRW futures posted losses of a nickel in the front months on th...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ae706f13c82ba8316e0aa311cc70822a",
        "title": "U.S. Senators Push USDA for Urgent Action on Bird Flu Vaccine",
        "doc_url": "https://www.agriculture.com/partners-u-s-senators-push-usda-for-urgent-action-on-bird-flu-vaccine-11866683",
        "all_text": "By Leah Douglas\nWASHINGTON, Dec. 11 (Reuters) - A bipartisan group of U.S. senators this week urged the administration of President Donald Trump to finalize a science-based plan for developing a bird flu vaccine for livestock, according to a letter seen by Reuters.\nMore than 180 million chickens, turkeys, and other poultry have been killed due to an outbreak of bird flu that began in 2022. The U.S. Department of Agriculture said in June that it was developinga potential poultry vaccination plan, but has not released further details.\nThe USDA should take \"renewed action\" to fight bird flu as infections rise during the winter months, said 23 U.S. senators in a letter sent on Wednesday to Agriculture Secretary Brooke Rollins and reported first by Reuters.\n\"Any finalized vaccine strategy must take into account feedback from animal health stakeholders, industry experts, and be grounded in sound science,\" said the letter, led by Amy Klobuchar of Minnesota, the top Democrat on the Senate Agriculture Committee, and Republican U.S. Senator Mike Rounds of South Dakota.\nOther signatories to the letter include Senate Majority Leader John Thune of South Dakota and several Republican and Democratic members of the Senate Agriculture Committee.\nIn March, the USDA pledged$100 million to research vaccines and therapeutics for egg-laying chickens as part of a broader strategy to fight bird flu, which had driven egg prices to record highs.\nThe agency said in June it had received 417 proposals fo",
        "authors": "None",
        "publish_date": "2025-12-11 12:35:13",
        "published_at_raw": "2025-12-11T12:35:13Z",
        "meta_site_name": "Successful Farming",
        "description": "A bipartisan group of U.S. senators this week urged the administration of President Donald Trump to finalize a science-based plan for developing a bird flu vaccine for livestock, according to a letter seen by Reuters.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bf82ff7f7c6253c35ff82b3a36be9cf6",
        "title": "USDA approves TN waiver to ban SNAP candy, soda purchases",
        "doc_url": "https://www.knoxnews.com/story/news/politics/2025/12/11/usda-tn-snap-soda-ban-candy/87705232007/",
        "all_text": "Tennessee recipients of federal food aid may soon see new restrictions on what candy and soda they can purchase with the federal benefit.\nThe Department of Agriculture approved Dec. 10 Tennessee's application seeking to create new restrictions on what products will be covered by the Supplemental Nutrition Assistance Program, including banning junk food items like soda and candy.\nAgriculture Secretary Brooke Rollins said the \"Make America Healthy Again\" initiative is designed to “reverse the chronic diseases epidemic that has taken root in this country for far too long.”\n“President Trump has made it clear: We are restoring SNAP to its true purpose — nutrition,” Rollins said. “With these new waivers, we are empowering states to lead, protecting our children from the dangers of highly-processed foods, and moving one step closer to the President’s promise to Make America Healthy Again.”\nTennessee House members passed a bill this spring directing the state government to seek a first-of-its-kind federal waiver to exclude candy and soft drinks from the state SNAP program, but a companion bill stalled in the Senate Health and Welfare Committee. Gov. Bill Lee’s administration sought the waiver anyway.\n“The Trump Administration's leadership to create innovative, responsible solutions that strengthen families and improve health outcomes will have a lasting impact on Tennesseans for generations to come,” Gov. Lee said.\nHouse Deputy Speaker Jason Zachary, R-Knoxville, who sponsored the Ho",
        "authors": "None",
        "publish_date": "2025-12-11 11:19:51",
        "published_at_raw": "2025-12-11T11:19:51Z",
        "meta_site_name": "Knoxville News-Sentinel",
        "description": "About 11% of SNAP dollars nationwide are used to purchase sweetened beverages and candy.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "50d084f049a3dbb88cd01905155ecf26",
        "title": "US senators push USDA for urgent action on bird flu vaccine",
        "doc_url": "https://www.reuters.com/business/healthcare-pharmaceuticals/us-senators-push-usda-urgent-action-bird-flu-vaccine-2025-12-11/",
        "all_text": "WASHINGTON, Dec 11 (Reuters) - A bipartisan group of U.S. senators this week urged the administration of President Donald Trump to finalize a science-based plan for developing a bird flu vaccine for livestock, according to a letter seen by Reuters.\nMore than 180 million chickens, turkeys and other poultry have been killed due to an outbreak of bird flu that began in 2022. The U.S. Department of Agriculture said in June that it was developing a potential poultry vaccination plan, but has not released further details.\nSign up here.\nThe USDA should take \"renewed action\" to fight bird flu as infections rise during the winter months, said 23 U.S. senators in a letter sent on Wednesday to Agriculture Secretary Brooke Rollins and reported first by Reuters.\n\"Any finalized vaccine strategy must take into account feedback from animal health stakeholders, industry experts, and be grounded in sound science,\" said the letter, led by Amy Klobuchar of Minnesota, the top Democrat on the Senate Agriculture Committee, and Republican U.S. Senator Mike Rounds of South Dakota.\nOther signatories to the letter include Senate Majority Leader John Thune of South Dakota and several Republican and Democratic members of the Senate Agriculture Committee.\nIn March, the USDA pledged $100 million to research vaccines and therapeutics for egg-laying chickens as part of a broader strategy to fight bird flu, which had driven egg prices to record highs.\nThe agency said in June it had received 417 proposals for ",
        "authors": "None",
        "publish_date": "2025-12-11 11:07:25",
        "published_at_raw": "2025-12-11T11:07:25Z",
        "meta_site_name": "Reuters",
        "description": "A bipartisan group of U.S. senators this week urged the administration of President Donald Trump to finalize a science-based plan for developing a bird flu vaccine for livestock, according to a letter seen by Reuters.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a054c69fd4c0ba8c7b20dc6425580e89",
        "title": "US Senators Push USDA for Urgent Action on Bird Flu Vaccine",
        "doc_url": "https://www.usnews.com/news/top-news/articles/2025-12-11/us-senators-push-usda-for-urgent-action-on-bird-flu-vaccine",
        "all_text": "By Leah Douglas\nWASHINGTON, Dec 11 (Reuters) - A bipartisan group ‌of ​U.S. senators this week urged ‌the administration of President Donald Trump to finalize a science-based plan for ​developing a bird flu vaccine for livestock, according to a letter seen by Reuters.\nMore than 180 ‍million chickens, turkeys and other poultry ​have been killed due to an outbreak of bird flu that began in 2022. ​The U.S. Department ⁠of Agriculture said in June that it was developing a potential poultry vaccination plan, but has not released further details.\nThe USDA should take \"renewed action\" to fight bird flu as infections rise during the winter months, said 23 U.S. senators in a letter sent on Wednesday to ‌Agriculture Secretary Brooke Rollins and reported first by Reuters.\n\"Any finalized vaccine strategy must take ​into account ‌feedback from animal health ‍stakeholders, industry experts, ⁠and be grounded in sound science,\" said the letter, led by Amy Klobuchar of Minnesota, the top Democrat on the Senate Agriculture Committee, and Republican U.S. Senator Mike Rounds of South Dakota.\nOther signatories to the letter include Senate Majority Leader John Thune of South Dakota and several Republican and Democratic members of the Senate Agriculture Committee.\nIn March, the USDA pledged $100 million to research vaccines and therapeutics ​for egg-laying chickens as part of a broader strategy to fight bird flu, which had driven egg prices to record highs.\nThe agency said in June it had received 41",
        "authors": "None",
        "publish_date": "2025-12-11 11:07:00",
        "published_at_raw": "2025-12-11T11:07:00Z",
        "meta_site_name": "U.S. News & World Report",
        "description": "US News is a recognized leader in college, grad school, hospital, mutual fund, and car rankings. Track elected officials, research health conditions, and find news you can use in politics, business, health, and education.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "4611bc3b8f2a7997d79d3ab2de32582b",
        "title": "US senators push USDA for urgent action on bird flu vaccine",
        "doc_url": "https://www.marketscreener.com/news/us-senators-push-usda-for-urgent-action-on-bird-flu-vaccine-ce7d50dad08ff525",
        "all_text": "WASHINGTON, Dec 11 (Reuters) - A bipartisan group of U.S. senators this week urged the administration of President Donald Trump to finalize a science-based plan for developing a bird flu vaccine for livestock, according to a letter seen by Reuters.\nMore than 180 million chickens, turkeys and other poultry have been killed due to an outbreak of bird flu that began in 2022. The U.S. Department of Agriculture said in June that it was developing a potential poultry vaccination plan, but has not released further details.\nThe USDA should take \"renewed action\" to fight bird flu as infections rise during the winter months, said 23 U.S. senators in a letter sent on Wednesday to Agriculture Secretary Brooke Rollins and reported first by Reuters.\n\"Any finalized vaccine strategy must take into account feedback from animal health stakeholders, industry experts, and be grounded in sound science,\" said the letter, led by Amy Klobuchar of Minnesota, the top Democrat on the Senate Agriculture Committee, and Republican U.S. Senator Mike Rounds of South Dakota.\nOther signatories to the letter include Senate Majority Leader John Thune of South Dakota and several Republican and Democratic members of the Senate Agriculture Committee.\nIn March, the USDA pledged $100 million to research vaccines and therapeutics for egg-laying chickens as part of a broader strategy to fight bird flu, which had driven egg prices to record highs.\nThe agency said in June it had received 417 proposals for the funds, but",
        "authors": "None",
        "publish_date": "2025-12-11 11:02:26",
        "published_at_raw": "2025-12-11T11:02:26Z",
        "meta_site_name": "MarketScreener",
        "description": "A bipartisan group of U.S. senators this week urged the administration of President Donald Trump to finalize a science-based plan for developing a bird flu vaccine for livestock, according to a letter...\n-December 11, 2025 at 06:02 am EST\n- MarketScreener",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e501a0979f76691b92d68289330b2cba",
        "title": "Virtual Fencing Gaining Some Traction with USDA, Private Funding",
        "doc_url": "https://www.agriculture.com/partners-virtual-fencing-gaining-some-traction-with-usda-private-funding-11865856",
        "all_text": "When heavy rains flooded pastures in East Hardwick, Maine, in July 2023, rancher Ben Nottermann couldn’t reach his livestock for days.\nYet his cattle remained safe with access to higher ground and food, guided by collars from a virtual fencing system.\n“Had they been on poly wire and step-in posts, they would have either run out of feed, broken the poly wire to get more, or made a giant mess,” said Nottermann. “I was able to move them forward and keep them in grass from my home without actually having to go there.”\nAs extreme weather, rising labor costs, and growing interest in regenerative agriculture drive demand, public and private funding are helping producers like Nottermann adopt the technology.\nVirtual fencing uses GPS collars, audio cues, and mild electric pulses to guide livestock within set boundaries, and farmers are testing the technology for rotational grazing and protecting sensitive areas, reducing the need for high-maintenance physical fences. Farmers can set fencing perimeters and track animals all through an app.\nNofence U.S. managing director Alex Bell said the collars are simple to set up. “You basically unbox the collar, you put the battery in, and you’re off to the races,” he said.\nBell added that virtual fencing is more than a containment tool. “It’s not just a fence, it’s a management system that helps the farmer or rancher get more out of their land and livestock,” he said.\nResearch on virtual fencing began in the 1980s but only became commercially ava",
        "authors": "None",
        "publish_date": "2025-12-11 11:00:00",
        "published_at_raw": "2025-12-11T11:00:00Z",
        "meta_site_name": "Successful Farming",
        "description": "When heavy rains flooded pastures in East Hardwick, Maine, in July 2023, rancher Ben Nottermann couldn’t reach his livestock for days.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "519ea988a1646b8a9cd2eb6179e29cba",
        "title": "QUESTION OF THE DAY: Do you agree with banning sugary food and drinks from SNAP?",
        "doc_url": "https://abc17news.com/news/missouri/2025/12/11/question-of-the-day-do-you-agree-with-banning-sugary-food-and-drinks-from-snap/",
        "all_text": "The USDA said Wednesday that it had approved Missouri's request for a waiver from Supplemental Nutrition Assistance Program rules, allowing the state to exclude sugary food and drinks from the program.\nSNAP helps low-income Missourians pay for food. Starting next year, they won't be able to use SNAP funds to buy prepackaged sweets, candy, soda, sugary juices and certain other items.\nThe move is drawing praise for its healthy focus. Others say it's a way to target the poor.\nWhat do you think? Let us know by voting in the poll.",
        "authors": "None",
        "publish_date": "2025-12-11 10:15:09",
        "published_at_raw": "2025-12-11T10:15:09Z",
        "meta_site_name": "ABC17News.com",
        "description": "The USDA said Wednesday that it had approved Missouri's request for a waiver from Supplemental Nutrition Assistance Program rules, allowing the state to exclude sugary food and drinks from the program. SNAP helps low-income Missourians pay for food. Starting next year, they won't be able to use SNAP funds to buy prepackaged sweets, candy, soda,",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "7213cd39f442ce2ebe485a13f28c2baa",
        "title": "Wheat steadies after selloff triggered by USDA raising production estimates",
        "doc_url": "https://www.livemint.com/market/commodities/wheat-steadies-after-selloff-triggered-by-usda-raising-production-estimates-11765418838155.html",
        "all_text": "CANBERRA, Dec 11 (Reuters) - U.S. wheat futures steadied on Thursday, having fallen nearly 1% in the previous session after the U.S. Department of Agriculture (USDA) raised its estimates for global production and end-of-season stocks, cementing expectations for ample supply.\nSoybean futures gained for a second day after the USDA confirmed more sales of U.S. beans to China. Corn edged higher amid strong U.S. export demand.\nFUNDAMENTALS\n* The most-active wheat contract on the Chicago Board of Trade (CBOT) was up 0.2% at $5.30-1/2 a bushel, as of 0141 GMT, after falling to $5.25-1/4 on Wednesday, its lowest since October 31.\n* CBOT soybeans were up 0.2% at $10.93-3/4 a bushel, having also slipped in the previous session to the lowest since late October.\n* Corn rose 0.1% to $4.44-1/2 a bushel.\n* The USDA on Tuesday raised its wheat production forecasts for this season in major exporters including Russia, Australia and Canada and increased its global ending stocks estimate by 3.4 million metric tons, more than most analysts had expected.\n* Traders, however, remain wary of attacks on shipping in the Black Sea that could disrupt exports and push up prices.\n* The USDA on Wednesday announced a series of fresh purchases of U.S. soybeans, confirming private sales of 136,000 tons of U.S. beans to China, another 331,000 tons to undisclosed destinations and 120,000 tons of soymeal to Poland.\n* CBOT soybeans have fallen around 6.5% from a 17-month high of $11.69-1/2 last month, as China bou",
        "authors": "None",
        "publish_date": "2025-12-11 02:07:17",
        "published_at_raw": "2025-12-11T02:07:17Z",
        "meta_site_name": "Livemint",
        "description": "GLOBAL-GRAINS/:GRAINS-Wheat steadies after selloff triggered by USDA raising production estimates",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "2a181f22b9237dd20a2e61eb50efa234",
        "title": "USDA Launches $700 Million New Regenerative Pilot Program Aimed at Slashing Production Costs and Advancing the MAHA Agenda",
        "doc_url": "https://www.thegatewaypundit.com/2025/12/usda-launches-700-million-new-regenerative-pilot-program/",
        "all_text": "The Trump Administration rolled out another major America-First initiative on Wednesday, announcing a sweeping $700 million Regenerative Pilot Program designed to turbo-charge U.S. farm productivity, cut red tape, and restore America’s depleted soil, further cementing President Trump’s Make America Healthy Again (MAHA) agenda across the federal government.\nU.S. Secretary of Agriculture Brooke L. Rollins, joined by Health and Human Services Secretary Robert F. Kennedy, Jr. and CMS Administrator Dr. Mehmet Oz, detailed the new program, which directs unprecedented support to farmers adopting regenerative practices that reduce production costs while strengthening America’s food and fiber supply.\nThe announcement marks another sharp departure from the Biden era’s bloated bureaucracy, anti-farmer regulations, and globalist climate dogma that punished American producers while favoring foreign competitors.\nSecretary Brooke Rollins said in a statement:\n“Protecting and improving the health of our soil is critical not only for the future viability of farmland, but to the future success of American farmers.\nIn order to continue to be the most productive and efficient growers in the world, we must protect our topsoil from unnecessary erosion and improve soil health and land stewardship.\nToday’s announcement encourages these priorities while supporting farmers who choose to transition to regenerative agriculture. The Regenerative Pilot Program also puts Farmers First and reduces barriers t",
        "authors": "None",
        "publish_date": "2025-12-11 01:40:54",
        "published_at_raw": "2025-12-11T01:40:54Z",
        "meta_site_name": "The Gateway Pundit",
        "description": "The Trump Administration rolled out another major America-First initiative on Wednesday, announcing a sweeping $700 million Regenerative Pilot Program designed to turbo-charge U.S.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:15",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]