[
    {
        "id": "87570eb96d57033ed6b9b5c7e306bc35",
        "title": "All SNAP recipients will have to reapply, USDA chief says",
        "doc_url": "https://www.al.com/news/2025/11/all-snap-recipients-will-have-to-reapply-usda-chief-says.html",
        "all_text": "All recipients of Supplemental Nutrition Assistance Program, or SNAP, will have to reapply for benefits, according to a Trump administration official.\nAgriculture Secretary Brooke Rollins said the move is an effort to weed out alleged fraud and comes after the data from 29 Republican states showed “186,000 deceased men and women and children in this country are receiving a check.” Another 500,000 people are receiving two SNAP payments, she added.\nREAD MORE: SNAP is back, but new cuts are starting immediately\nSpeaking on Newsmax’s “Rob Schmitt Tonight”, Rollins said the administration is serious about “clamping down” on fraud.\n“This is just data from those 29 mostly red states. Can you imagine when we get our hands on the blue state data what we’re going to find?” she said.\nA massive reapplication process would “give us a platform and a trajectory to fundamentally rebuild this program, have everyone reapply for their benefit, make sure that everyone that’s taking a taxpayer-funded benefit through SNAP or food stamps, that they literally are vulnerable, and they can’t survive without it.”\n“The president has made this a priority. We will fix this program,” she said.",
        "authors": "None",
        "publish_date": "2025-11-16 23:36:42",
        "published_at_raw": "2025-11-16T23:36:42Z",
        "meta_site_name": "AL.com",
        "description": "Agriculture Secretary Brooke Rollins said the move is an effort to weed out alleged fraud.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:27",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "bcb962429c664ee8876b90fb52d44be8",
        "title": "USDA chief says 'everyone' will have to reapply for SNAP benefits after claiming rampant fraud",
        "doc_url": "https://nypost.com/2025/11/16/us-news/usda-chief-says-everyone-will-have-to-reapply-for-snap-benefits-after-claiming-rampant-fraud/",
        "all_text": "The head of the US Department of Agriculture said the Trump administration is planning to have “everyone” receiving SNAP benefits reapply after a probe into a bulk of Republican-led states allegedly found 186,000 cases of fraud.\nAgriculture Secretary Brooke Rollins alleged that fraud was running rampant around the embattled Supplemental Nutrition Assistance Program (SNAP), claiming “186,000 deceased men and women and children in this country are receiving a check” in 29 red states alone.\n“Can you imagine when we get our hands on the blue state data what we’re going to find?” she asked on Newsmax’s “Rob Schmitt Tonight.”\n“It’s going to give us a platform and a trajectory to fundamentally rebuild this program, have everyone reapply for their benefit, make sure that everyone that’s taking a taxpayer-funded benefit through SNAP or food stamps, that they literally are vulnerable, and they can’t survive without it,” Rollins added.\nThe agriculture secretary did not say when or how people would reapply for benefits. The USDA did not immediately respond to The Post’s request for comment.\nState SNAP administrators already require those receiving benefits to recertify their information as often as six months, with families expected to keep their income and personal information up to date.\nDespite the regular recertification process, Rollins alleged that the program was “corrupt,” adding that 120 Americans had been recently arrested for committing SNAP fraud, a reference to last week’s b",
        "authors": "None",
        "publish_date": "2025-11-16 22:14:47",
        "published_at_raw": "2025-11-16T22:14:47Z",
        "meta_site_name": "New York Post",
        "description": "The head of the US Department of Agriculture said the Trump administration is planning to have \"everyone\" receiving SNAP benefits reapply after a probe into a bulk of Republican-led states allegedly found 186,000 cases of fraud.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:27",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "3b38934a33790f335b10d0c82438dcae",
        "title": "China has only bought 332,000 tons of U.S. soybeans since Trump's deal with Xi that promised 12 million",
        "doc_url": "https://fortune.com/2025/11/16/china-us-soybean-purchases-trump-xi-jinping-trade-deal/",
        "all_text": "The USDA report released after the government reopened showed only two Chinese purchases of American soybeans since the summit in South Korea that totaled 332,000 metric tons. That’s well short of the 12 million metric tons that Agriculture Secretary Brooke Rollins said China agreed to purchase by January and nowhere near the 25 million metric tons she said they would buy in each of the next three years.\nAmerican farmers were hopeful that their biggest customer would resume buying their crops. But CoBank’s Tanner Ehmke, who is its lead economist for grains and oilseed, said there isn’t much incentive for China to buy from America right now because they have plenty of soybeans on hand that they have bought from Brazil and other South American countries this year, and the remaining tariffs ensure that U.S. soybeans remain more expensive than Brazilian beans.\n“We are still not even close to what has been advertised from the U.S. in terms of what the agreement would have been,” Ehmke said.\nBeijing has yet to confirm any detailed soybean purchase agreement but only that the two sides have reached “consensus” on expanding trade in farm products. Ehmke said that even if China did promise to buy American soybeans it may have only agreed to buy them if the price was attractive.\nTrump said his team spoke with Chinese officials today and they assured the White House they would be purchasing more soybeans, but he didn’t offer any details of how much.\n“They’re in the process of doing not ",
        "authors": "None",
        "publish_date": "2025-11-16 16:37:46",
        "published_at_raw": "2025-11-16T16:37:46Z",
        "meta_site_name": "Fortune",
        "description": "A USDA report released after the government reopened showed only two Chinese purchases of American soybeans since the summit in South Korea.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:27",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]