[
    {
        "id": "33134e517e09638b931380dee98aa7c7",
        "title": "Corn Falls Lower on Monday",
        "doc_url": "https://www.barchart.com/story/news/36819513/corn-falls-lower-on-monday",
        "all_text": "Corn futures posted 7 to 8 cent losses on Monday, after seeing strength around last week holiday on thin trade. The CmdtyView national average Cash Corn price was down 6 ¾ cents at $3.99 ¾.\nExport Inspections data showed corn shipments at 1.301 MMT (51.2 mbu) shipped in the week that ended on Christmas day. That was a drop of 25.53% from the week prior, which is normal due to the holiday, but and up 43.37% from same week last year. Mexico was the top destination of 400,140 MT, with 221,240 MT to Colombia and 219,137 MT to Japan. Marketing year shipments have totaled 25.57 MMT (1.006 bbu), a 66.17% hike yr/yr and the first time on record shipping more than 1 bbu before year end (starting September 1).\nEIA data released Monday afternoon showed ethanol production slipping 36,000 barrels to 1.095 million barrels per day in week ending 12/19. Ethanol stocks were up 175,000 barrels on that week to 22.528 million barrels. Exports were up 28,000 bpd to 219,000 bpd, with refiner inputs of ethanol up 6,000 bpd to 912,000 bpd.\nMar 26 Corn closed at $4.42 1/4, down 7 3/4 cents,\nNearby Cash was $3.99 3/4, down 6 3/4 cents,\nMay 26 Corn closed at $4.50 3/4, down 7 1/2 cents,\nJul 26 Corn closed at $4.57, down 7 1/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-29 23:21:53",
        "published_at_raw": "2025-12-29T23:21:53Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures posted 7 to 8 cent losses on Monday, after seeing strength around last week holiday on thin trade. The CmdtyView national average Cash Corn price was down 6 ¾ cents at $3.99 ¾. Export Inspections data showed corn shipments at 1.301 MMT...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "dabffc603a288f2bf3d1fb042dcf39e5",
        "title": "Corn slumps with focus on China grain reserves",
        "doc_url": "https://financialpost.com/commodities/corn-slumps-most-in-a-month",
        "all_text": "Article content\nCorn’s biggest intraday losses in over a month paced declines in grain futures Monday as traders sought demand signals to break markets out of their holiday doldrums.\nTHIS CONTENT IS RESERVED FOR SUBSCRIBERS ONLY\nSubscribe now to read the latest news in your city and across Canada.\nExclusive articles from Barbara Shecter, Joe O'Connor, Gabriel Friedman, and others.\nDaily content from Financial Times, the world's leading global business publication.\nUnlimited online access to read articles from Financial Post, National Post and 15 news sites across Canada with one account.\nNational Post ePaper, an electronic replica of the print edition to view on any device, share and comment on.\nDaily puzzles, including the New York Times Crossword.\nSUBSCRIBE TO UNLOCK MORE ARTICLES\nSubscribe now to read the latest news in your city and across Canada.\nExclusive articles from Barbara Shecter, Joe O'Connor, Gabriel Friedman and others.\nDaily content from Financial Times, the world's leading global business publication.\nUnlimited online access to read articles from Financial Post, National Post and 15 news sites across Canada with one account.\nNational Post ePaper, an electronic replica of the print edition to view on any device, share and comment on.\nDaily puzzles, including the New York Times Crossword.\nREGISTER / SIGN IN TO UNLOCK MORE ARTICLES\nCreate an account or sign in to continue with your reading experience.\nAccess articles from across Canada with one account.\nShare you",
        "authors": "None",
        "publish_date": "2025-12-29 20:49:38",
        "published_at_raw": "2025-12-29T20:49:38Z",
        "meta_site_name": "Financial Post",
        "description": "Corn’s biggest intraday losses in over a month paced declines in grain futures Monday as traders sought demand signals. Read more here",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8b741d9869650822948de91f29463020",
        "title": "Corn Starting the Final Week of 2025 with Weakness",
        "doc_url": "https://www.barchart.com/story/news/36812687/corn-starting-the-final-week-of-2025-with-weakness",
        "all_text": "Corn price action is down 2 to 3 cents early in Monday. Futures closed the Friday session with contracts fractionally to a penny lower in the nearbys. Open interest rose 4,880 contracts. March corn was up 6 ¼ cents on the short week. The CmdtyView national average Cash Corn price was down a penny to $4.06 3/4.\nFutures got some spillover weakness from crude oil losses of $1.45/barrel. Thin trade for the shorter session after Christmas likely also had an impact. Crude oil is up $1.40/barrel this morning, though there is little spillover to speak of with corns weakness.\nReports from the government were pushed back due to the holiday declared for Friday. EIA will be released on later this morning, delayed from the normal Wednesday release, with the next Export Sales report for the week ending on 12/18 out on Wednesday.\nMar 26 Corn closed at $4.50, down 1 cent, currently down 2 3/4 cents\nNearby Cash was $4.06 3/4, down 1 cent,\nMay 26 Corn closed at $4.58 1/4, down 3/4 cent, currently down 2 1/2 cents\nJul 26 Corn closed at $4.64 1/4, down 1/4 cent, currently down 2 1/4 cents",
        "authors": "None",
        "publish_date": "2025-12-29 13:40:10",
        "published_at_raw": "2025-12-29T13:40:10Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is down 2 to 3 cents early in Monday. Futures closed the Friday session with contracts fractionally to a penny lower in the nearbys. Open interest rose 4,880 contracts. March corn was up 6 ¼ cents on the short week. The CmdtyView na...",
        "key_word": "corn AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:11",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b2ea56a94875e33dcb27b94cd55dc3f1",
        "title": "Volatile Biofuels Demand Is Reshaping the Price Relationship between Soybean and Palm Oils",
        "doc_url": "https://www.agriculture.com/partners-volatile-biofuels-demand-is-reshaping-the-price-relationship-between-soybean-and-palm-oils-11876832",
        "all_text": "By Yu-Chi Wang and Joe Janzen\nNote: This article was written by University of Illinois Agricultural and Consumer Economics M.S. student Yu-Chi Wang and edited by Joe Janzen. It is one of several excellent articles written by graduate students in Prof. Janzen’s ACE 527 class in advanced agricultural price analysis this fall.\nSoybean oil and palm oil are the two most widely available vegetable oils in the world and are substitutes in many products, including as feedstocks in the production of biofuels. For many years, soybean oil and palm oil prices moved together, but since 2020, the close co-movement between soybean oil and palm oil prices has weakened. Prices now diverge more often and for longer periods. This change suggests that the types of supply and demand shocks hitting these markets has shifted. We suggest these shocks are becoming less global and more regional or national; aggregate vegetable oil supply and demand still matter, but these now interact with region-specific disruptions, particularly those related to biofuels policy, that affect one oil more than the other.\nThe goal of this article is to document how the price relationship between soybean oil and palm oil has changed and what this change means for future price dynamics. We first describe the global roles of soybean and palm oils and the different production systems behind them. We use monthly and daily prices to show how their historical co-movement has broken down since 2020. We then draw on several rec",
        "authors": "None",
        "publish_date": "2025-12-29 13:57:19",
        "published_at_raw": "2025-12-29T13:57:19Z",
        "meta_site_name": "Successful Farming",
        "description": "The goal of this article is to document how the price relationship between soybean oil and palm oil has changed and what this change means for future price dynamics.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:45",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8313f081903603af967bf79654806d4d",
        "title": "Hogs Post Steady Trade on Monday",
        "doc_url": "https://www.barchart.com/story/news/36819553/hogs-post-steady-trade-on-monday",
        "all_text": "Lean hog futures saw mixed Monday action with nearby contracts within a dime of unchanged. USDA’s national base hog price was not reported on Monday afternoon due to light volume. The CME Lean Hog Index was back up 13 cents on December 24 at $83.84.\nUSDA’s pork carcass cutout value from the Monday PM report was back down $1.75 at $95.96 per cwt. The butt was the only primals reported higher. USDA estimated federally inspected hog slaughter for Monday at 444,000 head. That was 52,000 head below last week and down 41,060 head from the same week last year.\nFeb 26 Hogs closed at $84.475, down $0.050,\nApr 26 Hogs closed at $89.400, down $0.075\nMay 26 Hogs closed at $93.450, up $0.025,",
        "authors": "None",
        "publish_date": "2025-12-29 23:21:53",
        "published_at_raw": "2025-12-29T23:21:53Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures saw mixed Monday action with nearby contracts within a dime of unchanged. USDA’s national base hog price was not reported on Monday afternoon due to light volume. The CME Lean Hog Index was back up 13 cents on December 24 at $83.84....",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "f5c604061f720df682c69c3f1d0b5b9d",
        "title": "Hogs Higher at Monday’s Midday",
        "doc_url": "https://www.barchart.com/story/news/36816202/hogs-higher-at-mondays-midday",
        "all_text": "Lean hog futures are showing slight 5 to 17 cent gains so far on Monday. USDA’s national base hog price was not reported on Monday morning. The CME Lean Hog Index was back up 13 cents on December 24 at $83.84.\nUSDA’s pork carcass cutout value from the Monday AM report was back down $2 at $95.71 per cwt. The loin and ham were the primals reported higher, with belly back down $13.93. USDA estimated federally inspected hog slaughter for last week at 1.978 million head. That was well below last week and down 85,628 head from the same week last year.\nFeb 26 Hogs are at $84.575, up $0.050,\nApr 26 Hogs are at $89.625, up $0.150\nMay 26 Hogs are at $93.600, up $0.175,",
        "authors": "None",
        "publish_date": "2025-12-29 18:05:40",
        "published_at_raw": "2025-12-29T18:05:40Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are showing slight 5 to 17 cent gains so far on Monday. USDA’s national base hog price was not reported on Monday morning. The CME Lean Hog Index was back up 13 cents on December 24 at $83.84. USDA’s pork carcass cutout value from t...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "be58ea8bb01d981ce43a71c100108c32",
        "title": "USDA Seeing Advice on Foreign Farmland Reporting Standards",
        "doc_url": "https://www.agriculture.com/partners-usda-seeing-advice-on-foreign-farmland-reporting-standards-11876842",
        "all_text": "The Agriculture Department is seeking public comment on ways to tighten reporting of foreign ownership of agricultural land, including proposed actions that may require congressional approval.\nAn advanced notice of proposed rulemaking scheduled to be published on Monday in the Federal Register cites a Government Accountability Office report released in 2024 that offered recommendations for improving the enforcement of the Agricultural Foreign Investment Disclosure Act, or AFIDA.\n“USDA seeks input on regulatory or other changes that may improve the efficiency and effectiveness of its AFIDA reporting and filing requirements,” the department says in the 10-page notice.\n“USDA is interested in comments on topics including the interests in agricultural land covered under AFIDA, identification of required filers, and the information included on the filed report. USDA is receptive to suggested changes that could be made within the current statutory authority as well as changes that may require new or revised statutory authority.”\nThe GAO report found that USDA staff had failed to “sufficiently verify” the accuracy of foreign land ownership data and were slow to share data with the Committee on Foreign Investment in the United States, which oversees foreign acquisitions of assets considered important to U.S. security.\nAFIDA, which was enacted in 1978, requires foreign investors to file documentation with USDA detailing land acquisitions and dispositions or incur a late fee worth 0.1% ",
        "authors": "None",
        "publish_date": "2025-12-29 14:28:27",
        "published_at_raw": "2025-12-29T14:28:27Z",
        "meta_site_name": "Successful Farming",
        "description": "The Agriculture Department is seeking public comment on ways to tighten reporting of foreign ownership of agricultural land, including proposed actions that may require congressional approval.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "8c9d9accc7daec7442d5ec2d4979e080",
        "title": "Hogs Fall to Weakness on Friday",
        "doc_url": "https://www.barchart.com/story/news/36812729/hogs-fall-to-weakness-on-friday",
        "all_text": "Lean hog futures extended the pullback from Wednesday with losses of 20 to 55 cents across the front months, with February up just a tick last week. Open interest was up 808 contracts on Friday. USDA’s national base hog price was reported at $67.19 on Friday afternoon. The CME Lean Hog Index was back down a penny on December 23 at $83.71.\nUSDA’s pork carcass cutout value from the Friday PM report was back up $4.05 at $97.71 per cwt. The loin, butt, and picnic were the primals reported lower, with belly back up $23.44. USDA estimated federally inspected hog slaughter for last week was tallied at 1.978 million head. That was well below last week and down 85,628 head from the same week last year.\nFeb 26 Hogs closed at $84.525, down $0.525,\nApr 26 Hogs closed at $89.475, down $0.325\nMay 26 Hogs closed at $93.425, down $0.225,",
        "authors": "None",
        "publish_date": "2025-12-29 13:40:10",
        "published_at_raw": "2025-12-29T13:40:10Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures extended the pullback from Wednesday with losses of 20 to 55 cents across the front months, with February up just a tick last week. Open interest was up 808 contracts on Friday. USDA’s national base hog price was reported at $67.19 o...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:10",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]