[
    {
        "id": "5f0f37c8159488c9c04d56defc505b1e",
        "title": "Corn Weighted Down on Tuesday",
        "doc_url": "https://www.barchart.com/story/news/36657415/corn-weighted-down-on-tuesday",
        "all_text": "Corn futures closed out the Tuesday session with most contracts 2 to 3 ¼ cents lower at the final bell. The CmdtyView national average Cash Corn price was down 3 1/4 cents to $3.92 3/4.\nThere was some outside pressure, with losses in wheat adding spillover weakness and crude oil dropping $1.61/barrel.\nEIA data will be released on Wednesday with some expecting ethanol production to be steady to slightly lower than last week.\nMar 26 Corn closed at $4.36 1/2, down 3 1/4 cents,\nNearby Cash was $3.92 3/4, down 3 1/4 cents,\nMay 26 Corn closed at $4.44 1/2, down 3 1/4 cents,\nJul 26 Corn closed at $4.51, down 2 3/4 cents,",
        "authors": "None",
        "publish_date": "2025-12-16 23:08:57",
        "published_at_raw": "2025-12-16T23:08:57Z",
        "meta_site_name": "Barchart",
        "description": "Corn futures closed out the Tuesday session with most contracts 2 to 3 ¼ cents lower at the final bell. The CmdtyView national average Cash Corn price was down 3 1/4 cents to $3.92 3/4. There was some outside pressure, with losses in wheat adding sp...",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "07063b7b048f3826e9b5c5c24be3af09",
        "title": "Corn Starting Tuesday with Weakness",
        "doc_url": "https://www.barchart.com/story/news/36644927/corn-starting-tuesday-with-weakness",
        "all_text": "Corn price action is down 1 to 1 ½ cents on Tuesday morning. Futures saw weakness for much of Monday, with contracts down 1 to 2 cents in the nearbys, pulling off early lows. Preliminary open interest was up 8,625 contracts on Monday. The CmdtyView national average Cash Corn price was down a penny to $3.95.\nUSDA tallied corn export shipments at 1.589 MMT (62.32 mbu) during the week ending on December 11. That was 9.07% below the week prior’s revised total and 37.25% larger than the same week in 2024. Mexico was the top destination of 488,231 MT, with 301,240 MT headed to Japan and 219,729 MT to Spain. Marketing year exports for 2025/26 are now 22.501 MMT (885.84 mbu) since September 1, which is now 68.74% larger than the same period last year. USDA also reported 71,917 MT of sorghum to China.\nExport Sales data got another catchup on Monday, with a total of 1.84 MMT of corn booked in the week of 11/20. That was a drop from the week prior, but still 73.4% larger than the same week last year.\nAnother update to the backlogged CFTC data on Monday afternoon showed managed money flipping back to a net short of 10,872 contracts in the week ending on November 25 a move of 48,999 contracts to the short side.\nMar 26 Corn closed at $4.39 3/4, down 1 cent, currently down 1 1/4 cents\nNearby Cash was $3.95, down 1 cent,\nMay 26 Corn closed at $4.47 3/4, down 1 1/4 cents, currently down 1 1/2 cents\nJul 26 Corn closed at $4.53 3/4, down 1 1/4 cents, currently down 1 1/4 cents",
        "authors": "None",
        "publish_date": "2025-12-16 13:29:59",
        "published_at_raw": "2025-12-16T13:29:59Z",
        "meta_site_name": "Barchart",
        "description": "Corn price action is down 1 to 1 ½ cents on Tuesday morning. Futures saw weakness for much of Monday, with contracts down 1 to 2 cents in the nearbys, pulling off early lows. Preliminary open interest was up 8,625 contracts on Monday. The CmdtyView n...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:38:12",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "18fee34408d4f2d4d8153d89e224ad7b",
        "title": "Wheat Futures Tumble on Softer Supply-Demand View -- Daily Grain Highlights",
        "doc_url": "https://www.marketscreener.com/news/wheat-futures-tumble-on-softer-supply-demand-view-daily-grain-highlights-ce7d50dede88f622",
        "all_text": "By Kirk Maltais\n--Wheat for March delivery fell 2.3% to $5.09 1/2 a bushel on the Chicago Board of Trade Tuesday, as analysts see supply of wheat and other grains growing globally on supportive weather conditions.\n--Corn for March delivery fell 0.9% to $4.36 1/4 a bushel.\n--Soybeans for January delivery fell 0.8% to $10.63 1/2 a bushel.\nHIGHLIGHTS\nSofter Outlook: The outlook for the grains complex heading into 2026 is turning towards higher supply combined with lower U.S. export demand. This sentiment is being seen across the row crop complex, but it seems especially true for wheat. \"There is a fundamental case for being short as global supply is busting,\" said Charlie Sernatinger of Marex in a note, in reference to wheat.\nTurning on the Water: Row crops in Brazil are benefiting from an influx of rainfall moving through the country's growing areas, said Michael Cordonnier of Soybean & Corn Advisor. \"Rainfall last week and over the weekend in Brazil became much more regular, favoring crop development and the planting of the remaining soybeans,\" said Cordonnier, also noting that heavier rainfall is expected this week as well. This is even true of Rio Grande do Sul, a southern Brazilian state that has been especially dry and experiencing planting slowdowns as a result. The improving outlook for Brazil added to the pressure felt on grain futures.\nINSIGHT\nTime Capsule: CFTC Commitment of Traders reports are still roughly three weeks behind, but recent ones show that fund traders i",
        "authors": "None",
        "publish_date": "2025-12-16 20:08:15",
        "published_at_raw": "2025-12-16T20:08:15Z",
        "meta_site_name": "MarketScreener",
        "description": "By Kirk Maltais\n--Wheat for March delivery fell 2.3% to $5.09 1/2 a bushel on the Chicago Board of Trade Tuesday, as analysts see supply of wheat and other grains growing globally on supportive...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "278a260966ba5c07bc65dd9b6ddf87af",
        "title": "Wheat Slips Further on Global Supply Pressure, Ukraine Ceasefire Talks",
        "doc_url": "https://www.agriculture.com/partners-wheat-slips-further-on-global-supply-pressure-ukraine-ceasefire-talks-11870138",
        "all_text": "By Peter Hobson and Gus Trompiz\nCANBERRA/PARIS, Dec. 16 (Reuters) - Chicago wheat futures extended losses on Tuesday, hovering near their lowest level since late October, as bumper harvests in Argentina and Australia and rising expectations of a ceasefire in Ukraine reinforced supply pressure.\nCorn futures also eased, weighed down by competition from wheat for livestock feed demand.\nSoybeans steadied after hitting seven-week lows on Monday due to concerns about U.S. export demand and expectations for a bumper harvest in Brazil.\nThe most-active wheat contract on the Chicago Board of Trade (CBOT) was down 0.6% at $5.17-1/2 a bushel at 1110 GMT, after touching its lowest since October 24 at $5.15-3/4.\n\"Global wheat prices remain under pressure due to Southern Hemisphere harvests and rising production estimates,\" said Commonwealth Bank analyst Dennis Voznesenski.\nThe Rosario Grains Exchange last week raised its production estimate for Argentina to 27.7 million metric tons from 24.5 million tons, while Australia is on track for its third-biggest harvest.\nTheir crops round out a year of large harvests across major producing nations, and there is no sign yet of major production setbacks in 2026.\n\"Sentiment was further weighed (down) by rising hopes of an end to Russia's war in Ukraine,\" commodity data firm CM Navigator said of wheat.\nThe United States has offered to provide NATO-style security guarantees for Kyiv as U.S. and European negotiators reported progress in talks on Monday,",
        "authors": "None",
        "publish_date": "2025-12-16 15:55:08",
        "published_at_raw": "2025-12-16T15:55:08Z",
        "meta_site_name": "Successful Farming",
        "description": "Chicago wheat futures extended losses on Tuesday, hovering near their lowest level since late October, as bumper harvests in Argentina and Australia and rising expectations of a ceasefire in Ukraine reinforced supply pressure.",
        "key_word": "soybean AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "cccf545c77c76a710f7e693962805236",
        "title": "Iraq's dreams of wheat independence dashed by water crisis",
        "doc_url": "https://www.al-monitor.com/originals/2025/12/iraqs-dreams-wheat-independence-dashed-water-crisis",
        "all_text": "NAJAF, Iraq, Dec 16 (Reuters) - Iraqi wheat farmer Ma'an al-Fatlawi has long depended on the nearby Euphrates River to feed his fields near the city of Najaf. But this ​year, those waters, which made the Fertile Crescent a cradle of ancient civilisation 10,000 years ​ago, are drying up, and he sees few options.\n\"Drilling wells is not successful in our land, because the water is saline,\" al-Fatlawi said, as he stood by an irrigation canal near his parched fields ⁠awaiting the release of his allotted water supply.\nA push by Iraq - historically among the Middle East's biggest wheat importers - to guarantee food security by ensuring wheat production covers the country's needs has led to three successive annual surpluses of the staple grain.\nBut those hard-won advances are now under threat as the driest year in modern history and record-low ​water levels in the Tigris and Euphrates rivers have reduced planting and could slash the harvest by up to 50% this season.\n\"Iraq is facing one ‍of the most severe droughts that has been observed in decades,\" the ​U.N. Food and Agriculture Organization's Iraq representative Salah El Hajj Hassan told Reuters.\nVULNERABLE TO NATURE AND NEIGHBOURS\nThe crisis is laying bare Iraq's vulnerability.\nA largely desert nation, Iraq ranks fifth globally for climate risk, according to the U.N.'s Global Environment Outlook. Average temperatures in Iraq have risen nearly half a degree Celsius per decade since 2000 and could climb by up to 5.6 C by the end of ",
        "authors": "None",
        "publish_date": "2025-12-16 08:10:55",
        "published_at_raw": "2025-12-16T08:10:55Z",
        "meta_site_name": "Al-Monitor",
        "description": "NAJAF, Iraq, Dec 16 (Reuters) - Iraqi wheat farmer Ma'an al-Fatlawi has long depended on the nearby Euphrates River to feed his fields near the city of Najaf. But this ​year, those waters, which made the Fertile Crescent a cradle of ancient civilisation 10,000 years ​ago, are drying up, and he sees few options.\"Drilling wells is not successful in our land, because the water is saline,\" al-Fatlawi said, as he stood by an irrigation canal near his parched fields ⁠awaiting the release of his allotted water supply.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "242f2bc13bd4b63e8b6266795d8b47c4",
        "title": "Hogs Post Gains on Turnaround Tuesday",
        "doc_url": "https://www.barchart.com/story/news/36657459/hogs-post-gains-on-turnaround-tuesday",
        "all_text": "Lean hog futures reversed higher from the Monday weakness, with Tuesday gains of 75 cents to $1 higher. USDA’s national base hog price was down $3.12 in the Tuesday afternoon report at $69.56. The CME Lean Hog Index was up 19 cents on December 12 at $82.99.\nUSDA’s pork carcass cutout value from the Tuesday PM report was 33 cents lower to $98.56 per cwt. The rib and ham primals were the only reported higher. USDA estimated federally inspected hog slaughter for Tuesday at 494,000 head, with the weekly total at 973,000. That was 8,000 head below last week after a revision to Monday and 1,175 head shy of the same week last year.\nFeb 26 Hogs closed at $84.775, up $0.925,\nApr 26 Hogs closed at $89.700, up $0.775\nMay 26 Hogs closed at $93.375, up $0.875,",
        "authors": "None",
        "publish_date": "2025-12-16 23:08:57",
        "published_at_raw": "2025-12-16T23:08:57Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures reversed higher from the Monday weakness, with Tuesday gains of 75 cents to $1 higher. USDA’s national base hog price was down $3.12 in the Tuesday afternoon report at $69.56. The CME Lean Hog Index was up 19 cents on December 12 at...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "c0489a97747abfca39fabd2232f4a346",
        "title": "Laird Superfood® Updates Popular Liquid Creamer Line with USDA Certified Organic Ingredients, Introduces Caramel",
        "doc_url": "https://www.marketscreener.com/news/laird-superfood-updates-popular-liquid-creamer-line-with-usda-certified-organic-ingredients-introd-ce7d50dede89f322",
        "all_text": "The Ultra-Clean Coffee Creamer Now Comes in Packaging Made from Post-Consumer Recycled Materials\nBOULDER, Colo., Dec. 16, 2025 /PRNewswire/ -- Laird Superfood®, Inc. (NYSE: LSF), a leader in functional coffee, creamers, and superfood products made with simple, minimally processed ingredients, has updated its liquid creamer line to be made of USDA Certified Organic ingredients such as organic coconut milk and organic vanilla extract. Laird Superfood Creamer with Lion's Mane, sold in the refrigerated section of grocery stores nationwide, delivers real-food ingredients and flavor without any unnecessary additives such as the \"natural\" flavors, seed oils, or artificial sweeteners found in many coffee creamers.\n\"We believe this is now the cleanest creamer available on the market. It's now an organic formula with adaptogens and MCTs, and we don't add anything artificial – ever,\" said Jason Vieth, CEO of Laird Superfood. \"We're proud of our new liquid creamer, the result of uncompromising nutritional guardrails and a commitment to innovation that really delivers to our customers. They love having adaptogenic benefits in their daily coffee,\" he said. \"Laird Superfood is also easy to find in various aisles of the grocery store, with the liquid creamers in the refrigerated section, helpful for consumers and retailers alike.\"\nLaird Superfood Creamer with Lion's Mane brings a rich creaminess to beverages and the benefits of lion's mane functional mushrooms to the brain. This is the brand",
        "authors": "None",
        "publish_date": "2025-12-16 19:58:08",
        "published_at_raw": "2025-12-16T19:58:08Z",
        "meta_site_name": "MarketScreener",
        "description": "The Ultra-Clean Coffee Creamer Now Comes in Packaging Made from Post-Consumer Recycled Materials BOULDER, Colo., Dec. 16, 2025 /PRNewswire/ -- Laird Superfood®, Inc. , a leader in functional coffee,...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "a0af9b17bef3d831461f33e7eb858788",
        "title": "USDA Must Give States More Time To Implement Food Stamp Restrictions: Judge",
        "doc_url": "https://www.zerohedge.com/political/usda-must-give-states-more-time-implement-food-stamp-restrictions-judge",
        "all_text": "Authored by Zachary Stieber via The Epoch Times (emphasis ours),\nThe U.S. Department of Agriculture (USDA) must extend a deadline for states to implement new immigration-related eligibility restrictions on food stamps, a federal judge ruled on Dec. 15.\nU.S. District Judge Mustafa Kasubhai, during a hearing in Eugene, Oregon, issued an injunction requiring the USDA to extend the expiration date of a grace period for the states to comply with the new restrictions on Supplemental Nutrition Assistance Program (SNAP) benefits.\nThe deadline was Nov. 1. It is now April 9, 2026. A written order has not been released yet.\nUnder the One Big Beautiful Bill Act, signed by President Donald Trump over the summer, states had to stop letting certain immigrants, including those with deportation hold orders and refugees who are not legal residents, receive food stamps from SNAP, the USDA said in an Oct. 31 memorandum.\nThe USDA also stated at the time that lawful permanent residents, or green card holders, would only be eligible for SNAP after a 5-year waiting period.\nTwenty-one states and the District of Columbia sued over the guidance. They said that the guidance wrongly required a waiting period for all green card holders, even though another federal law allows a variety of permanent residents, including people who are blind or disabled, to receive SNAP without a waiting period.\nKasubhai said on Dec. 15 that the guidance contributed to “confusion” that impeded states’ ability to implement th",
        "authors": "None",
        "publish_date": "2025-12-16 19:45:00",
        "published_at_raw": "2025-12-16T19:45:00Z",
        "meta_site_name": "ZeroHedge",
        "description": "ZeroHedge - On a long enough timeline, the survival rate for everyone drops to zero",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "b5b388f48c9439b7549277f704cd18ff",
        "title": "Hogs Posting Turnaround Tuesday Gains",
        "doc_url": "https://www.barchart.com/story/news/36651634/hogs-posting-turnaround-tuesday-gains",
        "all_text": "Lean hog futures are trading with 75 to 90 cent gains in the nearbys on Tuesday. USDA’s national base hog price was down $3.09 in the Tuesday morning report at $69.91. The CME Lean Hog Index was up 19 cents on December 12 at $82.99.\nCommitment of Traders data for November 25 showed managed money cutting back another 7,795 contracts from their net long in lean hog futures and options, to a net long of 50,193 contracts.\nUSDA’s pork carcass cutout value from the Monday PM report was 47 cents lower to $98.42 per cwt. The rib and ham primals were the only reported higher. USDA estimated federally inspected hog slaughter for Monday at 496,000 head. That was 8,000 head above last Monday and 9,327 head above the same Monday last year.\nFeb 26 Hogs are at $84.600, up $0.750,\nApr 26 Hogs are at $89.700, up $0.775\nMay 26 Hogs is at $93.375, up $0.875,",
        "authors": "None",
        "publish_date": "2025-12-16 18:13:10",
        "published_at_raw": "2025-12-16T18:13:10Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures are trading with 75 to 90 cent gains in the nearbys on Tuesday. USDA’s national base hog price was down $3.09 in the Tuesday morning report at $69.91. The CME Lean Hog Index was up 19 cents on December 12 at $82.99. Commitment of Tr...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "df699f67baa33700c898306961c332cc",
        "title": "Hogs Start the Week with Losses",
        "doc_url": "https://www.barchart.com/story/news/36645001/hogs-start-the-week-with-losses",
        "all_text": "Lean hog futures close the Monday session with losses of 40 to 67 cents, as contracts pulled off their early lows. Open intertest suggested long liquidation, dropping 2,618 contracts. USDA’s national base hog price was up $1.40 in the Monday afternoon report at $72.68. The CME Lean Hog Index was up 23 cents on December 11 at $82.80.\nExport Sales data showed a total of 44,900 MT of pork sold for 2025 on Monday morning, with 11,880 MT for 2026. Combined sales were a calendar year high. Shipments were 31,220 MT, a 3-week low.\nCommitment of Traders data for November 25 showed managed money cutting back another 7,795 contracts from their net long in lean hog futures and options, to a net long of 50,193 contracts.\nUSDA’s pork carcass cutout value from the Monday PM report was 68 cents higher to $98.89 per cwt. The picnic primal was the only reported lower. USDA estimated federally inspected hog slaughter for Monday at 496,000 head. That was 8,000 head above last Monday and 9,327 head above the same Monday last year.\nFeb 26 Hogs closed at $83.850, down $0.675,\nApr 26 Hogs closed at $88.925, down $0.600\nMay 26 Hogs closed at $92.500, down $0.400,",
        "authors": "None",
        "publish_date": "2025-12-16 13:30:00",
        "published_at_raw": "2025-12-16T13:30:00Z",
        "meta_site_name": "Barchart",
        "description": "Lean hog futures close the Monday session with losses of 40 to 67 cents, as contracts pulled off their early lows. Open intertest suggested long liquidation, dropping 2,618 contracts. USDA’s national base hog price was up $1.40 in the Monday afternoo...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:13",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]