[
    {
        "id": "612001527665316c9fc094d4791532fe",
        "title": "USDA will deploy undercover investigators to enforce new SNAP purchase restrictions",
        "doc_url": "https://www.naturalnews.com/2026-01-04-usda-undercover-investigators-enforce-snap-purchase-restrictions.html",
        "all_text": "The USDA will deploy undercover investigators to ensure retailers comply with new state-level restrictions on SNAP (food stamp) purchases.\nInvestigations will begin 90 days after restrictions take effect in each state, with inspectors attempting to buy prohibited items.\nRetailers that violate the rules will first receive a warning, but repeat offenses can lead to losing authorization to accept SNAP benefits.\nEighteen states have received waivers to restrict SNAP purchases – often targeting soda, energy drinks, candy and prepared desserts with rollouts beginning Jan. 1 and continuing through October.\nUSDA officials say the changes aim to improve nutrition and public health, requiring close coordination with retailers, while signaling that additional state waivers are likely in the future.\nUndercover investigators from the U.S. Department of Agriculture (USDA) will begin checking whether retailers are complying with new state-level restrictions on purchases made with food stamps, according to a notice the department sent to state and regional officials.\nIn a notice released by the USDA on Dec. 30, the department stated that the USDA's Office of Retailer Operations and Compliance, which oversees stores authorized to accept benefits from the Supplemental Nutrition Assistance Program (SNAP), will conduct undercover investigations to determine whether retailers are following program rules.\nOnce new SNAP restrictions take effect in a state, investigators will begin attempting to pur",
        "authors": "None",
        "publish_date": "2026-01-04 17:10:59",
        "published_at_raw": "2026-01-04T17:10:59Z",
        "meta_site_name": "Natural News",
        "description": "The USDA will deploy undercover investigators to ensure retailers comply with new state-level restrictions on SNAP (food stamp) purchases. Investigations will begin 90 days after restrictions take effect in each state, with inspectors attempting to buy prohibited items. Retailers that violate the rules will first receive a warning, but repeat offenses can lead to losing […]",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:06",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]