[
    {
        "id": "0f33aee3d690d1324b582c235b8243e9",
        "title": "Bolivia's Marraqueta Crisis: A Political and Economic Turning Point",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3712018-bolivias-marraqueta-crisis-a-political-and-economic-turning-point",
        "all_text": "Bolivia is grappling with a shortage of its iconic marraqueta bread roll, creating a significant challenge for newly elected President Rodrigo Paz. The scarcity is primarily driven by dwindling wheat supplies and escalating costs, placing pressure on bakers and causing frustration among consumers.\nThe price of the marraqueta has been fixed for 17 years under the previous socialist government, which heavily subsidized basic goods. However, bakers struggle with delays in government-imported flour and other shortages, making it difficult to meet production demands. Bolivia imports approximately three-quarters of its wheat, mainly from neighboring Argentina.\nFacing one of its worst economic crises in recent decades, Bolivia is navigating the consequences of years of state-led policies and nationalization under the previous leftist government. While President Paz has pledged to reform subsidies covering energy, transport, and essential goods, the path forward remains fraught with challenges and political risks.",
        "authors": "None",
        "publish_date": "2025-11-27 13:17:40",
        "published_at_raw": "2025-11-27T13:17:40Z",
        "meta_site_name": "Devdiscourse",
        "description": "Bolivia faces bread shortages and price hikes as newly elected President Rodrigo Paz navigates subsidy reform. The marraqueta bread roll shortage highlights political risks, consumer frustrations, and economic challenges, with bakers grappling with rising costs and wheat supply disruptions, crucially impacting Paz's plans to adjust Bolivia's socialist economic model.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "28026efd3c6e4218dacb685a968d0583",
        "title": "Bolivia's Bread Roll Crisis: A Political and Economic Challenge",
        "doc_url": "https://www.devdiscourse.com/article/headlines/3711996-bolivias-bread-roll-crisis-a-political-and-economic-challenge",
        "all_text": "Bolivia is grappling with a shortage of its beloved marraqueta bread rolls, posing an immediate challenge for the newly elected President Rodrigo Paz. The issue arises as dwindling wheat supplies and rising costs affect bakers, raising questions over Paz's strategy to reform Bolivia's economy by reducing heavy state subsidies without causing public discontent.\nThe country's reliance on imports, with about 75% of wheat coming from Argentina, exacerbates the bread shortage. Consumers are particularly frustrated, noting that marraqueta bread, traditionally sold for the equivalent of 8 U.S. cents, has decreased in size over recent years. Meanwhile, bakers struggle with delays in government-imported flour, driving some vendors to switch to more profitable alternatives or cease bread sales entirely.\nBolivia's predicament reflects years of state-led economic policies, deterring foreign investment and stretching public finances. President Paz, sworn in on November 8, aims to gradually eliminate subsidies covering essentials like energy and transport. However, the economic complexities and potential political fallout create a delicate balancing act for his administration.",
        "authors": "None",
        "publish_date": "2025-11-27 13:00:34",
        "published_at_raw": "2025-11-27T13:00:34Z",
        "meta_site_name": "Devdiscourse",
        "description": "Bolivia faces a shortage of state-subsidized marraqueta bread rolls, testing President Rodrigo Paz's efforts to reform the economy without upsetting accustomed citizens. Shortages stem from dwindling wheat supply and rising costs, highlighting political risks. The crisis underscores challenges in balancing state subsidies with reform initiatives.",
        "key_word": "wheat AND (price OR demand OR supply OR inventory)",
        "collected_at": "2026-02-04 15:39:07",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e6353140e49e78b6f8300b8c92373062",
        "title": "21 AGs Sue USDA Over SNAP Rule They Say Illegally Cuts Off Green Card Holders",
        "doc_url": "https://usaherald.com/21-ags-sue-usda-over-snap-rule-they-say-illegally-cuts-off-green-card-holders/",
        "all_text": "Twenty states and the District of Columbia launched a legal strike Wednesday against the U.S. Department of Agriculture, accusing the agency of unlawfully yanking food assistance from categories of lawful permanent residents in what they describe as an unprecedented and harmful policy shift.\nStates Challenge Sudden SNAP Restrictions\nThe coalition of attorneys general is seeking to overturn an Oct. 31 USDA memo that sharply narrowed eligibility for the Supplemental Nutrition Assistance Program (SNAP). The guidance blocks noncitizens who originally entered the U.S. as refugees, asylum seekers, or through other humanitarian pathways from receiving benefits—even after they obtain green cards.\nThat interpretation, the states argue, defies federal law, which has long provided that such immigrants become SNAP-eligible once they attain lawful permanent resident status.",
        "authors": "None",
        "publish_date": "2025-11-27 18:13:36",
        "published_at_raw": "2025-11-27T18:13:36Z",
        "meta_site_name": "USA Herald",
        "description": "Twenty states and the District of Columbia launched a legal strike Wednesday against the U.S. Department of Agriculture, accusing the agency of unlawfully yanking food assistance from categories of lawful permanent residents in what they describe as an unprecedented and harmful policy shift. States Challenge Sudden SNAP Restrictions The coalition of attorneys general is seeking 21 AGs Sue USDA over new SNAP guidance that strips benefits from lawful permanent residents.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "99dd87ece56e7f0a07ab5be5a40a3501",
        "title": "Turkey tryptophan myth debunked as real cause of drowsiness revealed",
        "doc_url": "https://www.foxnews.com/food-drink/does-turkey-make-you-sleepy-heres-truth-post-food-snooze",
        "all_text": "NEWYou can now listen to Fox News articles!\nAfter millions of Americans enjoy a hearty meal with family and friends on Thanksgiving, there's sure to be someone who starts to get drowsy.\nThe post-feast nap is often blamed on turkey, which contains tryptophan — an amino acid linked to sleepiness.\nThe truth, however, is that turkey isn't more or less sleep-inducing than chicken or beef. The real cause of the drowsy slump lies elsewhere.\nSTOP THE CARB OVERLOAD: EXPERTS EXPOSE HIDDEN REASON BIG MEALS BACKFIRE, HOW PROTEIN FLIPS THE SCRIPT\n\"Turkey contains the same amount of tryptophan as plenty of other meats,\" according to the American Council on Science and Health.\nThe U.S. Department of Agriculture's (USDA) FoodData Central data shows that roasted turkey breast lists tryptophan at 488 milligrams in a 170-gram serving — nearly identical to roasted chicken and far less than some cheeses or soy products.\nA GoodRx analysis, meanwhile, notes that a standard 3-ounce serving of turkey provides about 244 milligrams of tryptophan, meaning it falls far below the gram-level doses used in sleep research.\nEATING THESE COMMON FOODS BEFORE BED COULD TRIGGER SWEET DREAMS OR NIGHT TERRORS\nThe body's chemistry also undermines the myth.\nAs researchers have long documented, protein-rich meals flood the bloodstream with multiple large amino acids that compete for entry into the brain.\nTryptophan is just one of them, and it's not particularly dominant.\n6 CLASSIC THANKSGIVING SIDE DISHES THAT HAVE DI",
        "authors": "None",
        "publish_date": "2025-11-27 15:02:38",
        "published_at_raw": "2025-11-27T15:02:38Z",
        "meta_site_name": "Fox News",
        "description": "Turkey contains the same amount of tryptophan as other meats, debunking the Thanksgiving drowsiness myth, according to scientific research and USDA data.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "e4ab4603d427629bca951b9689f68c23",
        "title": "Lawsuit from MA, other states challenges USDA on SNAP guidance",
        "doc_url": "https://www.nbcboston.com/news/politics/new-lawsuit-from-mass-and-other-states-challenges-usda-on-snap-guidance/3851798/",
        "all_text": "On the day before Thanksgiving, Massachusetts Attorney General Andrea Joy Campbell filed another lawsuit over the delivery of federal food benefits for low-income families.\nCampbell and 21 other attorneys general filed in U.S. District Court in Oregon against the U.S. Department of Agriculture, alleging the agency has \"unlawfully\" cut off SNAP benefits to tens of thousands of residents and has threatened to impose financial penalties on states.\nThe attorneys general are seeking to block a guidance the USDA issued Oct. 31 that changes SNAP eligibility under the One Big Beautiful Bill Act. The federal policy narrowed eligibility for some non-citizen groups including refugees, asylum recipients and others admitted through humanitarian protection programs.\nHowever, the attorneys general say the USDA's guidance goes one step further. They say the guidance \"incorrectly\" states that anyone who entered the country through humanitarian protection programs would be permanently ineligible for SNAP, even after obtaining green cards and becoming lawful permanent residents.\nDuring a virtual press conference Wednesday afternoon, Campbell said she was \"absolutely frustrated and angered\" about the situation.\nThe attorneys general say the USDA guidance also misinterprets the agency's own law, which gives states a 120-day grace period to adjust and avoid facing financial penalties after new guidance is issued. But USDA said the grace period expired Nov. 1, just one day after the guidance was re",
        "authors": "None",
        "publish_date": "2025-11-27 03:49:58",
        "published_at_raw": "2025-11-27T03:49:58Z",
        "meta_site_name": "NBC10 Boston",
        "description": "Andrea Joy Campbell of Massachusetts was among 22 attorneys general to sue the Trump administration Wednesday, accusing it of \"unlawfully\" cutting off food...",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "0e01dfb57cf8489434ad617062f0ba4f",
        "title": "'They are idiots': Campbell’s executive allegedly mocked Indian staff in secret recording",
        "doc_url": "https://www.businesstoday.in/latest/trends/story/they-are-idiots-campbells-executive-allegedly-mocked-indian-staff-in-secret-recording-503891-2025-11-27",
        "all_text": "A senior Campbell’s executive allegedly made racist and offensive remarks about Indian employees and disparaged the company’s own food products during a secretly recorded meeting, according to a lawsuit filed by a former employee.\nRobert Garza, a former cybersecurity analyst at Campbell’s, claims he captured Vice President and Chief Information Security Officer Martin Bally on tape in November 2024 calling Indian colleagues “idiots” who “couldn’t think for their fking selves” during a technical issue. The lawsuit, filed this week, accuses Bally of using the slur “Fking Indians” during a salary discussion that veered into what Garza described as a tirade.\nThe recording also allegedly includes Bally criticizing Campbell’s products, calling them “highly processed,” and saying the company might use “bioengineered meat.” He reportedly claimed he avoided Campbell’s products himself, saying, “I’m not going to eat a piece of chicken that came from a 3D printer.”\nCampbell’s responded by calling the alleged remarks “unacceptable” if true, and stated they do not reflect the company’s values. It also firmly denied that its food contains anything other than USDA-approved ingredients and noted that Bally, as an IT executive, has no role in food production. The company confirmed Bally is on temporary leave pending an internal investigation.\nGarza alleges that after reporting the comments on January 10, he was abruptly fired on January 30 in what he claims was retaliation. He’s suing for dam",
        "authors": "None",
        "publish_date": "2025-11-27 03:00:36",
        "published_at_raw": "2025-11-27T03:00:36Z",
        "meta_site_name": "Business Today",
        "description": "Campbell’s responded by calling the alleged remarks “unacceptable” if true, and stated they do not reflect the company’s values. It also firmly denied that its food contains anything other than USDA-approved ingredients and noted that Bally, as an IT executive, has no role in food production.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:20",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "ce8488bd46625aa6ce1d1cf8a7e7ea14",
        "title": "Illinois sues USDA to block changes to SNAP eligibility of immigrants",
        "doc_url": "https://chicago.suntimes.com/immigration/2025/11/26/illinois-immigrant-snap-eligibility-lawsuit-raoul",
        "all_text": "Illinois is among a group of Democratic states suing the Trump administration, seeking to block a change to the federal food stamps program that the states say unlawfully prevented some legal immigrants from accessing the aid.\nKwame Raoul, Illinois’ top lawyer, and attorneys general from 20 other states and Washington, D.C., filed the lawsuit Wednesday in an Oregon federal court against the U.S. Department of Agriculture and its secretary, Brooke Rollins, asking the court to block the change’s implementation.\nState officials allege the USDA issued illegal guidance for the Supplemental Nutrition Assistance Program, which made some immigrants, including those who were admitted as refugees or granted asylum, ineligible for the food aid — even after they obtained permanent residency.\n“The SNAP program is the country’s most important anti-hunger program, providing access to food for millions of families while supporting local grocers and merchants who are critical to our state’s economy,” Raoul said in a statement. “The USDA’s new eligibility guidance violates the law and harms the state’s ability to provide vital services to residents in need.”\nThe filing comes after the attorneys general raised the issue in a letter to Rollins. Raoul said the USDA has not responded.\nThe USDA and Justice Department both declined to comment.\nIn the filing, the attorneys general argue that the guidance contradicts federal law and would impose high financial costs on the states, as they are now requ",
        "authors": "None",
        "publish_date": "2025-11-27 02:54:40",
        "published_at_raw": "2025-11-27T02:54:40Z",
        "meta_site_name": "Chicago Sun-Times",
        "description": "Illinois Attorney General Kwame Raoul joined a lawsuit challenging new federal guidance that makes some legal immigrants ineligible for food aid.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    },
    {
        "id": "835fcdf2f60688f333fdb3b1de481035",
        "title": "Oregon sues feds, saying USDA’s new SNAP guidance cuts legal immigrants",
        "doc_url": "https://www.oregonlive.com/politics/2025/11/oregon-sues-feds-saying-usdas-new-snap-guidance-cuts-legal-immigrants.html",
        "all_text": "Oregon is suing the Trump administration over changes to the nation’s food assistance program, arguing that new federal guidance unlawfully blocks certain groups of legal immigrants from accessing food aid.\nTwenty-one other states joined Oregon in filing the lawsuit Wednesday in federal court in Eugene, arguing that the U.S. Department of Agriculture overstepped its authority when it issued an Oct. 31 memo telling states to cut off benefits for people who have long been eligible for the Supplemental Nutrition Assistance Program, or SNAP.\nThe dispute centers on changes Congress made in July through the One Big Beautiful Bill Act, which limited SNAP eligibility for certain noncitizens in temporary immigration categories.\nIn the lawsuit, Oregon Attorney General Dan Rayfield and the other Democratic attorneys general said the USDA memo goes further than what Congress approved and effectively blocks many lawful permanent residents from the SNAP program even though they qualify under the law.\nThose include refugees, asylum seekers and people admitted under humanitarian programs once they obtain a green card and meet the program’s income and residency rules.\nThe lawsuit argues that the USDA’s memo ignores those distinctions and “arbitrarily exclud[es] many lawful permanent residents from SNAP” by treating humanitarian immigrants as permanently ineligible even after they become green card holders.\nUSDA officials declined to comment on the lawsuit.\nAt a news conference Wednesday, Rayf",
        "authors": "None",
        "publish_date": "2025-11-27 00:35:07",
        "published_at_raw": "2025-11-27T00:35:07Z",
        "meta_site_name": "The Oregonian",
        "description": "Democratic attorneys general in 22 states argue that changes to SNAP eligibility unlawfully cuts food aid to legal immigrants.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:22",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]