[
    {
        "id": "766c4671fe8b9ea0f283d417cbee14e4",
        "title": "USDA Launches New Online Portal to Track Foreign Ownership of U.S. Farmland",
        "doc_url": "https://www.agriculture.com/usda-launches-new-online-portal-to-track-foreign-ownership-of-u-s-farmland-11892079",
        "all_text": "USDA announced it is launching a new online portal to where transactions involving U.S. agriculture land by foreign persons can be reported. This can include businesses and governments, under the Agricultural Foreign Investment Discolosure Act of 1978 (AFIDA). The government said in a press release this portal is part of a broader effort to strengthen enforcement and protect American farmland as the department continues to implement their National Farm Security Action Plan.\n“This move to streamline the reporting portal will increase compliance and assist our efforts to effectively enforce accurate reporting of interests held by foreign adversaries in U.S. farmland,” said USDA Secretary Brooke Rollins. “The online portal will allow us to obtain verifiable information about foreign interests in American agricultural land and protect the security of our Farmers.”\nVisit afida.landmark.usda.gov to access the portal. Users will sign in using Login.gov, a service used to provide secure online access across a number of government programs.\nThe portal will gather the same information currently found on form FSA-153. A hard copy of the form may still be filed if preferred. However, filers should not use both the paper copy and online portal as this will create duplicate filings.",
        "authors": "None",
        "publish_date": "2026-01-25 14:19:19",
        "published_at_raw": "2026-01-25T14:19:19Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA announced it is launching a new online portal to where transactions involving U.S. agriculture land by foreign persons can be reported.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:57",
        "filter_status": "F",
        "named_entities": [],
        "triples": [],
        "article_embedding": null
    }
]