[
    {
        "id": "15188ee214bf4f044e96f539d5ee02dc",
        "title": "Larimer County bison herd helps shepherd purebred bison back to United States",
        "doc_url": "https://www.dailycamera.com/2025/12/07/larimer-county-herd-purebred-bison-back-us/",
        "all_text": "Centuries ago, herds of bison roamed the Great Plains, numbering in the tens of millions. One of the most populous mammal species in North America, enormous herds of the animals grazed and migrated across huge stretches of grasslands and provided one of the primary sources of food, hide and bone to countless Native American tribes throughout the region.\nBy the end of the 19th century, the American bison had declined to near extinction, in part due to killing by Americans intended to deprive Native people of their traditional source of sustenance in an effort to force them to reservations.\nThe species has rebounded since then — in part due to a thriving agricultural industry that raises bison as a beef alternative, but those animals have interbred with domestic cattle, becoming something of a distinct animal that bears less and less resemblance to the creatures that roamed the plains prior to the Civil War.\nYellowstone National Park was one of the only places in the United States where purebred — or at least the purest bison come these days — remained, but that small herd was relegated to their sanctuary because of a rampant case of brucellosis, a bacterial infection that affects livestock, wildlife and sometimes even humans.\nThat infection presented an obstacle to breeding or transferring bison from that herd.\nA decade ago, Colorado State University researchers, conservationists at the city of Fort Collins and Larimer County and the United States Department of Agriculture col",
        "authors": "None",
        "publish_date": "2025-12-07 14:05:53",
        "published_at_raw": "2025-12-07T14:05:53Z",
        "meta_site_name": "Boulder Daily Camera",
        "description": "Colorado State University researchers, conservationists at the city of Fort Collins and Larimer County and the United States Department of Agriculture collaborated to create a new bison herd, purebred and free of the affliction that ravaged their northern cousins.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:18",
        "filter_status": "T",
        "named_entities": [],
        "triples": [],
        "article_embedding": null,
        "fill_mode": "relaxed",
        "fill_reason": "min_per_keyword=2"
    }
]