[
    {
        "id": "dda770c8429ea1d09fa2363553f34cc6",
        "title": "Fordyce: Second Phase of Disaster Relief to Target Specialty Crop, Uninsured Growers",
        "doc_url": "https://www.agriculture.com/partners-fordyce-second-phase-of-disaster-relief-to-target-specialty-crop-uninsured-growers-11854864",
        "all_text": "The second phase of a disaster relief program approved by Congress last year will especially benefit specialty crop growers, according to USDA Undersecretary for Farm Production and Conservation Richard Fordyce.\nWhile the first phase of the Supplemental Disaster Relief Program focused on providing aid to insured producers for crop losses, the second phase will also allow assistance to non-insured producers or producers that saw \"shallow\" losses that did not trigger an indemnity, Fordyce said on Agri-Pulse Newsmakers. He believes a \"high percentage\" of phase two applicants will be specialty crop growers.\nUSDA announced the opening of SDRP phase two on Monday.\n\"It's going to be a help for folks that didn't get an indemnity,\" Fordyce said, noting that for specialty crop growers in particular, crop insurance products are often not available or don't work well.\nUSDA used 2023 and 2024 crop insurance data to help determine phase one assistance eligibility, which means it would have targeted insured producers. Phase two, on the other hand, will focus on losses that did not exceed producers' crop insurance deductibles.\nWhen asked about the status of a potential program to assist farmers with trade-related losses, Fordyce said conversations are \"ongoing.\"\nHe said Trump administration officials want to make sure it is \"reflective of what's actually happening in the marketplace,\" before rolling it out. He noted that on top of commodity prices, producers are also struggling with high inp",
        "authors": "None",
        "publish_date": "2025-11-22 10:00:00",
        "published_at_raw": "2025-11-22T10:00:00Z",
        "meta_site_name": "Successful Farming",
        "description": "The second phase of a disaster relief program approved by Congress last year will especially benefit specialty crop growers, according to USDA Undersecretary for Farm Production and Conservation Richard Fordyce.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "T",
        "named_entities": [
            "USDA",
            "Richard Fordyce",
            "Supplemental Disaster Relief Program",
            "Trump administration"
        ],
        "triples": [],
        "article_embedding": null,
        "fill_mode": "relaxed",
        "fill_reason": "min_per_keyword=2"
    },
    {
        "id": "2319ac53cdf478c7f7f79e2523f362fe",
        "title": "Ag Leaders Weigh in on Disaster Aid, Trade Deals, and Biofuel Policy",
        "doc_url": "https://www.agriculture.com/partners-ag-leaders-weigh-in-on-disaster-aid-trade-deals-and-biofuel-policy-11854908",
        "all_text": "The Agriculture Department will soon roll out the second stage of the Supplemental Disaster Relief Program. We asked Richard Fordyce, undersecretary of agriculture for farm production and conservation, about the program and when — or if — the trade aid payments previously teased by the administration will be announced.\nPlus, Joby Young outlines what’s included for agriculture in the deal lawmakers struck to reopen the government and Dan Halstrom with the U.S. Meat Export Federation discusses the impact of the U.S.-China trade deal for the meat industry. Emily Skor with Growth Energy also weighs in on the biofuel sector's continued push for year-round E15 and what she expects from the EPA’s Renewable Volume Obligations.\nWatch the Video\nWant to receive Newsmakers in your inbox every week? Sign up!\nRead the Transcript\nPlease note: This transcript has not been edited.\nLydia Johnson: Welcome to Agri-Pulse Newsmakers, where we aim to take you to the heart of ag policy. I'm your host, Lydia Johnson. We're bringing you a special edition of the show this week from the National Association of Farm Broadcasting annual convention in Kansas City. Hundreds of ag industry leaders gathered to share the latest updates on issues important to farm country like biofuels, trade, and conservation.\nRichard Fordyce, USDA Under Secretary for Farm Production and Conservation\nThe Agriculture Department is preparing to roll out the second stage of the supplemental disaster relief program. We asked Richa",
        "authors": "None",
        "publish_date": "2025-11-22 15:00:00",
        "published_at_raw": "2025-11-22T15:00:00Z",
        "meta_site_name": "Successful Farming",
        "description": "USDA’s Richard Fordyce, American Farm Bureau’s Joby Young, .S. Meat Export Federation’s Dan Halstrom, and Growth Energy’s Emily Skor discuss disaster relief, trade with China, biofuel policy, and the farm bill outlook.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:40:23",
        "filter_status": "T",
        "named_entities": [],
        "triples": [],
        "article_embedding": null,
        "fill_mode": "relaxed",
        "fill_reason": "min_per_keyword=2"
    }
]