[
    {
        "id": "1d1ce2961dccc3f0d1cfcb5e1c9a1895",
        "title": "It's important to preserve SC agricultural legacy",
        "doc_url": "https://www.postandcourier.com/opinion/commentary/clemson-usda-vegetable-research-lab-sc/article_e76e8638-ecb8-4175-af2f-662c06d6441c.html",
        "all_text": "Charleston’s Design Review Board was right to deny Clemson University’s request to demolish the former U.S. Department of Agriculture vegetable research laboratory on Savannah Highway. The decision was not merely about bricks and mortar. It was about whether we value place-based knowledge, public research and the scientists who quietly built South Carolina’s agricultural legacy or whether we allow institutional convenience to erase them.\nClemson’s argument rested on an artificial separation: that the historic laboratory building could be divorced from the greenhouse facilities behind it, and that both could be disconnected from the surrounding land where research outcomes were proven in the field. This framing ignores how agricultural science actually works. Research does not happen in silos, and it certainly does not happen in isolation from the land and the people it serves.\nThe site functioned as a single, integrated system, one that supported farmers across the Southeast for decades.\nThe process was straightforward and deeply effective. A local farmer encountered a real problem: crop loss from pests such as root-knot nematodes, disease pressure or declining yields. That problem came to the USDA research laboratory, where scientists designed controlled experiments and genetic solutions. The greenhouse facilities behind the lab were essential, allowing researchers to propagate experimental plant varieties under controlled conditions. The work then moved into the adjacent fi",
        "authors": "None",
        "publish_date": "2026-02-01 21:15:00",
        "published_at_raw": "2026-02-01T21:15:00Z",
        "meta_site_name": "Charleston Post and Courier",
        "description": "Denying Clemson request to demolish former USDA vegetable research lab highlights need to preserve historical agricultural sites, contributions of scientists",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "T",
        "named_entities": [
            "Clemson University",
            "U.S. Department of Agriculture",
            "South Carolina"
        ],
        "triples": [],
        "article_embedding": null,
        "fill_mode": "relaxed",
        "fill_reason": "min_per_keyword=2"
    },
    {
        "id": "4df7e110f79c4c90886017205ccdad07",
        "title": "Michigan among top states for foreign-owned farmland, USDA report shows",
        "doc_url": "https://www.mlive.com/news/2026/02/in-a-year-foreign-investors-bought-another-71000-acres-of-michigan-agricultural-land.html",
        "all_text": "An investment fund tied to Japan bought thousands of acres of Michigan forest two years ago, picking up parcels across seven Upper Peninsula counties.\nThe deal included nearly 42,000 acres in Marquette County, roughly 9,000 acres in Gogebic County and almost 6,000 acres in Ontonagon County, among others.\nThese tracts joined Michigan’s growing ledger of foreign-owned agricultural land, which includes forest land, cropland and pastures.\nIn a year, foreign buyers picked up roughly 71,000 acres of Michigan farmland, the latest federal data shows, putting Michigan among the top states for agricultural land owned by overseas investors.\nMichigan ranks sixth for the number of acres and third for the percentage of agricultural land held by foreign entities.\nThe acreage ticked up – going from 8.5% to 8.8% of the state’s agricultural land – despite a growing push from lawmakers to restrict foreign buyers from scooping up land throughout the country.\nEven so, this remains a fraction of Michigan’s farming acreage.\n“When it comes to foreign ownership, the thing to keep in mind is that we’re talking about a very small share of privately held agricultural land that is owned by foreign entities,” said David Ortega, an economics professor from Michigan State University.\nForeign buyers focus on Michigan forests\nForeign investors – anyone who’s not a citizen, not a legal immigrant or U.S. entities that have a “significant foreign interest” – are required to report their land purchases to the U.S",
        "authors": "None",
        "publish_date": "2026-02-01 12:00:00",
        "published_at_raw": "2026-02-01T12:00:00Z",
        "meta_site_name": "M Live Michigan ",
        "description": "Michigan ranks among the top states for foreign ownership of agricultural land, with most of the acreage being Upper Peninsula forests.",
        "key_word": "\"United States Department of Agriculture\" OR USDA",
        "collected_at": "2026-02-04 15:39:55",
        "filter_status": "T",
        "named_entities": [
            "Michigan",
            "Japan",
            "David Ortega",
            "USDA"
        ],
        "triples": [],
        "article_embedding": null,
        "fill_mode": "relaxed",
        "fill_reason": "min_per_keyword=2"
    }
]